-- MySQL dump 10.13  Distrib 8.0.12, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: harbour
-- ------------------------------------------------------
-- Server version	8.0.12

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `bmaxttl`
--

DROP TABLE IF EXISTS `bmaxttl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `bmaxttl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `jzxbwcd` int(11) NOT NULL,
  `f_jzxbwcd` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `jzxttl_xs` decimal(65,2) DEFAULT NULL,
  `jzxttl_zl` decimal(65,2) DEFAULT NULL,
  `f_jzxttl_zl` decimal(65,2) DEFAULT NULL,
  `hwttl` decimal(65,2) GENERATED ALWAYS AS ((`jzxttl_zl` + `f_jzxttl_zl`)) STORED,
  `jzxbwbmaxttl` decimal(65,2) GENERATED ALWAYS AS ((case when (`jzxbwcd` = 0) then 0 else ((`jzxttl_xs` * 100) / `jzxbwcd`) end)) STORED,
  `jzxbwbmaxttl_metric` int(11) GENERATED ALWAYS AS ((case when (`jzxbwbmaxttl` < 2) then 1 when (`jzxbwbmaxttl` < 4) then 2 when (`jzxbwbmaxttl` < 6) then 3 when (`jzxbwbmaxttl` < 8) then 4 when (`jzxbwbmaxttl` < 10) then 5 when (`jzxbwbmaxttl` < 15) then 6 when (`jzxbwbmaxttl` < 20) then 7 when (`jzxbwbmaxttl` < 25) then 8 when (`jzxbwbmaxttl` < 30) then 9 else 10 end)) STORED,
  `f_jzxbwbmaxttl` decimal(65,2) GENERATED ALWAYS AS ((case when (`f_jzxbwcd` = 0) then 0 else ((`f_jzxttl_zl` * 100) / `f_jzxbwcd`) end)) VIRTUAL,
  `f_jzxbwbmaxttl_metric` int(11) GENERATED ALWAYS AS ((case when (`f_jzxbwbmaxttl` < 40) then 1 when (`f_jzxbwbmaxttl` < 50) then 2 when (`f_jzxbwbmaxttl` < 60) then 3 when (`f_jzxbwbmaxttl` < 70) then 4 when (`f_jzxbwbmaxttl` < 80) then 5 when (`f_jzxbwbmaxttl` < 90) then 6 when (`f_jzxbwbmaxttl` < 100) then 7 when (`f_jzxbwbmaxttl` < 125) then 8 when (`f_jzxbwbmaxttl` < 150) then 9 else 10 end)) VIRTUAL,
  `total_metric` decimal(65,2) GENERATED ALWAYS AS ((((`jzxbwbmaxttl_metric` * `jzxttl_zl`) + (`f_jzxbwbmaxttl_metric` * `f_jzxttl_zl`)) / `hwttl`)) VIRTUAL,
  `zbwcd` int(11) GENERATED ALWAYS AS ((`jzxbwcd` + `f_jzxbwcd`)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `jzxbwcd_index` (`jzxbwcd`),
  KEY `f_jzxbwcd_index` (`f_jzxbwcd`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=702 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bmaxttl`
--

LOCK TABLES `bmaxttl` WRITE;
/*!40000 ALTER TABLE `bmaxttl` DISABLE KEYS */;
INSERT INTO `bmaxttl` (`id`, `gk`, `jzxbwcd`, `f_jzxbwcd`, `year`, `jzxttl_xs`, `jzxttl_zl`, `f_jzxttl_zl`) VALUES (567,'大连港',4393,35056,2014,1013.23,12326.00,30011.00),(568,'营口港',2047,15385,2014,561.16,12736.00,20337.00),(569,'秦皇岛港',537,15391,2014,41.40,585.00,26818.00),(570,'黄骅港',0,8761,2014,31.40,381.00,17170.00),(571,'唐山港',1247,22468,2014,110.86,1757.00,48318.00),(572,'天津港',7687,28267,2014,1406.06,15904.00,38098.00),(573,'烟台港',3339,24812,2014,235.63,1918.00,21849.00),(574,'青岛港',6945,18901,2014,1658.42,17832.00,28970.00),(575,'日照港',844,13863,2014,242.03,3935.00,29567.00),(576,'连云港港',2726,11973,2014,500.54,4977.00,14661.00),(577,'上海港',12335,63065,2014,3528.53,35335.00,31619.00),(578,'宁波-舟山港',9538,70587,2014,1944.96,19958.00,67388.00),(579,'温州港',252,10674,2014,60.08,822.00,7079.00),(580,'福州港',2169,20557,2014,223.94,3020.00,11371.00),(581,'厦门港',7992,19224,2014,857.24,9791.00,10713.00),(582,'深圳港',16943,12161,2014,2403.73,18069.00,4255.00),(583,'广州港',8088,38912,2014,1638.86,24087.00,24130.00),(584,'珠海港',934,16834,2014,117.57,1598.00,9105.00),(585,'汕头港',460,9167,2014,130.30,1250.00,3911.00),(586,'湛江港',1074,13138,2014,58.08,819.00,19419.00),(587,'北部湾港',498,33005,2014,112.00,1960.00,18229.00),(588,'海口港',590,6130,2014,134.67,2461.00,6454.00),(589,'南通港',640,16900,2014,71.10,749.00,20850.00),(590,'苏州港',3685,45215,2014,444.99,6284.00,41508.00),(591,'镇江港',1279,18597,2014,37.55,551.00,13510.00),(592,'南京港',2377,33468,2014,276.46,2517.00,18484.00),(593,'大连港',4393,37262,2015,944.86,11474.00,30008.00),(594,'营口港',2047,16185,2015,592.25,13446.00,20403.00),(595,'秦皇岛港',537,15391,2015,50.09,619.00,24690.00),(596,'黄骅港',0,8761,2015,50.18,634.00,16024.00),(597,'唐山港',1247,24874,2015,152.25,2335.00,46950.00),(598,'天津港',7687,31042,2015,1411.13,15492.00,38559.00),(599,'烟台港',3339,26518,2015,245.22,2090.00,23073.00),(600,'青岛港',6945,21390,2015,1743.56,17936.00,30517.00),(601,'日照港',844,14762,2015,281.14,5585.00,28122.00),(602,'连云港港',2726,13174,2015,500.97,4964.00,14792.00),(603,'上海港',12335,62865,2015,3653.70,35850.00,29056.00),(604,'宁波-舟山港',9538,73451,2015,2062.65,20606.00,68323.00),(605,'温州港',252,16867,2015,55.87,774.00,7716.00),(606,'福州港',2169,21518,2015,242.82,3463.00,10504.00),(607,'厦门港',7992,20293,2015,918.28,10401.00,10622.00),(608,'深圳港',16943,14437,2015,2420.45,18008.00,3698.00),(609,'广州港',8088,38912,2015,1739.66,25836.00,24217.00),(610,'珠海港',934,16332,2015,133.77,1877.00,9332.00),(611,'汕头港',460,9167,2015,117.86,1138.00,4043.00),(612,'湛江港',1074,15219,2015,60.12,863.00,21173.00),(613,'北部湾港',498,34845,2015,141.52,2549.00,17933.00),(614,'海口港',590,7423,2015,127.13,2374.00,6830.00),(615,'南通港',640,16900,2015,75.85,776.00,21051.00),(616,'苏州港',3685,47315,2015,510.19,7480.00,46510.00),(617,'镇江港',1279,21800,2015,40.71,479.00,12531.00),(618,'南京港',2377,33897,2015,294.01,2680.00,18774.00),(619,'大连港',4393,37262,2016,958.30,11880.00,31780.01),(620,'营口港',2047,16185,2016,608.73,13439.00,21778.02),(621,'秦皇岛港',537,15391,2016,51.55,609.00,18072.57),(622,'黄骅港',0,9059,2016,60.15,714.00,23761.00),(623,'唐山港',1247,26942,2016,193.57,2879.00,49172.35),(624,'天津港',7687,31702,2016,1451.92,15691.00,39364.75),(625,'烟台港',3339,28101,2016,260.14,2214.00,24322.87),(626,'青岛港',6945,21644,2016,1805.01,18441.00,31595.32),(627,'日照港',844,16445,2016,301.02,6838.00,28169.26),(628,'连云港港',2726,13724,2016,470.33,4843.00,15239.00),(629,'上海港',12335,61765,2016,3713.31,36736.00,27745.62),(630,'宁波-舟山港',9538,75951,2016,2156.13,21907.00,70302.24),(631,'温州港',252,16867,2016,55.92,817.00,7589.08),(632,'福州港',2169,23038,2016,268.12,3778.00,10737.66),(633,'厦门港',7992,21244,2016,961.37,11001.00,9909.78),(634,'深圳港',16943,15507,2016,2397.94,17708.00,3701.88),(635,'广州港',8088,38912,2016,1866.18,27598.00,24655.82),(636,'珠海港',934,17440,2016,165.35,2742.00,9036.74),(637,'汕头港',460,9815,2016,124.02,1226.00,3759.05),(638,'湛江港',1074,15719,2016,72.36,1030.00,24582.50),(639,'北部湾港',498,36105,2016,179.49,3335.00,17056.60),(640,'海口港',590,7423,2016,140.18,2678.00,7273.85),(641,'南通港',640,17579,2016,82.69,899.00,21714.84),(642,'苏州港',3685,50355,2016,547.92,7697.00,50239.59),(643,'镇江港',1279,22792,2016,37.30,550.00,12586.92),(644,'南京港',2377,35549,2016,308.39,2656.00,19317.46),(645,'大连港',4393,37262,2017,970.00,12025.04,33079.96),(646,'营口港',2047,16185,2017,627.00,13842.35,22396.65),(647,'秦皇岛港',537,15391,2017,55.90,660.39,23819.61),(648,'黄骅港',0,9059,2017,65.40,776.29,26180.71),(649,'唐山港',1247,26942,2017,253.00,3762.91,52777.09),(650,'天津港',7687,31702,2017,1504.00,16253.83,34030.17),(651,'烟台港',3339,28101,2017,270.20,2299.62,26260.38),(652,'青岛港',6945,21644,2017,1830.00,18696.31,32102.69),(653,'日照港',844,16445,2017,323.80,7355.47,28646.53),(654,'连云港港',2726,13724,2017,472.00,4860.20,15878.80),(655,'上海港',12335,61765,2017,4018.00,39750.32,30812.68),(656,'宁波-舟山港',9538,78451,2017,2464.00,25035.06,75675.94),(657,'温州港',252,16867,2017,60.09,877.92,8048.08),(658,'福州港',2169,23038,2017,300.00,4227.21,10371.79),(659,'厦门港',7992,21244,2017,1040.00,11900.77,9145.23),(660,'深圳港',16943,15507,2017,2525.00,18646.30,5450.70),(661,'广州港',8088,38912,2017,2010.00,29724.88,26894.12),(662,'珠海港',934,17440,2017,230.00,3814.09,9185.91),(663,'汕头港',460,9815,2017,129.90,1284.13,3605.57),(664,'湛江港',1074,15719,2017,90.00,1281.09,13018.91),(665,'北部湾港',498,36105,2017,227.87,4233.92,17494.08),(666,'海口港',590,7423,2017,163.60,3125.42,6987.18),(667,'南通港',640,17579,2017,100.71,1094.91,22474.09),(668,'苏州港',3685,50355,2017,600.00,8428.60,52345.40),(669,'镇江港',1279,22792,2017,38.00,560.32,13868.68),(670,'南京港',2377,35549,2017,317.00,2730.15,21182.85);
/*!40000 ALTER TABLE `bmaxttl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bmaxttl_nh`
--

DROP TABLE IF EXISTS `bmaxttl_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `bmaxttl_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `gkhwttl` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `mtaxcd` decimal(12,2) NOT NULL,
  `bmmtaxttl` decimal(65,2) GENERATED ALWAYS AS ((`gkhwttl` / `mtaxcd`)) STORED,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`bmmtaxttl` <= 5) then 1 when (`bmmtaxttl` >= 50) then 10 else ((1 / 5) * `bmmtaxttl`) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`),
  KEY `mtaxcd_index` (`mtaxcd`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bmaxttl_nh`
--

LOCK TABLES `bmaxttl_nh` WRITE;
/*!40000 ALTER TABLE `bmaxttl_nh` DISABLE KEYS */;
INSERT INTO `bmaxttl_nh` (`id`, `gk`, `gkhwttl`, `year`, `mtaxcd`) VALUES (1,'泸州港',3134.00,2014,84.00),(2,'重庆港',14665.00,2014,563.00),(3,'武汉港',8150.00,2014,393.00),(4,'岳阳港',12021.00,2014,314.00),(5,'九江港',8036.00,2014,257.00),(6,'芜湖港',10847.00,2014,143.00),(7,'湖州港',8487.00,2014,203.00),(8,'贵港港',5242.00,2014,115.00),(9,'佛山港',5907.00,2014,166.00),(10,'徐州港',9202.00,2014,182.00),(11,'杭州港',10084.00,2014,205.00),(12,'哈尔滨港',133.00,2014,28.00),(13,'佳木斯港',208.00,2014,37.00),(14,'泸州港',3247.00,2015,84.00),(15,'重庆港',15750.00,2015,563.00),(16,'武汉港',8455.00,2015,393.00),(17,'岳阳港',13144.00,2015,314.00),(18,'九江港',10425.00,2015,257.00),(19,'芜湖港',12009.00,2015,143.00),(20,'湖州港',8052.00,2015,203.00),(21,'贵港港',5334.00,2015,115.00),(22,'佛山港',6147.00,2015,166.00),(23,'徐州港',9030.00,2015,182.00),(24,'杭州港',9372.00,2015,205.00),(25,'哈尔滨港',136.00,2015,28.00),(26,'佳木斯港',212.00,2015,37.00),(27,'泸州港',3458.57,2016,84.00),(28,'重庆港',17372.14,2016,563.00),(29,'武汉港',9000.05,2016,393.00),(30,'岳阳港',14082.21,2016,314.00),(31,'九江港',11327.97,2016,257.00),(32,'芜湖港',13101.19,2016,143.00),(33,'湖州港',8664.11,2016,203.00),(34,'贵港港',5763.42,2016,115.00),(35,'佛山港',6610.00,2016,166.00),(36,'徐州港',9050.77,2016,182.00),(37,'杭州港',7278.69,2016,205.00),(38,'哈尔滨港',127.44,2016,28.00),(39,'佳木斯港',203.54,2016,37.00),(40,'泸州港',3492.98,2017,84.00),(41,'重庆港',19722.29,2017,563.00),(42,'武汉港',10017.97,2017,393.00),(43,'岳阳港',11932.13,2017,314.00),(44,'九江港',11717.19,2017,257.00),(45,'芜湖港',12805.88,2017,143.00),(46,'湖州港',10540.41,2017,203.00),(47,'贵港港',6322.02,2017,115.00),(48,'佛山港',7967.40,2017,166.00),(49,'徐州港',7419.58,2017,182.00),(50,'杭州港',10714.30,2017,205.00),(51,'哈尔滨港',121.76,2017,28.00),(52,'佳木斯港',197.90,2017,37.00);
/*!40000 ALTER TABLE `bmaxttl_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `bmaxttl_stat`
--

DROP TABLE IF EXISTS `bmaxttl_stat`;
/*!50001 DROP VIEW IF EXISTS `bmaxttl_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `bmaxttl_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `cbzgpjts`
--

DROP TABLE IF EXISTS `cbzgpjts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `cbzgpjts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `wmc_pjqdts` decimal(12,2) DEFAULT NULL,
  `nmc_pjqdts` decimal(12,2) DEFAULT NULL,
  `nm_hwttl` decimal(12,2) DEFAULT NULL,
  `wm_hwttl` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `hwttl_zl` decimal(12,2) GENERATED ALWAYS AS ((`nm_hwttl` + `wm_hwttl`)) VIRTUAL,
  `wm_ttlbz` decimal(12,2) GENERATED ALWAYS AS ((`wm_hwttl` / `hwttl_zl`)) VIRTUAL,
  `nm_ttlbz` decimal(12,2) GENERATED ALWAYS AS ((1 - `wm_ttlbz`)) VIRTUAL,
  `jqpjqdts` decimal(12,2) GENERATED ALWAYS AS (((`wmc_pjqdts` * `wm_ttlbz`) + (`nmc_pjqdts` * `nm_ttlbz`))) VIRTUAL,
  `metric` decimal(12,2) GENERATED ALWAYS AS ((case when (`jqpjqdts` <= 0.03) then 10 when (`jqpjqdts` >= 0.15) then 1 else ((-(75) * `jqpjqdts`) + 12.25) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=183 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cbzgpjts`
--

LOCK TABLES `cbzgpjts` WRITE;
/*!40000 ALTER TABLE `cbzgpjts` DISABLE KEYS */;
INSERT INTO `cbzgpjts` (`id`, `gk`, `wmc_pjqdts`, `nmc_pjqdts`, `nm_hwttl`, `wm_hwttl`, `year`) VALUES (79,'大连港',0.04,0.05,29750.50,13909.51,2014),(80,'营口港',0.14,0.06,27261.89,7955.13,2014),(81,'秦皇岛港',0.15,0.08,17180.41,1501.16,2014),(82,'黄骅港',0.15,0.08,19500.00,500.00,2014),(83,'唐山港',0.06,0.07,33000.00,13000.00,2014),(84,'天津港',0.06,0.07,21244.00,3231.00,2014),(85,'烟台港',0.11,0.09,22744.18,29307.17,2014),(86,'青岛港',0.04,0.07,25362.95,29692.80,2014),(87,'日照港',0.06,0.07,17388.65,9148.22,2014),(88,'连云港港',0.07,0.04,16747.93,33288.39,2014),(89,'上海港',0.05,0.10,11761.44,23245.82,2014),(90,'宁波-舟山港',0.03,0.05,8849.12,11232.88,2014),(91,'温州港',0.07,0.08,26469.34,38012.28,2014),(92,'福州港',0.08,0.13,49074.20,43135.04,2014),(93,'厦门港',0.08,0.14,7969.15,436.93,2014),(94,'深圳港',0.07,0.25,8632.57,5883.09,2014),(95,'广州港',0.14,0.11,11115.43,9795.35,2014),(96,'珠海港',0.28,0.16,3387.49,18022.39,2014),(97,'汕头港',0.08,0.10,39657.79,12596.03,2014),(98,'湛江港',0.06,0.12,9255.43,2523.31,2014),(99,'北部湾港',0.08,0.16,3826.47,1158.58,2014),(100,'海口港',0.88,0.09,18009.11,7603.39,2014),(101,'南通港',0.10,0.10,8298.08,12093.52,2014),(102,'苏州港',0.10,0.10,9668.46,283.39,2014),(103,'镇江港',0.10,0.10,9668.46,283.39,2014),(104,'南京港',0.10,0.10,9668.46,283.39,2014),(105,'大连港',0.04,0.05,29750.50,13909.51,2015),(106,'营口港',0.09,0.05,27261.89,7955.13,2015),(107,'秦皇岛港',0.13,0.07,17180.41,1501.16,2015),(108,'黄骅港',0.13,0.07,19500.00,500.00,2015),(109,'唐山港',0.07,0.08,33000.00,13000.00,2015),(110,'天津港',0.07,0.08,21244.00,3231.00,2015),(111,'烟台港',0.10,0.10,22744.18,29307.17,2015),(112,'青岛港',0.04,0.07,25362.95,29692.80,2015),(113,'日照港',0.05,0.05,17388.65,9148.22,2015),(114,'连云港港',0.06,0.04,16747.93,33288.39,2015),(115,'上海港',0.04,0.10,11761.44,23245.82,2015),(116,'宁波-舟山港',0.03,0.05,8849.12,11232.88,2015),(117,'温州港',0.07,0.07,26469.34,38012.28,2015),(118,'福州港',0.09,0.14,49074.20,43135.04,2015),(119,'厦门港',0.08,0.39,7969.15,436.93,2015),(120,'深圳港',0.07,0.23,8632.57,5883.09,2015),(121,'广州港',0.14,0.14,11115.43,9795.35,2015),(122,'珠海港',0.30,0.17,3387.49,18022.39,2015),(123,'汕头港',0.11,0.09,39657.79,12596.03,2015),(124,'湛江港',0.05,0.13,9255.43,2523.31,2015),(125,'北部湾港',0.05,0.13,3826.47,1158.58,2015),(126,'海口港',0.22,0.08,18009.11,7603.39,2015),(127,'南通港',0.10,0.10,8298.08,12093.52,2015),(128,'苏州港',0.10,0.10,9668.46,283.39,2015),(129,'镇江港',0.10,0.10,9668.46,283.39,2015),(130,'南京港',0.10,0.10,9668.46,283.39,2015),(131,'大连港',0.03,0.04,29750.50,13909.51,2016),(132,'营口港',0.07,0.05,27261.89,7955.13,2016),(133,'秦皇岛港',0.11,0.10,17180.41,1501.16,2016),(134,'黄骅港',0.11,0.10,19500.00,500.00,2016),(135,'唐山港',0.06,0.08,33000.00,13000.00,2016),(136,'天津港',0.06,0.08,21244.00,3231.00,2016),(137,'烟台港',0.08,0.08,22744.18,29307.17,2016),(138,'青岛港',0.04,0.07,25362.95,29692.80,2016),(139,'日照港',0.06,0.05,17388.65,9148.22,2016),(140,'连云港港',0.05,0.03,16747.93,33288.39,2016),(141,'上海港',0.04,0.12,11761.44,23245.82,2016),(142,'宁波-舟山港',0.03,0.06,8849.12,11232.88,2016),(143,'温州港',0.08,0.07,26469.34,38012.28,2016),(144,'福州港',0.09,0.21,49074.20,43135.04,2016),(145,'厦门港',0.09,0.32,7969.15,436.93,2016),(146,'深圳港',0.07,0.24,8632.57,5883.09,2016),(147,'广州港',0.11,0.12,11115.43,9795.35,2016),(148,'珠海港',0.31,0.16,3387.49,18022.39,2016),(149,'汕头港',0.10,0.09,39657.79,12596.03,2016),(150,'湛江港',0.04,0.06,9255.43,2523.31,2016),(151,'北部湾港',0.04,0.10,3826.47,1158.58,2016),(152,'海口港',0.17,0.08,18009.11,7603.39,2016),(153,'南通港',0.10,0.10,8298.08,12093.52,2016),(154,'苏州港',0.10,0.10,9668.46,283.39,2016),(155,'镇江港',0.10,0.10,9668.46,283.39,2016),(156,'南京港',0.10,0.10,9668.46,283.39,2016),(157,'大连港',0.03,0.04,29750.50,13909.51,2017),(158,'营口港',0.07,0.05,27261.89,7955.13,2017),(159,'秦皇岛港',0.11,0.10,17180.41,1501.16,2017),(160,'黄骅港',0.11,0.10,19500.00,500.00,2017),(161,'唐山港',0.06,0.08,33000.00,13000.00,2017),(162,'天津港',0.06,0.08,21244.00,3231.00,2017),(163,'烟台港',0.08,0.08,22744.18,29307.17,2017),(164,'青岛港',0.04,0.07,25362.95,29692.80,2017),(165,'日照港',0.06,0.05,17388.65,9148.22,2017),(166,'连云港港',0.05,0.03,16747.93,33288.39,2017),(167,'上海港',0.04,0.12,11761.44,23245.82,2017),(168,'宁波-舟山港',0.03,0.06,8849.12,11232.88,2017),(169,'温州港',0.08,0.07,26469.34,38012.28,2017),(170,'福州港',0.09,0.21,49074.20,43135.04,2017),(171,'厦门港',0.09,0.32,7969.15,436.93,2017),(172,'深圳港',0.07,0.24,8632.57,5883.09,2017),(173,'广州港',0.11,0.12,11115.43,9795.35,2017),(174,'珠海港',0.31,0.16,3387.49,18022.39,2017),(175,'汕头港',0.10,0.09,39657.79,12596.03,2017),(176,'湛江港',0.04,0.06,9255.43,2523.31,2017),(177,'北部湾港',0.04,0.10,3826.47,1158.58,2017),(178,'海口港',0.17,0.08,18009.11,7603.39,2017),(179,'南通港',0.10,0.10,8298.08,12093.52,2017),(180,'苏州港',0.10,0.10,9668.46,283.39,2017),(181,'镇江港',0.10,0.10,9668.46,283.39,2017),(182,'南京港',0.10,0.10,9668.46,283.39,2017);
/*!40000 ALTER TABLE `cbzgpjts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `cbzgpjts_stat`
--

DROP TABLE IF EXISTS `cbzgpjts_stat`;
/*!50001 DROP VIEW IF EXISTS `cbzgpjts_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `cbzgpjts_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `dckbsl`
--

DROP TABLE IF EXISTS `dckbsl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `dckbsl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `dckbsl` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`dckbsl` <= 50) then 1 when (`dckbsl` >= 4000) then 10 else (((`dckbsl` * 9.0) / 3950) + (70 / 79.0)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `dcsl_index` (`dckbsl`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=183 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dckbsl`
--

LOCK TABLES `dckbsl` WRITE;
/*!40000 ALTER TABLE `dckbsl` DISABLE KEYS */;
INSERT INTO `dckbsl` (`id`, `gk`, `dckbsl`, `year`) VALUES (79,'大连港',412,2014),(80,'营口港',295,2014),(81,'秦皇岛港',69,2014),(82,'黄骅港',65,2014),(83,'唐山港',787,2014),(84,'天津港',3460,2014),(85,'烟台港',115,2014),(86,'青岛港',3064,2014),(87,'日照港',607,2014),(88,'连云港港',676,2014),(89,'上海港',2706,2014),(90,'宁波-舟山港',6280,2014),(91,'温州港',0,2014),(92,'福州港',143,2014),(93,'厦门港',1684,2014),(94,'深圳港',4961,2014),(95,'广州港',819,2014),(96,'珠海港',35,2014),(97,'汕头港',117,2014),(98,'湛江港',593,2014),(99,'北部湾港',362,2014),(100,'海口港',0,2014),(101,'南通港',826,2014),(102,'苏州港',610,2014),(103,'镇江港',30,2014),(104,'南京港',55,2014),(105,'大连港',412,2015),(106,'营口港',295,2015),(107,'秦皇岛港',69,2015),(108,'黄骅港',65,2015),(109,'唐山港',787,2015),(110,'天津港',3460,2015),(111,'烟台港',115,2015),(112,'青岛港',3064,2015),(113,'日照港',607,2015),(114,'连云港港',676,2015),(115,'上海港',2706,2015),(116,'宁波-舟山港',6280,2015),(117,'温州港',0,2015),(118,'福州港',143,2015),(119,'厦门港',1684,2015),(120,'深圳港',4961,2015),(121,'广州港',819,2015),(122,'珠海港',35,2015),(123,'汕头港',117,2015),(124,'湛江港',593,2015),(125,'北部湾港',362,2015),(126,'海口港',0,2015),(127,'南通港',826,2015),(128,'苏州港',610,2015),(129,'镇江港',30,2015),(130,'南京港',55,2015),(131,'大连港',412,2016),(132,'营口港',295,2016),(133,'秦皇岛港',69,2016),(134,'黄骅港',65,2016),(135,'唐山港',787,2016),(136,'天津港',3460,2016),(137,'烟台港',115,2016),(138,'青岛港',3064,2016),(139,'日照港',607,2016),(140,'连云港港',676,2016),(141,'上海港',2706,2016),(142,'宁波-舟山港',6280,2016),(143,'温州港',0,2016),(144,'福州港',143,2016),(145,'厦门港',1684,2016),(146,'深圳港',4961,2016),(147,'广州港',819,2016),(148,'珠海港',35,2016),(149,'汕头港',117,2016),(150,'湛江港',593,2016),(151,'北部湾港',362,2016),(152,'海口港',0,2016),(153,'南通港',826,2016),(154,'苏州港',610,2016),(155,'镇江港',30,2016),(156,'南京港',55,2016),(157,'大连港',412,2017),(158,'营口港',295,2017),(159,'秦皇岛港',69,2017),(160,'黄骅港',65,2017),(161,'唐山港',787,2017),(162,'天津港',3460,2017),(163,'烟台港',115,2017),(164,'青岛港',3064,2017),(165,'日照港',607,2017),(166,'连云港港',676,2017),(167,'上海港',2706,2017),(168,'宁波-舟山港',6280,2017),(169,'温州港',0,2017),(170,'福州港',143,2017),(171,'厦门港',1684,2017),(172,'深圳港',4961,2017),(173,'广州港',819,2017),(174,'珠海港',35,2017),(175,'汕头港',117,2017),(176,'湛江港',593,2017),(177,'北部湾港',362,2017),(178,'海口港',0,2017),(179,'南通港',826,2017),(180,'苏州港',610,2017),(181,'镇江港',30,2017),(182,'南京港',55,2017);
/*!40000 ALTER TABLE `dckbsl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `dckbsl_stat`
--

DROP TABLE IF EXISTS `dckbsl_stat`;
/*!50001 DROP VIEW IF EXISTS `dckbsl_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `dckbsl_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `ddsr`
--

DROP TABLE IF EXISTS `ddsr`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `ddsr` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `ddsr` decimal(65,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`ddsr` <= 2) then 1 when (`ddsr` >= 30) then 10 else (((`ddsr` * 9.0) / 28) + (5 / 14.0)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=184 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ddsr`
--

LOCK TABLES `ddsr` WRITE;
/*!40000 ALTER TABLE `ddsr` DISABLE KEYS */;
INSERT INTO `ddsr` (`id`, `gk`, `ddsr`, `year`) VALUES (79,'大连港',6.48,2014),(80,'营口港',6.46,2014),(81,'秦皇岛港',18.90,2014),(82,'黄骅港',20.94,2014),(83,'唐山港',22.97,2014),(84,'天津港',27.16,2014),(85,'烟台港',15.00,2014),(86,'青岛港',18.79,2014),(87,'日照港',15.06,2014),(88,'连云港港',9.16,2014),(89,'上海港',26.99,2014),(90,'宁波-舟山港',24.80,2014),(91,'温州港',13.23,2014),(92,'福州港',1.04,2014),(93,'厦门港',17.33,2014),(94,'深圳港',26.85,2014),(95,'广州港',15.12,2014),(96,'珠海港',6.27,2014),(97,'汕头港',14.36,2014),(98,'湛江港',21.66,2014),(99,'北部湾港',25.59,2014),(100,'海口港',5.43,2014),(101,'南通港',11.53,2014),(102,'苏州港',8.33,2014),(103,'镇江港',9.55,2014),(104,'南京港',12.95,2014),(105,'大连港',7.58,2015),(106,'营口港',7.44,2015),(107,'秦皇岛港',18.43,2015),(108,'黄骅港',20.77,2015),(109,'唐山港',23.66,2015),(110,'天津港',30.54,2015),(111,'烟台港',15.00,2015),(112,'青岛港',18.96,2015),(113,'日照港',13.49,2015),(114,'连云港港',8.76,2015),(115,'上海港',28.32,2015),(116,'宁波-舟山港',30.80,2015),(117,'温州港',12.06,2015),(118,'福州港',0.97,2015),(119,'厦门港',17.45,2015),(120,'深圳港',26.24,2015),(121,'广州港',14.25,2015),(122,'珠海港',6.32,2015),(123,'汕头港',1.28,2015),(124,'湛江港',18.51,2015),(125,'北部湾港',24.08,2015),(126,'海口港',6.15,2015),(127,'南通港',11.49,2015),(128,'苏州港',7.19,2015),(129,'镇江港',9.47,2015),(130,'南京港',13.10,2015),(131,'大连港',7.58,2016),(132,'营口港',7.44,2016),(133,'秦皇岛港',18.43,2016),(134,'黄骅港',20.77,2016),(135,'唐山港',23.66,2016),(136,'天津港',30.54,2016),(137,'烟台港',15.00,2016),(138,'青岛港',18.96,2016),(139,'日照港',13.49,2016),(140,'连云港港',8.76,2016),(141,'上海港',28.32,2016),(142,'宁波-舟山港',24.20,2016),(143,'温州港',12.06,2016),(144,'福州港',0.97,2016),(145,'厦门港',17.45,2016),(146,'深圳港',26.24,2016),(147,'广州港',14.25,2016),(148,'珠海港',6.32,2016),(149,'汕头港',1.28,2016),(150,'湛江港',18.51,2016),(151,'北部湾港',24.08,2016),(152,'海口港',6.15,2016),(153,'南通港',11.49,2016),(154,'苏州港',7.19,2016),(155,'镇江港',9.47,2016),(156,'南京港',13.10,2016),(157,'大连港',7.58,2017),(158,'营口港',7.44,2017),(159,'秦皇岛港',18.43,2017),(160,'黄骅港',20.77,2017),(161,'唐山港',23.66,2017),(162,'天津港',30.54,2017),(163,'烟台港',15.00,2017),(164,'青岛港',18.96,2017),(165,'日照港',13.49,2017),(166,'连云港港',8.76,2017),(167,'上海港',28.32,2017),(168,'宁波-舟山港',25.00,2017),(169,'温州港',12.06,2017),(170,'福州港',0.97,2017),(171,'厦门港',17.45,2017),(172,'深圳港',26.24,2017),(173,'广州港',14.25,2017),(174,'珠海港',6.32,2017),(175,'汕头港',1.28,2017),(176,'湛江港',18.51,2017),(177,'北部湾港',24.08,2017),(178,'海口港',6.15,2017),(179,'南通港',11.49,2017),(180,'苏州港',7.19,2017),(181,'镇江港',9.47,2017),(183,'南京港',13.10,2017);
/*!40000 ALTER TABLE `ddsr` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ddsr_nh`
--

DROP TABLE IF EXISTS `ddsr_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `ddsr_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `gkzjz` decimal(65,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`gkzjz` <= 10) then 1 when (`gkzjz` >= 150) then 10 else (((9 / 140) * `gkzjz`) + (5 / 14)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ddsr_nh`
--

LOCK TABLES `ddsr_nh` WRITE;
/*!40000 ALTER TABLE `ddsr_nh` DISABLE KEYS */;
INSERT INTO `ddsr_nh` (`id`, `gk`, `gkzjz`, `year`) VALUES (1,'泸州港',22.54,2014),(2,'重庆港',103.86,2014),(3,'武汉港',92.41,2014),(4,'岳阳港',54.39,2014),(5,'九江港',62.52,2014),(6,'芜湖港',71.91,2014),(7,'湖州港',26.59,2014),(8,'贵港港',21.61,2014),(9,'佛山港',132.71,2014),(10,'徐州港',50.82,2014),(11,'杭州港',30.54,2014),(12,'哈尔滨港',1.28,2014),(13,'佳木斯港',0.57,2014),(14,'泸州港',27.73,2015),(15,'重庆港',109.79,2015),(16,'武汉港',89.95,2015),(17,'岳阳港',51.78,2015),(18,'九江港',69.72,2015),(19,'芜湖港',84.17,2015),(20,'湖州港',29.05,2015),(21,'贵港港',23.64,2015),(22,'佛山港',136.49,2015),(23,'徐州港',55.32,2015),(24,'杭州港',26.74,2015),(25,'哈尔滨港',1.31,2015),(26,'佳木斯港',0.58,2015),(27,'泸州港',32.72,2016),(28,'重庆港',114.69,2016),(29,'武汉港',96.28,2016),(30,'岳阳港',58.90,2016),(31,'九江港',69.74,2016),(32,'芜湖港',80.02,2016),(33,'湖州港',35.14,2016),(34,'贵港港',27.20,2016),(35,'佛山港',143.22,2016),(36,'徐州港',59.15,2016),(37,'杭州港',19.04,2016),(38,'哈尔滨港',1.20,2016),(39,'佳木斯港',0.56,2016),(40,'泸州港',34.71,2017),(41,'重庆港',129.46,2017),(42,'武汉港',110.80,2017),(43,'岳阳港',56.43,2017),(44,'九江港',74.07,2017),(45,'芜湖港',82.56,2017),(46,'湖州港',46.61,2017),(47,'贵港港',31.33,2017),(48,'佛山港',173.51,2017),(49,'徐州港',49.06,2017),(50,'杭州港',29.03,2017),(51,'哈尔滨港',1.15,2017),(52,'佳木斯港',0.54,2017);
/*!40000 ALTER TABLE `ddsr_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `ddsr_stat`
--

DROP TABLE IF EXISTS `ddsr_stat`;
/*!50001 DROP VIEW IF EXISTS `ddsr_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `ddsr_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `gkhwttl_nh`
--

DROP TABLE IF EXISTS `gkhwttl_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `gkhwttl_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `gkhwttl` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`gkhwttl` <= 1000) then 1 when (`gkhwttl` >= 15000) then 10 else (((9 / 14000) * `gkhwttl`) + (5 / 14)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=67 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gkhwttl_nh`
--

LOCK TABLES `gkhwttl_nh` WRITE;
/*!40000 ALTER TABLE `gkhwttl_nh` DISABLE KEYS */;
INSERT INTO `gkhwttl_nh` (`id`, `gk`, `gkhwttl`, `year`) VALUES (1,'泸州港',3134.00,2014),(2,'重庆港',14665.00,2014),(3,'武汉港',8150.00,2014),(4,'岳阳港',12021.00,2014),(5,'九江港',8036.00,2014),(6,'芜湖港',10847.00,2014),(7,'湖州港',8487.00,2014),(8,'贵港港',5242.00,2014),(9,'佛山港',5907.00,2014),(10,'徐州港',9202.00,2014),(11,'杭州港',10084.00,2014),(12,'哈尔滨港',133.00,2014),(13,'佳木斯港',208.00,2014),(14,'泸州港',3247.00,2015),(15,'重庆港',15750.00,2015),(16,'武汉港',8455.00,2015),(17,'岳阳港',13144.00,2015),(18,'九江港',10425.00,2015),(19,'芜湖港',12009.00,2015),(20,'湖州港',8052.00,2015),(21,'贵港港',5334.00,2015),(22,'佛山港',6147.00,2015),(23,'徐州港',9030.00,2015),(24,'杭州港',9372.00,2015),(25,'哈尔滨港',136.00,2015),(26,'佳木斯港',212.00,2015),(27,'泸州港',3458.57,2016),(28,'重庆港',17372.14,2016),(29,'武汉港',9000.05,2016),(30,'岳阳港',14082.21,2016),(31,'九江港',11327.97,2016),(32,'芜湖港',13101.19,2016),(33,'湖州港',8664.11,2016),(34,'贵港港',5763.42,2016),(35,'佛山港',6610.00,2016),(36,'徐州港',9050.77,2016),(37,'杭州港',7278.69,2016),(38,'哈尔滨港',127.44,2016),(39,'佳木斯港',203.54,2016),(40,'泸州港',3492.98,2017),(41,'重庆港',19722.29,2017),(42,'武汉港',10017.97,2017),(43,'岳阳港',11932.13,2017),(44,'九江港',11717.19,2017),(45,'芜湖港',12805.88,2017),(46,'湖州港',10540.41,2017),(47,'贵港港',6322.02,2017),(48,'佛山港',7967.40,2017),(49,'徐州港',7419.58,2017),(50,'杭州港',10714.30,2017),(51,'哈尔滨港',121.76,2017),(52,'佳木斯港',197.90,2017);
/*!40000 ALTER TABLE `gkhwttl_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gkjzxttl_nh`
--

DROP TABLE IF EXISTS `gkjzxttl_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `gkjzxttl_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `jzxttl` decimal(65,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`jzxttl` <= 10) then 1 when (`jzxttl` >= 300) then 10 else (((9 / 199) * `jzxttl`) + (190 / 199)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gkjzxttl_nh`
--

LOCK TABLES `gkjzxttl_nh` WRITE;
/*!40000 ALTER TABLE `gkjzxttl_nh` DISABLE KEYS */;
INSERT INTO `gkjzxttl_nh` (`id`, `gk`, `jzxttl`, `year`) VALUES (1,'泸州港',32.06,2014),(2,'重庆港',101.48,2014),(3,'武汉港',100.53,2014),(4,'岳阳港',22.10,2014),(5,'九江港',22.41,2014),(6,'芜湖港',40.26,2014),(7,'湖州港',12.11,2014),(8,'贵港港',12.32,2014),(9,'佛山港',289.84,2014),(10,'徐州港',0.55,2014),(11,'杭州港',0.78,2014),(12,'哈尔滨港',0.00,2014),(13,'佳木斯港',0.00,2014),(14,'泸州港',42.04,2015),(15,'重庆港',101.17,2015),(16,'武汉港',106.21,2015),(17,'岳阳港',23.96,2015),(18,'九江港',25.49,2015),(19,'芜湖港',50.15,2015),(20,'湖州港',18.49,2015),(21,'贵港港',12.51,2015),(22,'佛山港',301.81,2015),(23,'徐州港',0.22,2015),(24,'杭州港',1.90,2015),(25,'哈尔滨港',0.00,2015),(26,'佳木斯港',0.00,2015),(27,'泸州港',50.10,2016),(28,'重庆港',115.24,2016),(29,'武汉港',113.29,2016),(30,'岳阳港',29.44,2016),(31,'九江港',27.39,2016),(32,'芜湖港',60.15,2016),(33,'湖州港',20.62,2016),(34,'贵港港',16.65,2016),(35,'佛山港',321.72,2016),(36,'徐州港',15.04,2016),(37,'杭州港',1.68,2016),(38,'哈尔滨港',0.00,2016),(39,'佳木斯港',0.00,2016),(40,'泸州港',55.02,2017),(41,'重庆港',128.85,2017),(42,'武汉港',135.74,2017),(43,'岳阳港',42.28,2017),(44,'九江港',33.47,2017),(45,'芜湖港',70.40,2017),(46,'湖州港',35.36,2017),(47,'贵港港',22.22,2017),(48,'佛山港',390.12,2017),(49,'徐州港',1.52,2017),(50,'杭州港',5.14,2017),(51,'哈尔滨港',0.00,2017),(52,'佳木斯港',0.00,2017);
/*!40000 ALTER TABLE `gkjzxttl_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gkmtkbnl`
--

DROP TABLE IF EXISTS `gkmtkbnl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `gkmtkbnl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `mt_bw` decimal(12,2) DEFAULT NULL,
  `yy_bw` decimal(12,2) DEFAULT NULL,
  `jsks_bw` decimal(12,2) DEFAULT NULL,
  `jzx_bw` decimal(12,2) DEFAULT NULL,
  `other_bw` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `gk_type` varchar(5) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT 'yh',
  `mt_bw_metric` int(11) GENERATED ALWAYS AS ((case when (`mt_bw` <= 0) then 0 when (`mt_bw` < 0.5) then 1 when (`mt_bw` < 1) then 2 when (`mt_bw` < 2) then 3 when (`mt_bw` < 3) then 4 when (`mt_bw` < 5) then 5 when (`mt_bw` < 7) then 6 when (`mt_bw` < 10) then 7 when (`mt_bw` < 12) then 8 when (`mt_bw` < 15) then 9 when (`mt_bw` >= 15) then 10 end)) VIRTUAL,
  `yy_bw_metric` int(11) GENERATED ALWAYS AS ((case when (`yy_bw` <= 0) then 0 when (`yy_bw` < 0.5) then 1 when (`yy_bw` < 1) then 2 when (`yy_bw` < 3.5) then 3 when (`yy_bw` < 5) then 4 when (`yy_bw` < 7) then 5 when (`yy_bw` < 10) then 6 when (`yy_bw` < 20) then 7 when (`yy_bw` < 30) then 8 when (`yy_bw` < 40) then 9 when (`yy_bw` >= 40) then 1 end)) VIRTUAL,
  `jsks_bw_metric` int(11) GENERATED ALWAYS AS ((case when (`jsks_bw` <= 0) then 0 when (`jsks_bw` < 0.5) then 1 when (`jsks_bw` < 1) then 2 when (`jsks_bw` < 3.5) then 3 when (`jsks_bw` < 5) then 4 when (`jsks_bw` < 10) then 5 when (`jsks_bw` < 20) then 6 when (`jsks_bw` < 25) then 7 when (`jsks_bw` < 30) then 8 when (`jsks_bw` < 40) then 9 when (`jsks_bw` >= 40) then 10 end)) VIRTUAL,
  `jzx_bw_metric` int(11) GENERATED ALWAYS AS ((case when (`jzx_bw` <= 0) then 0 when (`jzx_bw` < 0.5) then 1 when (`jzx_bw` < 1) then 2 when (`jzx_bw` < 2) then 3 when (`jzx_bw` < 3) then 4 when (`jzx_bw` < 5) then 5 when (`jzx_bw` < 7) then 6 when (`jzx_bw` < 10) then 7 when (`jzx_bw` < 12) then 8 when (`jzx_bw` < 15) then 9 when (`jzx_bw` >= 15) then 10 end)) VIRTUAL,
  `other_bw_metric` int(11) GENERATED ALWAYS AS ((case when (`other_bw` <= 0) then 0 when (`other_bw` < 0.5) then 1 when (`other_bw` < 1) then 2 when (`other_bw` < 3) then 3 when (`other_bw` < 5) then 4 when (`other_bw` < 7) then 5 when (`other_bw` < 10) then 6 when (`other_bw` < 15) then 7 when (`other_bw` < 20) then 8 when (`other_bw` < 25) then 9 when (`other_bw` >= 25) then 10 end)) VIRTUAL,
  `ratio_yytrq` decimal(20,2) DEFAULT NULL,
  `ratio_jsks` decimal(20,2) DEFAULT NULL,
  `ratio_mt` decimal(20,2) DEFAULT NULL,
  `ratio_jzx` decimal(20,2) DEFAULT NULL,
  `ratio_others` decimal(20,2) GENERATED ALWAYS AS (((((1 - `ratio_mt`) - `ratio_yytrq`) - `ratio_jsks`) - `ratio_jzx`)) VIRTUAL,
  `total_metric` decimal(20,2) GENERATED ALWAYS AS ((((((`mt_bw_metric` * `ratio_mt`) + (`yy_bw_metric` * `ratio_yytrq`)) + (`jsks_bw_metric` * `ratio_jsks`)) + (`jzx_bw_metric` * `ratio_jzx`)) + (`other_bw_metric` * `ratio_others`))) VIRTUAL,
  `max_bw` decimal(12,2) GENERATED ALWAYS AS (greatest(`mt_bw`,`yy_bw`,`jsks_bw`,`jzx_bw`,`other_bw`)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=203 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gkmtkbnl`
--

LOCK TABLES `gkmtkbnl` WRITE;
/*!40000 ALTER TABLE `gkmtkbnl` DISABLE KEYS */;
INSERT INTO `gkmtkbnl` (`id`, `gk`, `mt_bw`, `yy_bw`, `jsks_bw`, `jzx_bw`, `other_bw`, `year`, `gk_type`, `ratio_yytrq`, `ratio_jsks`, `ratio_mt`, `ratio_jzx`) VALUES (99,'大连港',3.00,30.00,30.00,10.00,15.00,2014,'yh',0.18,0.04,0.03,0.28),(100,'营口港',3.00,30.00,30.00,7.00,10.00,2014,'yh',0.12,0.11,0.06,0.38),(101,'秦皇岛港',15.00,5.00,10.00,2.50,5.00,2014,'yh',0.02,0.03,0.86,0.03),(102,'黄骅港',10.00,5.00,20.00,5.00,5.00,2014,'yh',0.02,0.16,0.79,0.03),(103,'唐山港',10.00,30.00,25.00,7.00,20.00,2014,'yh',0.03,0.47,0.28,0.06),(104,'天津港',15.00,30.00,30.00,12.00,25.00,2014,'yh',0.11,0.22,0.24,0.30),(105,'烟台港',20.00,3.00,20.00,7.00,20.00,2014,'yh',0.06,0.07,0.06,0.09),(106,'青岛港',5.00,30.00,40.00,15.00,10.00,2014,'yh',0.16,0.32,0.04,0.38),(107,'日照港',10.00,30.00,30.00,5.00,15.00,2014,'yh',0.17,0.37,0.09,0.20),(108,'连云港港',5.00,10.00,25.00,10.00,10.00,2014,'yh',0.01,0.52,0.10,0.25),(109,'上海港',12.00,15.00,25.00,15.00,15.00,2014,'yh',0.05,0.14,0.11,0.60),(110,'宁波-舟山港',15.00,45.00,30.00,10.00,20.00,2014,'yh',0.16,0.24,0.09,0.25),(111,'温州港',5.00,5.00,5.00,1.50,5.00,2014,'yh',0.05,0.02,0.27,0.10),(112,'福州港',7.00,7.00,7.00,5.00,7.00,2014,'yh',0.02,0.24,0.16,0.27),(113,'厦门港',10.00,10.00,10.00,10.00,10.00,2014,'yh',0.02,0.04,0.09,0.55),(114,'深圳港',7.50,7.50,7.50,17.00,7.50,2014,'yh',0.06,0.00,0.02,0.88),(115,'广州港',7.00,7.00,7.00,10.00,7.00,2014,'yh',0.04,0.02,0.14,0.55),(116,'珠海港',10.00,15.00,15.00,5.00,15.00,2014,'yh',0.09,0.08,0.35,0.24),(117,'汕头港',5.00,5.00,5.00,2.50,5.00,2014,'yh',0.03,0.00,0.23,0.26),(118,'湛江港',15.00,30.00,30.00,5.00,7.00,2014,'yh',0.11,0.19,0.08,0.04),(119,'北部湾港',7.00,10.00,20.00,5.00,20.00,2014,'yh',0.10,0.22,0.23,0.17),(120,'海口港',2.00,2.00,2.00,5.00,2.00,2014,'yh',0.02,0.01,0.04,0.27),(121,'南通港',10.00,3.50,5.00,3.50,10.00,2014,'yh',0.07,0.26,0.23,0.04),(122,'苏州港',10.00,7.00,20.00,5.00,7.00,2014,'yh',0.01,0.28,0.28,0.14),(123,'镇江港',7.00,7.00,7.00,5.00,7.00,2014,'yh',0.04,0.20,0.30,0.04),(124,'南京港',5.00,3.50,5.00,3.00,5.00,2014,'yh',0.17,0.18,0.28,0.13),(125,'大连港',3.00,45.00,40.00,15.00,15.00,2015,'yh',0.18,0.04,0.03,0.28),(126,'营口港',3.00,30.00,30.00,7.00,10.00,2015,'yh',0.12,0.11,0.06,0.38),(127,'秦皇岛港',15.00,5.00,10.00,2.50,5.00,2015,'yh',0.02,0.03,0.86,0.03),(128,'黄骅港',10.00,5.00,20.00,5.00,5.00,2015,'yh',0.02,0.16,0.79,0.03),(129,'唐山港',10.00,30.00,25.00,7.00,20.00,2015,'yh',0.03,0.47,0.28,0.06),(130,'天津港',15.00,30.00,30.00,12.00,25.00,2015,'yh',0.11,0.22,0.24,0.30),(131,'烟台港',20.00,3.00,30.00,7.00,20.00,2015,'yh',0.06,0.07,0.06,0.09),(132,'青岛港',5.00,30.00,40.00,15.00,10.00,2015,'yh',0.16,0.32,0.04,0.38),(133,'日照港',10.00,30.00,30.00,5.00,15.00,2015,'yh',0.17,0.37,0.09,0.20),(134,'连云港港',5.00,10.00,25.00,10.00,10.00,2015,'yh',0.01,0.52,0.10,0.25),(135,'上海港',12.00,15.00,25.00,15.00,15.00,2015,'yh',0.05,0.14,0.11,0.60),(136,'宁波-舟山港',15.00,45.00,30.00,10.00,20.00,2015,'yh',0.16,0.24,0.09,0.25),(137,'温州港',5.00,5.00,5.00,1.50,5.00,2015,'yh',0.05,0.02,0.27,0.10),(138,'福州港',20.00,7.00,20.00,10.00,20.00,2015,'yh',0.02,0.24,0.16,0.27),(139,'厦门港',10.00,10.00,10.00,10.00,10.00,2015,'yh',0.02,0.04,0.09,0.55),(140,'深圳港',7.50,7.50,7.50,17.00,7.50,2015,'yh',0.06,0.00,0.02,0.88),(141,'广州港',7.00,7.00,7.00,10.00,7.00,2015,'yh',0.04,0.02,0.14,0.55),(142,'珠海港',10.00,15.00,15.00,5.00,15.00,2015,'yh',0.09,0.08,0.35,0.24),(143,'汕头港',5.00,5.00,5.00,2.50,5.00,2015,'yh',0.03,0.00,0.23,0.26),(144,'湛江港',15.00,30.00,30.00,5.00,30.00,2015,'yh',0.11,0.19,0.08,0.04),(145,'北部湾港',7.00,10.00,20.00,5.00,20.00,2015,'yh',0.10,0.22,0.23,0.17),(146,'海口港',2.00,2.00,2.00,5.00,2.00,2015,'yh',0.02,0.01,0.04,0.27),(147,'南通港',10.00,3.50,5.00,3.50,10.00,2015,'yh',0.07,0.26,0.23,0.04),(148,'苏州港',10.00,7.00,20.00,5.00,7.00,2015,'yh',0.01,0.28,0.28,0.14),(149,'镇江港',7.00,7.00,7.00,5.00,7.00,2015,'yh',0.04,0.20,0.30,0.04),(150,'南京港',5.00,3.50,5.00,3.00,5.00,2015,'yh',0.17,0.18,0.28,0.13),(151,'大连港',3.00,45.00,40.00,15.00,15.00,2016,'yh',0.18,0.04,0.03,0.28),(152,'营口港',3.00,30.00,30.00,7.00,10.00,2016,'yh',0.12,0.11,0.06,0.38),(153,'秦皇岛港',15.00,5.00,10.00,2.50,5.00,2016,'yh',0.02,0.03,0.86,0.03),(154,'黄骅港',10.00,5.00,20.00,5.00,5.00,2016,'yh',0.02,0.16,0.79,0.03),(155,'唐山港',10.00,30.00,25.00,7.00,20.00,2016,'yh',0.03,0.47,0.28,0.06),(156,'天津港',15.00,30.00,30.00,12.00,25.00,2016,'yh',0.11,0.22,0.24,0.30),(157,'烟台港',20.00,30.00,30.00,7.00,20.00,2016,'yh',0.06,0.07,0.06,0.09),(158,'青岛港',5.00,45.00,40.00,15.00,10.00,2016,'yh',0.16,0.32,0.04,0.38),(159,'日照港',10.00,30.00,30.00,5.00,15.00,2016,'yh',0.17,0.37,0.09,0.20),(160,'连云港港',5.00,10.00,25.00,10.00,10.00,2016,'yh',0.01,0.52,0.10,0.25),(161,'上海港',12.00,15.00,25.00,15.00,15.00,2016,'yh',0.05,0.14,0.11,0.60),(162,'宁波-舟山港',15.00,45.00,30.00,10.00,20.00,2016,'yh',0.16,0.24,0.09,0.25),(163,'温州港',5.00,5.00,5.00,1.50,5.00,2016,'yh',0.05,0.02,0.27,0.10),(164,'福州港',20.00,7.00,20.00,10.00,20.00,2016,'yh',0.02,0.24,0.16,0.27),(165,'厦门港',10.00,10.00,10.00,10.00,10.00,2016,'yh',0.02,0.04,0.09,0.55),(166,'深圳港',7.50,7.50,7.50,17.00,7.50,2016,'yh',0.06,0.00,0.02,0.88),(167,'广州港',7.00,7.00,7.00,10.00,7.00,2016,'yh',0.04,0.02,0.14,0.55),(168,'珠海港',10.00,15.00,15.00,5.00,15.00,2016,'yh',0.09,0.08,0.35,0.24),(169,'汕头港',5.00,5.00,5.00,2.50,5.00,2016,'yh',0.03,0.00,0.23,0.26),(170,'湛江港',15.00,30.00,30.00,5.00,30.00,2016,'yh',0.11,0.19,0.08,0.04),(171,'北部湾港',7.00,10.00,20.00,5.00,20.00,2016,'yh',0.10,0.22,0.23,0.17),(172,'海口港',2.00,2.00,2.00,5.00,2.00,2016,'yh',0.02,0.01,0.04,0.27),(173,'南通港',10.00,3.50,5.00,3.50,10.00,2016,'yh',0.07,0.26,0.23,0.04),(174,'苏州港',10.00,7.00,20.00,5.00,7.00,2016,'yh',0.01,0.28,0.28,0.14),(175,'镇江港',7.00,7.00,7.00,5.00,7.00,2016,'yh',0.04,0.20,0.30,0.04),(176,'南京港',5.00,3.50,5.00,3.00,5.00,2016,'yh',0.17,0.18,0.28,0.13),(177,'大连港',3.00,45.00,40.00,15.00,15.00,2017,'yh',0.18,0.04,0.03,0.28),(178,'营口港',3.00,30.00,30.00,7.00,10.00,2017,'yh',0.12,0.11,0.06,0.38),(179,'秦皇岛港',15.00,5.00,10.00,2.50,5.00,2017,'yh',0.02,0.03,0.86,0.03),(180,'黄骅港',10.00,5.00,20.00,5.00,5.00,2017,'yh',0.02,0.16,0.79,0.03),(181,'唐山港',10.00,30.00,25.00,7.00,20.00,2017,'yh',0.03,0.47,0.28,0.06),(182,'天津港',15.00,30.00,30.00,12.00,25.00,2017,'yh',0.11,0.22,0.24,0.30),(183,'烟台港',20.00,30.00,30.00,7.00,20.00,2017,'yh',0.06,0.07,0.06,0.09),(184,'青岛港',5.00,45.00,40.00,15.00,10.00,2017,'yh',0.16,0.32,0.04,0.38),(185,'日照港',10.00,30.00,30.00,5.00,15.00,2017,'yh',0.17,0.37,0.09,0.20),(186,'连云港港',5.00,10.00,25.00,10.00,10.00,2017,'yh',0.01,0.52,0.10,0.25),(187,'上海港',12.00,15.00,25.00,15.00,15.00,2017,'yh',0.05,0.14,0.11,0.60),(188,'宁波-舟山港',15.00,45.00,30.00,10.00,20.00,2017,'yh',0.16,0.24,0.09,0.25),(189,'温州港',5.00,5.00,5.00,1.50,5.00,2017,'yh',0.05,0.02,0.27,0.10),(190,'福州港',20.00,7.00,20.00,10.00,20.00,2017,'yh',0.02,0.24,0.16,0.27),(191,'厦门港',10.00,10.00,10.00,10.00,10.00,2017,'yh',0.02,0.04,0.09,0.55),(192,'深圳港',7.50,7.50,7.50,17.00,7.50,2017,'yh',0.06,0.00,0.02,0.88),(193,'广州港',7.00,7.00,7.00,10.00,7.00,2017,'yh',0.04,0.02,0.14,0.55),(194,'珠海港',10.00,15.00,15.00,5.00,15.00,2017,'yh',0.09,0.08,0.35,0.24),(195,'汕头港',5.00,5.00,5.00,2.50,5.00,2017,'yh',0.03,0.00,0.23,0.26),(196,'湛江港',15.00,30.00,30.00,5.00,30.00,2017,'yh',0.11,0.19,0.08,0.04),(197,'北部湾港',7.00,10.00,20.00,5.00,20.00,2017,'yh',0.10,0.22,0.23,0.17),(198,'海口港',2.00,2.00,2.00,5.00,2.00,2017,'yh',0.02,0.01,0.04,0.27),(199,'南通港',10.00,3.50,5.00,3.50,10.00,2017,'yh',0.07,0.26,0.23,0.04),(200,'苏州港',10.00,7.00,20.00,5.00,7.00,2017,'yh',0.01,0.28,0.28,0.14),(201,'镇江港',7.00,7.00,7.00,5.00,7.00,2017,'yh',0.04,0.20,0.30,0.04),(202,'南京港',5.00,3.50,5.00,3.00,5.00,2017,'yh',0.17,0.18,0.28,0.13);
/*!40000 ALTER TABLE `gkmtkbnl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gkmtkbnl_nh`
--

DROP TABLE IF EXISTS `gkmtkbnl_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `gkmtkbnl_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `mtzdkbnl` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `metric` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `mtzdkbnl_index` (`mtzdkbnl`),
  KEY `year_index` (`year`),
  KEY `metric_index` (`metric`)
) ENGINE=InnoDB AUTO_INCREMENT=59 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gkmtkbnl_nh`
--

LOCK TABLES `gkmtkbnl_nh` WRITE;
/*!40000 ALTER TABLE `gkmtkbnl_nh` DISABLE KEYS */;
INSERT INTO `gkmtkbnl_nh` VALUES (1,'泸州港',1000,2014,8),(2,'重庆港',5000,2014,10),(3,'武汉港',7000,2014,10),(4,'岳阳港',5000,2014,10),(5,'九江港',5000,2014,10),(6,'芜湖港',20000,2014,10),(7,'湖州港',1000,2014,6),(8,'贵港港',3000,2014,9),(9,'佛山港',5000,2014,10),(10,'徐州港',2500,2014,9),(11,'杭州港',550,2014,8),(12,'哈尔滨港',1000,2014,8),(13,'佳木斯港',3000,2014,9),(14,'泸州港',1000,2015,8),(15,'重庆港',5000,2015,10),(16,'武汉港',7000,2015,10),(17,'岳阳港',5000,2015,10),(18,'九江港',5000,2015,10),(19,'芜湖港',20000,2015,10),(20,'湖州港',1000,2015,6),(21,'贵港港',3000,2015,9),(22,'佛山港',5000,2015,10),(23,'徐州港',2500,2015,9),(24,'杭州港',550,2015,8),(25,'哈尔滨港',1000,2015,8),(26,'佳木斯港',3000,2015,9),(27,'泸州港',1000,2016,8),(28,'重庆港',5000,2016,10),(29,'武汉港',7000,2016,10),(30,'岳阳港',5000,2016,10),(31,'九江港',5000,2016,10),(32,'芜湖港',20000,2016,10),(33,'湖州港',1000,2016,6),(34,'贵港港',3000,2016,9),(35,'佛山港',5000,2016,10),(36,'徐州港',2500,2016,9),(37,'杭州港',550,2016,8),(38,'哈尔滨港',1000,2016,8),(39,'佳木斯港',3000,2016,9),(40,'泸州港',1000,2017,8),(41,'重庆港',5000,2017,10),(42,'武汉港',7000,2017,10),(43,'岳阳港',5000,2017,10),(44,'九江港',5000,2017,10),(45,'芜湖港',20000,2017,10),(46,'湖州港',1000,2017,6),(47,'贵港港',3000,2017,9),(48,'佛山港',5000,2017,10),(49,'徐州港',2500,2017,9),(50,'杭州港',550,2017,8),(51,'哈尔滨港',1000,2017,8),(52,'佳木斯港',3000,2017,9);
/*!40000 ALTER TABLE `gkmtkbnl_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `hwttl_stat`
--

DROP TABLE IF EXISTS `hwttl_stat`;
/*!50001 DROP VIEW IF EXISTS `hwttl_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `hwttl_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `hysp`
--

DROP TABLE IF EXISTS `hysp`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `hysp` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `gkhwttl` decimal(65,2) DEFAULT NULL,
  `gkjzxttl` decimal(65,2) DEFAULT NULL,
  `mtkbnl` decimal(65,2) DEFAULT NULL,
  `gkaxlyxl` decimal(65,2) DEFAULT NULL,
  `mtnlsyx` decimal(65,2) DEFAULT NULL,
  `gkjjgx` decimal(65,2) DEFAULT NULL,
  `lsgkdj` decimal(65,2) DEFAULT NULL,
  `gkaqscsp` decimal(65,2) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hysp`
--

LOCK TABLES `hysp` WRITE;
/*!40000 ALTER TABLE `hysp` DISABLE KEYS */;
INSERT INTO `hysp` VALUES (1,'行业领先水平',10.00,10.00,10.00,10.00,10.00,10.00,10.00,10.00),(2,'行业平均水平',5.00,5.00,5.00,5.00,5.00,5.00,5.00,5.00),(3,'行业最低水平',1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00);
/*!40000 ALTER TABLE `hysp` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `jzxttl_stat`
--

DROP TABLE IF EXISTS `jzxttl_stat`;
/*!50001 DROP VIEW IF EXISTS `jzxttl_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `jzxttl_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `kbnl_ratio`
--

DROP TABLE IF EXISTS `kbnl_ratio`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `kbnl_ratio` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `ratio_mt` decimal(65,2) DEFAULT NULL,
  `ratio_yytrq` decimal(65,2) DEFAULT NULL,
  `ratio_jsks` decimal(65,2) DEFAULT NULL,
  `ratio_jzx` decimal(65,2) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `kbnl_ratio`
--

LOCK TABLES `kbnl_ratio` WRITE;
/*!40000 ALTER TABLE `kbnl_ratio` DISABLE KEYS */;
INSERT INTO `kbnl_ratio` VALUES (1,'大连港',0.03,0.18,0.04,0.28),(2,'营口港',0.06,0.12,0.11,0.38),(3,'秦皇岛港',0.86,0.02,0.03,0.03),(4,'黄骅港',0.79,0.02,0.16,0.03),(5,'唐山港',0.28,0.03,0.47,0.06),(6,'天津港',0.24,0.11,0.22,0.30),(7,'烟台港',0.06,0.06,0.07,0.09),(8,'青岛港',0.04,0.16,0.32,0.38),(9,'日照港',0.09,0.17,0.37,0.20),(10,'连云港港',0.10,0.01,0.52,0.25),(11,'上海港',0.11,0.05,0.14,0.60),(12,'宁波-舟山港',0.09,0.16,0.24,0.25),(13,'温州港',0.27,0.05,0.02,0.10),(14,'福州港',0.16,0.02,0.24,0.27),(15,'厦门港',0.09,0.02,0.04,0.55),(16,'深圳港',0.02,0.06,0.00,0.88),(17,'广州港',0.14,0.04,0.02,0.55),(18,'珠海港',0.35,0.09,0.08,0.24),(19,'汕头港',0.23,0.03,0.00,0.26),(20,'湛江港',0.08,0.11,0.19,0.04),(21,'北部湾港',0.23,0.10,0.22,0.17),(22,'海口港',0.04,0.02,0.01,0.27),(23,'南通港',0.23,0.07,0.26,0.04),(24,'苏州港',0.28,0.01,0.28,0.14),(25,'镇江港',0.30,0.04,0.20,0.04),(26,'南京港',0.28,0.17,0.18,0.13);
/*!40000 ALTER TABLE `kbnl_ratio` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `lsgkdj`
--

DROP TABLE IF EXISTS `lsgkdj`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `lsgkdj` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `year` int(11) NOT NULL,
  `lsgkdj` decimal(12,2) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lsgkdj`
--

LOCK TABLES `lsgkdj` WRITE;
/*!40000 ALTER TABLE `lsgkdj` DISABLE KEYS */;
INSERT INTO `lsgkdj` VALUES (1,'大连港',2014,8.60),(2,'营口港',2014,7.50),(3,'秦皇岛港',2014,6.90),(4,'黄骅港',2014,6.40),(5,'唐山港',2014,8.20),(6,'天津港',2014,8.80),(7,'烟台港',2014,6.80),(8,'青岛港',2014,8.60),(9,'日照港',2014,8.30),(10,'连云港港',2014,9.10),(11,'上海港',2014,9.10),(12,'宁波-舟山港',2014,8.20),(13,'温州港',2014,7.90),(14,'福州港',2014,8.10),(15,'厦门港',2014,8.00),(16,'深圳港',2014,9.10),(17,'广州港',2014,8.80),(18,'珠海港',2014,8.10),(19,'汕头港',2014,7.10),(20,'湛江港',2014,7.40),(21,'北部湾港',2014,7.00),(22,'海口港',2014,8.00),(23,'南通港',2014,7.40),(24,'苏州港',2014,8.70),(25,'镇江港',2014,7.00),(26,'南京港',2014,7.90),(27,'大连港',2015,8.60),(28,'营口港',2015,7.50),(29,'秦皇岛港',2015,6.90),(30,'黄骅港',2015,6.40),(31,'唐山港',2015,8.20),(32,'天津港',2015,8.80),(33,'烟台港',2015,6.80),(34,'青岛港',2015,8.60),(35,'日照港',2015,8.30),(36,'连云港港',2015,9.10),(37,'上海港',2015,9.10),(38,'宁波-舟山港',2015,8.20),(39,'温州港',2015,7.90),(40,'福州港',2015,8.10),(41,'厦门港',2015,8.00),(42,'深圳港',2015,9.10),(43,'广州港',2015,8.80),(44,'珠海港',2015,8.10),(45,'汕头港',2015,7.10),(46,'湛江港',2015,7.40),(47,'北部湾港',2015,7.00),(48,'海口港',2015,8.00),(49,'南通港',2015,7.40),(50,'苏州港',2015,8.70),(51,'镇江港',2015,7.00),(52,'南京港',2015,7.90),(53,'大连港',2016,9.10),(54,'营口港',2016,8.50),(55,'秦皇岛港',2016,7.80),(56,'黄骅港',2016,6.90),(57,'唐山港',2016,9.10),(58,'天津港',2016,9.20),(59,'烟台港',2016,7.30),(60,'青岛港',2016,9.30),(61,'日照港',2016,9.00),(62,'连云港港',2016,9.50),(63,'上海港',2016,9.20),(64,'宁波-舟山港',2016,8.50),(65,'温州港',2016,8.10),(66,'福州港',2016,9.00),(67,'厦门港',2016,8.30),(68,'深圳港',2016,9.50),(69,'广州港',2016,9.30),(70,'珠海港',2016,8.70),(71,'汕头港',2016,7.20),(72,'湛江港',2016,7.50),(73,'北部湾港',2016,7.60),(74,'海口港',2016,8.50),(75,'南通港',2016,7.70),(76,'苏州港',2016,9.50),(77,'镇江港',2016,7.10),(78,'南京港',2016,8.20),(79,'大连港',2017,9.10),(80,'营口港',2017,8.50),(81,'秦皇岛港',2017,7.80),(82,'黄骅港',2017,6.90),(83,'唐山港',2017,9.10),(84,'天津港',2017,9.20),(85,'烟台港',2017,7.30),(86,'青岛港',2017,9.30),(87,'日照港',2017,9.00),(88,'连云港港',2017,9.50),(89,'上海港',2017,9.20),(90,'宁波-舟山港',2017,8.50),(91,'温州港',2017,8.10),(92,'福州港',2017,9.00),(93,'厦门港',2017,8.30),(94,'深圳港',2017,9.50),(95,'广州港',2017,9.30),(96,'珠海港',2017,8.70),(97,'汕头港',2017,7.20),(98,'湛江港',2017,7.50),(99,'北部湾港',2017,7.60),(100,'海口港',2017,8.50),(101,'南通港',2017,7.70),(102,'苏州港',2017,9.50),(103,'镇江港',2017,7.10),(104,'南京港',2017,8.20);
/*!40000 ALTER TABLE `lsgkdj` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `lsgkdj_nh`
--

DROP TABLE IF EXISTS `lsgkdj_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `lsgkdj_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `lsgkdj` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lsgkdj_nh`
--

LOCK TABLES `lsgkdj_nh` WRITE;
/*!40000 ALTER TABLE `lsgkdj_nh` DISABLE KEYS */;
INSERT INTO `lsgkdj_nh` VALUES (1,'泸州港',6.80,2014),(2,'重庆港',7.20,2014),(3,'武汉港',7.10,2014),(4,'岳阳港',7.50,2014),(5,'九江港',6.90,2014),(6,'芜湖港',6.40,2014),(7,'湖州港',7.10,2014),(8,'贵港港',7.20,2014),(9,'佛山港',7.30,2014),(10,'徐州港',8.20,2014),(11,'杭州港',8.50,2014),(12,'哈尔滨港',6.50,2014),(13,'佳木斯港',6.20,2014),(14,'泸州港',7.10,2015),(15,'重庆港',7.50,2015),(16,'武汉港',7.80,2015),(17,'岳阳港',9.00,2015),(18,'九江港',7.20,2015),(19,'芜湖港',6.80,2015),(20,'湖州港',7.30,2015),(21,'贵港港',7.50,2015),(22,'佛山港',7.50,2015),(23,'徐州港',8.80,2015),(24,'杭州港',8.70,2015),(25,'哈尔滨港',6.90,2015),(26,'佳木斯港',6.80,2015),(27,'泸州港',7.30,2016),(28,'重庆港',7.80,2016),(29,'武汉港',7.90,2016),(30,'岳阳港',9.00,2016),(31,'九江港',7.40,2016),(32,'芜湖港',7.30,2016),(33,'湖州港',7.60,2016),(34,'贵港港',7.60,2016),(35,'佛山港',7.80,2016),(36,'徐州港',9.00,2016),(37,'杭州港',8.80,2016),(38,'哈尔滨港',7.30,2016),(39,'佳木斯港',7.10,2016),(40,'泸州港',7.90,2017),(41,'重庆港',8.10,2017),(42,'武汉港',8.00,2017),(43,'岳阳港',9.00,2017),(44,'九江港',7.80,2017),(45,'芜湖港',7.70,2017),(46,'湖州港',7.70,2017),(47,'贵港港',7.90,2017),(48,'佛山港',7.80,2017),(49,'徐州港',9.00,2017),(50,'杭州港',8.90,2017),(51,'哈尔滨港',7.50,2017),(52,'佳木斯港',7.40,2017);
/*!40000 ALTER TABLE `lsgkdj_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `lsgkdj_stat`
--

DROP TABLE IF EXISTS `lsgkdj_stat`;
/*!50001 DROP VIEW IF EXISTS `lsgkdj_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `lsgkdj_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Temporary view structure for view `mtkbnl_stat`
--

DROP TABLE IF EXISTS `mtkbnl_stat`;
/*!50001 DROP VIEW IF EXISTS `mtkbnl_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `mtkbnl_stat` AS SELECT 
 1 AS `year`,
 1 AS `mt_bw_max`,
 1 AS `yy_bw_max`,
 1 AS `jsks_bw_max`,
 1 AS `jzx_bw_max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `mtnlsyx`
--

DROP TABLE IF EXISTS `mtnlsyx`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `mtnlsyx` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `mttgnl` int(11) NOT NULL,
  `hwttl` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `mtnlsyd` decimal(12,2) GENERATED ALWAYS AS ((`mttgnl` / `hwttl`)) VIRTUAL,
  `metric` decimal(12,2) GENERATED ALWAYS AS ((case when ((`mtnlsyd` <= 0.3) or (`mtnlsyd` >= 1.8)) then 1 when ((`mtnlsyd` >= 0.9) and (`mtnlsyd` <= 1.0)) then 10 when ((`mtnlsyd` > 0.3) and (`mtnlsyd` < 0.9)) then ((15 * `mtnlsyd`) - 3.5) else ((-(11.25) * `mtnlsyd`) + 21.25) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `mttgnl_index` (`mttgnl`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=183 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mtnlsyx`
--

LOCK TABLES `mtnlsyx` WRITE;
/*!40000 ALTER TABLE `mtnlsyx` DISABLE KEYS */;
INSERT INTO `mtnlsyx` (`id`, `gk`, `mttgnl`, `hwttl`, `year`) VALUES (79,'大连港',36545,42337.00,2014),(80,'营口港',15500,33073.00,2014),(81,'秦皇岛港',24503,27403.00,2014),(82,'黄骅港',22105,17551.00,2014),(83,'唐山港',35860,50075.00,2014),(84,'天津港',44000,54002.00,2014),(85,'烟台港',12014,23767.00,2014),(86,'青岛港',32468,46802.00,2014),(87,'日照港',26039,33502.00,2014),(88,'连云港港',15558,19638.00,2014),(89,'上海港',65000,66954.00,2014),(90,'宁波-舟山港',60540,87346.00,2014),(91,'温州港',7250,7901.00,2014),(92,'福州港',15257,14391.00,2014),(93,'厦门港',17122,20504.00,2014),(94,'深圳港',23863,22324.00,2014),(95,'广州港',39867,48217.00,2014),(96,'珠海港',15600,10703.00,2014),(97,'汕头港',4206,5161.00,2014),(98,'湛江港',15468,20238.00,2014),(99,'北部湾港',24283,20189.00,2014),(100,'海口港',8423,8915.00,2014),(101,'南通港',14000,21599.00,2014),(102,'苏州港',40269,47792.00,2014),(103,'镇江港',15021,14061.00,2014),(104,'南京港',22200,21001.00,2014),(105,'大连港',36800,41482.00,2015),(106,'营口港',16900,33849.00,2015),(107,'秦皇岛港',24589,25309.00,2015),(108,'黄骅港',22105,16658.00,2015),(109,'唐山港',53969,49285.00,2015),(110,'天津港',45900,54051.00,2015),(111,'烟台港',12201,25163.00,2015),(112,'青岛港',34462,48453.00,2015),(113,'日照港',27519,33707.00,2015),(114,'连云港港',15558,19756.00,2015),(115,'上海港',65000,64906.00,2015),(116,'宁波-舟山港',85000,88929.00,2015),(117,'温州港',7250,8490.00,2015),(118,'福州港',15657,13967.00,2015),(119,'厦门港',17484,21023.00,2015),(120,'深圳港',23513,21706.00,2015),(121,'广州港',41300,50053.00,2015),(122,'珠海港',15300,11209.00,2015),(123,'汕头港',4206,5181.00,2015),(124,'湛江港',19772,22036.00,2015),(125,'北部湾港',26687,20482.00,2015),(126,'海口港',8423,9204.00,2015),(127,'南通港',16929,21827.00,2015),(128,'苏州港',40269,53990.00,2015),(129,'镇江港',16021,13010.00,2015),(130,'南京港',20600,21454.00,2015),(131,'大连港',41146,43660.01,2016),(132,'营口港',16900,35217.02,2016),(133,'秦皇岛港',24589,18681.57,2016),(134,'黄骅港',23800,24475.00,2016),(135,'唐山港',57101,52051.35,2016),(136,'天津港',46553,55055.75,2016),(137,'烟台港',12870,26536.87,2016),(138,'青岛港',35899,50036.32,2016),(139,'日照港',28514,35007.26,2016),(140,'连云港港',16588,20082.00,2016),(141,'上海港',67000,64481.62,2016),(142,'宁波-舟山港',90119,92209.24,2016),(143,'温州港',8644,8406.08,2016),(144,'福州港',16157,14515.66,2016),(145,'厦门港',18659,20910.78,2016),(146,'深圳港',24213,21409.88,2016),(147,'广州港',41300,52253.82,2016),(148,'珠海港',15500,11778.74,2016),(149,'汕头港',5073,4985.05,2016),(150,'湛江港',20191,25612.50,2016),(151,'北部湾港',28323,20391.60,2016),(152,'海口港',8423,9951.85,2016),(153,'南通港',16929,22613.84,2016),(154,'苏州港',40269,57936.59,2016),(155,'镇江港',17081,13136.92,2016),(156,'南京港',20100,21973.46,2016),(157,'大连港',41146,45105.00,2017),(158,'营口港',16900,36239.00,2017),(159,'秦皇岛港',24589,24480.00,2017),(160,'黄骅港',23800,26957.00,2017),(161,'唐山港',57101,56540.00,2017),(162,'天津港',46553,50284.00,2017),(163,'烟台港',12870,28560.00,2017),(164,'青岛港',35899,50799.00,2017),(165,'日照港',28514,36002.00,2017),(166,'连云港港',16588,20739.00,2017),(167,'上海港',67000,70563.00,2017),(168,'宁波-舟山港',90119,100711.00,2017),(169,'温州港',8644,8926.00,2017),(170,'福州港',16157,14599.00,2017),(171,'厦门港',18659,21046.00,2017),(172,'深圳港',24213,24097.00,2017),(173,'广州港',41300,56619.00,2017),(174,'珠海港',15500,13000.00,2017),(175,'汕头港',5073,4889.70,2017),(176,'湛江港',20191,14300.00,2017),(177,'北部湾港',28323,21728.00,2017),(178,'海口港',8423,10112.60,2017),(179,'南通港',16929,23569.00,2017),(180,'苏州港',40269,60774.00,2017),(181,'镇江港',17081,14429.00,2017),(182,'南京港',20100,23913.00,2017);
/*!40000 ALTER TABLE `mtnlsyx` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `mtnlsyx_nh`
--

DROP TABLE IF EXISTS `mtnlsyx_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `mtnlsyx_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `gkhwttl` decimal(12,2) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `mttgnl` decimal(12,2) NOT NULL,
  `gktgnlsyd` decimal(65,2) GENERATED ALWAYS AS ((`mttgnl` / `gkhwttl`)) STORED,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when ((`gktgnlsyd` <= 0.3) or (`gktgnlsyd` >= 1.8)) then 1 when ((`gktgnlsyd` >= 0.9) and (`gktgnlsyd` <= 1.0)) then 10 when ((`gktgnlsyd` > 0.3) and (`gktgnlsyd` < 0.9)) then ((15 * `gktgnlsyd`) - 3.5) else ((85 / 4) - ((45 / 4) * `gktgnlsyd`)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`),
  KEY `mttgnl_index` (`mttgnl`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mtnlsyx_nh`
--

LOCK TABLES `mtnlsyx_nh` WRITE;
/*!40000 ALTER TABLE `mtnlsyx_nh` DISABLE KEYS */;
INSERT INTO `mtnlsyx_nh` (`id`, `gk`, `gkhwttl`, `year`, `mttgnl`) VALUES (1,'泸州港',3134.00,2014,3157.00),(2,'重庆港',14665.00,2014,20915.00),(3,'武汉港',8150.00,2014,12039.00),(4,'岳阳港',12021.00,2014,13068.00),(5,'九江港',8036.00,2014,12497.00),(6,'芜湖港',10847.00,2014,11642.00),(7,'湖州港',8487.00,2014,6871.00),(8,'贵港港',5242.00,2014,4915.00),(9,'佛山港',5907.00,2014,10071.00),(10,'徐州港',9202.00,2014,8626.00),(11,'杭州港',10084.00,2014,8455.00),(12,'哈尔滨港',133.00,2014,347.00),(13,'佳木斯港',208.00,2014,667.00),(14,'泸州港',3247.00,2015,3157.00),(15,'重庆港',15750.00,2015,20915.00),(16,'武汉港',8455.00,2015,12039.00),(17,'岳阳港',13144.00,2015,13068.00),(18,'九江港',10425.00,2015,12497.00),(19,'芜湖港',12009.00,2015,11642.00),(20,'湖州港',8052.00,2015,6871.00),(21,'贵港港',5334.00,2015,4915.00),(22,'佛山港',6147.00,2015,10071.00),(23,'徐州港',9030.00,2015,8626.00),(24,'杭州港',9372.00,2015,8455.00),(25,'哈尔滨港',136.00,2015,347.00),(26,'佳木斯港',212.00,2015,667.00),(27,'泸州港',3458.57,2016,3157.00),(28,'重庆港',17372.14,2016,20915.00),(29,'武汉港',9000.05,2016,12039.00),(30,'岳阳港',14082.21,2016,13068.00),(31,'九江港',11327.97,2016,12497.00),(32,'芜湖港',13101.19,2016,11642.00),(33,'湖州港',8664.11,2016,6871.00),(34,'贵港港',5763.42,2016,4915.00),(35,'佛山港',6610.00,2016,10071.00),(36,'徐州港',9050.77,2016,8626.00),(37,'杭州港',7278.69,2016,8455.00),(38,'哈尔滨港',127.44,2016,347.00),(39,'佳木斯港',203.54,2016,667.00),(40,'泸州港',3492.98,2017,3157.00),(41,'重庆港',19722.29,2017,20915.00),(42,'武汉港',10017.97,2017,12039.00),(43,'岳阳港',11932.13,2017,13068.00),(44,'九江港',11717.19,2017,12497.00),(45,'芜湖港',12805.88,2017,11642.00),(46,'湖州港',10540.41,2017,6871.00),(47,'贵港港',6322.02,2017,4915.00),(48,'佛山港',7967.40,2017,10071.00),(49,'徐州港',7419.58,2017,8626.00),(50,'杭州港',10714.30,2017,8455.00),(51,'哈尔滨港',121.76,2017,347.00),(52,'佳木斯港',197.90,2017,667.00);
/*!40000 ALTER TABLE `mtnlsyx_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `mtnlsyx_stat`
--

DROP TABLE IF EXISTS `mtnlsyx_stat`;
/*!50001 DROP VIEW IF EXISTS `mtnlsyx_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `mtnlsyx_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `overall_metric`
--

DROP TABLE IF EXISTS `overall_metric`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `overall_metric` (
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `year` int(11) NOT NULL,
  `yhgkhwttl` decimal(65,2) DEFAULT NULL,
  `yhgkjzxttl` decimal(65,2) DEFAULT NULL,
  `dckbsl` decimal(65,2) DEFAULT NULL,
  `gkmtkbnl` decimal(20,2) DEFAULT NULL,
  `bmaxttl` decimal(65,2) DEFAULT NULL,
  `mtnlsyx` decimal(12,2) DEFAULT NULL,
  `cbzgpjts` decimal(12,2) DEFAULT NULL,
  `ddsr` decimal(65,2) DEFAULT NULL,
  `lsgkdj` decimal(12,2) DEFAULT NULL,
  `qwdttlswrs` int(11) DEFAULT NULL,
  `is_yhgkhwttl_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`yhgkhwttl` < 5) and ((least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkhwttl`))) then _utf8mb3'港口货物吞吐量 ' else NULL end)) VIRTUAL,
  `is_yhgkjzxttl_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`yhgkjzxttl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkjzxttl`))) then _utf8mb3'港口集装箱吞吐量 ' else NULL end)) VIRTUAL,
  `is_dckbsl_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`dckbsl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `dckbsl`))) then _utf8mb3'港口连通性 ' else NULL end)) VIRTUAL,
  `is_gkmtkbnl_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkmtkbnl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `gkmtkbnl`))) then _utf8mb3'码头靠泊能力 ' else NULL end)) VIRTUAL,
  `is_bmaxttl_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`bmaxttl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `bmaxttl`))) then _utf8mb3'港口岸线利用率 ' else NULL end)) VIRTUAL,
  `is_mtnlsyx_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`mtnlsyx` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb3'港口通过能力适应度 ' else NULL end)) VIRTUAL,
  `is_cbzgpjts_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`cbzgpjts` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `cbzgpjts`))) then _utf8mb3'船舶作业效率 ' else NULL end)) VIRTUAL,
  `is_ddsr_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`ddsr` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `ddsr`))) then _utf8mb3'港口经济贡献 ' else NULL end)) VIRTUAL,
  `is_lsgkdj_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`lsgkdj` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `lsgkdj`))) then _utf8mb3'绿色港口等级 ' else NULL end)) VIRTUAL,
  `is_qwdttlswrs_least_or_secondleast` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`qwdttlswrs` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `qwdttlswrs`))) then _utf8mb3'港口安全生产水平 ' else NULL end)) VIRTUAL,
  `least_group` varchar(120) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS (concat_ws(_utf8mb4'、',`is_yhgkhwttl_least_or_secondleast`,`is_yhgkjzxttl_least_or_secondleast`,`is_dckbsl_least_or_secondleast`,`is_gkmtkbnl_least_or_secondleast`,`is_bmaxttl_least_or_secondleast`,`is_mtnlsyx_least_or_secondleast`,`is_cbzgpjts_least_or_secondleast`,`is_ddsr_least_or_secondleast`,`is_lsgkdj_least_or_secondleast`,`is_qwdttlswrs_least_or_secondleast`)) VIRTUAL,
  `least_column` varchar(120) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) >= 5) then _utf8mb4'无明显弱项' else concat(_utf8mb4'弱项是',`least_group`) end)) VIRTUAL,
  `is_yhgkhwttl_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`yhgkhwttl` > 8) and ((greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkhwttl`))) then _utf8mb3'港口货物吞吐量 ' else NULL end)) VIRTUAL,
  `is_yhgkjzxttl_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`yhgkjzxttl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkjzxttl`))) then _utf8mb3'港口集装箱吞吐量 ' else NULL end)) VIRTUAL,
  `is_dckbsl_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`dckbsl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `dckbsl`))) then _utf8mb3'港口连通性 ' else NULL end)) VIRTUAL,
  `is_gkmtkbnl_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkmtkbnl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `gkmtkbnl`))) then _utf8mb3'码头靠泊能力 ' else NULL end)) VIRTUAL,
  `is_bmaxttl_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`bmaxttl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `bmaxttl`))) then _utf8mb3'港口岸线利用率 ' else NULL end)) VIRTUAL,
  `is_mtnlsyx_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`mtnlsyx` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb3'港口通过能力适应度 ' else NULL end)) VIRTUAL,
  `is_cbzgpjts_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`cbzgpjts` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `cbzgpjts`))) then _utf8mb3'港口作业效率 ' else NULL end)) VIRTUAL,
  `is_ddsr_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`ddsr` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `ddsr`))) then _utf8mb3'港口经济贡献 ' else NULL end)) VIRTUAL,
  `is_lsgkdj_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`lsgkdj` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `lsgkdj`))) then _utf8mb3'绿色港口等级 ' else NULL end)) VIRTUAL,
  `is_qwdttlswrs_greatest_or_secondgreatest` varchar(45) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`qwdttlswrs` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `qwdttlswrs`))) then _utf8mb3'港口安全生产水平 ' else NULL end)) VIRTUAL,
  `greatest_group` varchar(120) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS (concat_ws(_utf8mb4'、',`is_yhgkhwttl_greatest_or_secondgreatest`,`is_yhgkjzxttl_greatest_or_secondgreatest`,`is_dckbsl_greatest_or_secondgreatest`,`is_gkmtkbnl_greatest_or_secondgreatest`,`is_bmaxttl_greatest_or_secondgreatest`,`is_mtnlsyx_greatest_or_secondgreatest`,`is_cbzgpjts_greatest_or_secondgreatest`,`is_ddsr_greatest_or_secondgreatest`,`is_lsgkdj_greatest_or_secondgreatest`,`is_qwdttlswrs_greatest_or_secondgreatest`)) VIRTUAL,
  `greatest_column` varchar(120) COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) <= 8) then _utf8mb4'无明显强项' else concat(_utf8mb4'强项是',`greatest_group`) end)) VIRTUAL,
  `metric` decimal(65,2) GENERATED ALWAYS AS (round((((((((`yhgkhwttl` * 0.2) + (`yhgkjzxttl` * 0.5)) + (`dckbsl` * 0.2)) + (`gkmtkbnl` * 0.1)) * 0.4) + ((((`bmaxttl` * 0.5) + (`mtnlsyx` * 0.4)) + (`cbzgpjts` * 0.1)) * 0.3)) + ((((`ddsr` * 0.6) + (`lsgkdj` * 0.2)) + (`qwdttlswrs` * 0.2)) * 0.3)),2)) VIRTUAL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=104 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `overall_metric`
--

LOCK TABLES `overall_metric` WRITE;
/*!40000 ALTER TABLE `overall_metric` DISABLE KEYS */;
INSERT INTO `overall_metric` (`gk`, `year`, `yhgkhwttl`, `yhgkjzxttl`, `dckbsl`, `gkmtkbnl`, `bmaxttl`, `mtnlsyx`, `cbzgpjts`, `ddsr`, `lsgkdj`, `qwdttlswrs`, `id`) VALUES ('大连港',2014,5.85,3.83,1.82,8.13,6.58,9.40,8.50,2.44,8.60,10,1),('营口港',2014,4.46,2.43,1.56,7.34,9.00,3.55,6.25,2.43,7.50,10,2),('秦皇岛港',2014,3.61,1.00,1.04,9.30,9.87,9.85,5.50,6.43,6.90,10,3),('黄骅港',2014,2.13,1.00,1.03,7.72,9.80,7.08,6.25,7.09,6.40,10,4),('唐山港',2014,7.01,1.03,2.68,8.13,9.82,7.30,7.00,7.74,8.20,10,5),('天津港',2014,7.60,5.05,8.77,9.37,8.41,8.65,7.00,9.09,8.80,10,6),('烟台港',2014,3.07,1.42,1.15,8.38,5.84,4.15,4.75,5.18,6.80,10,7),('青岛港',2014,6.52,5.84,7.87,9.38,9.24,6.85,8.50,6.40,8.60,10,8),('日照港',2014,4.53,1.44,2.27,8.14,9.88,8.20,7.00,5.20,8.30,10,9),('连云港港',2014,2.45,2.24,2.43,7.67,7.75,8.35,7.75,3.30,9.10,10,10),('上海港',2014,9.54,10.00,7.05,9.26,6.17,10.00,7.00,9.03,9.10,10,11),('宁波-舟山港',2014,10.00,6.73,10.00,7.56,7.23,6.85,9.25,8.33,8.20,10,12),('温州港',2014,1.00,1.00,1.00,5.07,4.42,10.00,7.00,4.61,7.90,10,13),('福州港',2014,1.66,1.38,1.21,5.92,3.63,9.33,4.00,1.00,8.10,10,14),('厦门港',2014,2.58,3.35,4.72,7.60,4.43,9.10,1.75,5.93,8.00,10,15),('深圳港',2014,2.85,8.15,10.00,9.54,5.05,9.21,1.00,8.99,9.10,10,16),('广州港',2014,6.73,5.78,2.75,7.22,6.00,8.95,3.25,5.22,8.80,10,17),('珠海港',2014,1.11,1.06,1.00,7.27,3.45,4.83,1.00,2.37,8.10,10,18),('汕头港',2014,1.00,1.09,1.15,4.97,3.70,8.65,4.75,4.97,7.10,10,19),('湛江港',2014,2.54,1.00,2.24,7.22,8.76,7.90,4.00,7.32,7.40,10,20),('海口港',2014,1.00,1.11,1.00,3.85,8.00,10.00,1.00,2.10,8.00,10,21),('南通港',2014,2.74,1.00,2.77,6.42,7.93,6.25,4.75,4.06,7.40,10,22),('苏州港',2014,6.67,2.07,2.28,6.84,6.87,9.10,4.75,3.03,8.70,10,23),('镇江港',2014,1.61,1.00,1.00,6.10,4.88,9.21,4.75,3.43,7.00,10,24),('南京港',2014,2.65,1.55,1.01,5.11,3.36,9.33,4.75,4.52,7.90,10,25),('大连港',2015,5.72,3.62,1.82,7.29,6.55,9.85,8.50,2.79,8.60,10,26),('营口港',2015,4.58,2.53,1.56,7.34,9.00,4.00,7.75,2.75,7.50,10,27),('秦皇岛港',2015,3.30,1.00,1.04,9.30,9.88,10.00,7.00,6.28,6.90,10,28),('黄骅港',2015,2.00,1.00,1.03,7.72,9.66,6.29,7.00,7.03,6.40,10,29),('唐山港',2015,6.89,1.16,2.68,8.13,9.81,8.88,6.25,7.96,8.20,10,30),('天津港',2015,7.61,5.07,8.77,9.37,7.71,9.25,6.25,10.00,8.80,10,31),('烟台港',2015,3.27,1.45,1.15,8.52,5.83,3.70,4.75,5.18,6.80,10,32),('青岛港',2015,6.77,6.10,7.87,9.38,9.00,7.15,8.50,6.45,8.60,10,33),('日照港',2015,4.56,1.56,2.27,8.14,10.00,8.80,8.50,4.69,8.30,10,34),('连云港港',2015,2.46,2.24,2.43,7.67,7.75,8.35,8.50,3.17,9.10,10,35),('上海港',2015,9.24,10.00,7.05,9.26,5.87,10.00,7.75,9.46,9.10,10,36),('宁波-舟山港',2015,10.00,7.09,10.00,7.56,7.23,10.00,9.25,10.00,8.20,10,37),('温州港',2015,1.00,1.00,1.00,5.07,2.55,9.25,7.00,4.23,7.90,10,38),('福州港',2015,1.60,1.44,1.21,8.35,2.99,8.65,3.25,1.00,8.10,10,39),('厦门港',2015,2.65,3.54,4.72,7.60,4.48,8.95,1.00,5.97,8.00,10,40),('深圳港',2015,2.76,8.20,10.00,9.54,5.15,9.10,1.00,8.79,9.10,10,41),('广州港',2015,7.01,6.09,2.75,7.22,6.06,8.95,1.75,4.94,8.80,10,42),('珠海港',2015,1.18,1.11,1.00,7.27,3.50,5.95,1.00,2.39,8.10,10,43),('汕头港',2015,1.00,1.06,1.15,4.97,3.54,8.65,5.50,1.00,7.10,10,44),('湛江港',2015,2.81,1.00,2.24,9.54,8.77,10.00,4.00,6.31,7.40,10,45),('北部湾港',2015,2.57,1.13,1.71,7.39,3.75,6.63,4.00,8.10,7.00,10,46),('海口港',2015,1.00,1.08,1.00,3.85,7.26,10.00,3.25,2.33,8.00,10,47),('南通港',2015,2.77,1.00,2.77,6.42,7.93,8.20,4.75,4.05,7.40,10,48),('苏州港',2015,7.60,2.27,2.28,6.84,6.86,7.75,4.75,2.67,8.70,10,49),('镇江港',2015,1.45,1.00,1.00,6.10,2.96,7.41,4.75,3.40,7.00,10,50),('南京港',2015,2.72,1.60,1.01,5.11,3.37,10.00,4.75,4.57,7.90,10,51),('大连港',2016,6.05,3.66,1.82,7.29,6.54,10.00,9.25,2.79,9.10,10,52),('营口港',2016,4.78,2.58,1.56,7.34,9.00,3.70,8.50,2.75,8.50,10,53),('秦皇岛港',2016,2.30,1.00,1.04,9.30,7.90,6.40,4.75,6.28,7.80,10,54),('黄骅港',2016,3.17,1.00,1.03,7.72,9.74,10.00,4.75,7.03,6.90,10,55),('唐山港',2016,7.31,1.29,2.68,8.13,9.83,8.88,7.00,7.96,9.10,10,56),('天津港',2016,7.76,5.20,8.77,9.37,7.71,9.25,6.25,10.00,9.20,10,57),('烟台港',2016,3.48,1.50,1.15,8.88,5.83,3.70,6.25,5.18,7.30,10,58),('青岛港',2016,7.01,6.29,7.87,8.10,9.00,7.30,8.50,6.45,9.30,10,59),('日照港',2016,4.75,1.62,2.27,8.14,10.00,8.65,8.50,4.69,9.00,10,60),('连云港港',2016,2.51,2.15,2.43,7.67,7.76,8.95,9.25,3.17,9.50,10,61),('上海港',2016,9.17,10.00,7.05,9.26,6.56,9.55,7.00,9.46,9.20,10,62),('宁波-舟山港',2016,10.00,7.38,10.00,7.56,7.24,10.00,9.25,8.14,8.50,10,63),('温州港',2016,1.00,1.00,1.00,5.07,2.58,9.66,6.25,4.23,8.10,10,64),('福州港',2016,1.68,1.52,1.21,8.35,3.04,8.76,1.00,1.00,9.00,10,65),('厦门港',2016,2.64,3.67,4.72,7.60,4.10,9.85,1.00,5.97,8.30,10,66),('深圳港',2016,2.71,8.13,10.00,9.54,5.14,8.54,1.00,8.79,9.50,10,67),('广州港',2016,7.34,6.48,2.75,7.22,6.11,8.35,3.25,4.94,9.30,10,68),('珠海港',2016,1.27,1.20,1.00,7.27,3.93,6.40,1.00,2.39,8.70,10,69),('汕头港',2016,1.00,1.07,1.15,4.97,2.97,9.78,5.50,1.00,7.20,10,70),('湛江港',2016,3.34,1.00,2.24,9.54,9.76,8.35,7.75,6.31,7.50,10,71),('北部湾港',2016,2.56,1.25,1.71,7.39,3.31,5.61,5.50,8.10,7.60,10,72),('海口港',2016,1.00,1.12,1.00,3.85,7.27,9.25,4.00,2.33,8.50,10,73),('南通港',2016,2.89,1.00,2.77,6.42,7.92,7.75,4.75,4.05,7.70,10,74),('苏州港',2016,8.19,2.39,2.28,6.84,6.87,7.00,4.75,2.67,9.50,10,75),('镇江港',2016,1.47,1.00,1.00,6.10,2.96,6.63,4.75,3.40,7.10,10,76),('南京港',2016,2.80,1.65,1.01,5.11,3.36,10.00,4.75,4.57,8.20,10,77),('大连港',2017,6.27,3.70,1.82,7.29,6.53,10.00,9.25,2.79,9.10,10,78),('营口港',2017,4.94,2.64,1.56,7.34,9.38,3.55,8.50,2.75,8.50,10,79),('秦皇岛港',2017,3.17,1.00,1.04,9.30,9.89,10.00,4.75,6.28,7.80,10,80),('黄骅港',2017,3.54,1.00,1.03,7.72,9.74,9.70,4.75,7.03,6.90,10,81),('唐山港',2017,7.98,1.47,2.68,8.13,9.87,9.89,7.00,7.96,9.10,10,82),('天津港',2017,7.04,5.36,8.77,9.37,7.68,10.00,6.25,10.00,9.20,10,83),('烟台港',2017,3.78,1.53,1.15,8.88,6.84,3.25,6.25,5.18,7.30,10,84),('青岛港',2017,7.12,6.37,7.87,8.10,9.00,7.15,8.50,6.45,9.30,10,85),('日照港',2017,4.90,1.70,2.27,8.14,10.00,8.35,8.50,4.69,9.00,10,86),('连云港港',2017,2.61,2.15,2.43,7.67,7.77,8.50,9.25,3.17,9.50,10,87),('上海港',2017,10.00,10.00,7.05,9.26,6.51,10.00,7.00,9.46,9.20,10,88),('宁波-舟山港',2017,10.00,8.34,10.00,7.56,7.50,9.85,9.25,8.39,8.50,10,89),('温州港',2017,1.00,1.00,1.00,5.07,2.59,10.00,6.25,4.23,8.10,10,90),('福州港',2017,1.69,1.62,1.21,8.35,3.16,8.76,1.00,1.00,9.00,10,91),('厦门港',2017,2.66,3.92,4.72,7.60,4.26,9.85,1.00,5.97,8.30,10,92),('深圳港',2017,3.11,8.53,10.00,9.54,4.87,10.00,1.00,8.79,9.50,10,93),('广州港',2017,7.99,6.93,2.75,7.22,6.10,7.45,3.25,4.94,9.30,10,94),('珠海港',2017,1.45,1.40,1.00,7.27,4.47,7.86,1.00,2.39,8.70,10,95),('汕头港',2017,1.00,1.09,1.15,4.97,3.10,9.55,5.50,1.00,7.20,10,96),('湛江港',2017,1.65,1.00,2.24,9.54,5.91,5.39,7.75,6.31,7.50,10,97),('北部湾港',2017,2.76,1.40,1.71,7.39,3.56,6.63,5.50,8.10,7.60,10,98),('海口港',2017,1.02,1.20,1.00,3.85,7.62,8.95,4.00,2.33,8.50,10,99),('南通港',2017,3.04,1.00,2.77,6.42,8.91,7.30,4.75,4.05,7.70,10,100),('苏州港',2017,8.62,2.55,2.28,6.84,7.86,6.40,4.75,2.67,9.50,10,101),('镇江港',2017,1.66,1.00,1.00,6.10,3.92,7.98,4.75,3.40,7.10,10,102),('南京港',2017,3.09,1.67,1.01,5.11,3.34,9.10,4.75,4.57,8.20,10,103);
/*!40000 ALTER TABLE `overall_metric` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `overall_metric_for_order`
--

DROP TABLE IF EXISTS `overall_metric_for_order`;
/*!50001 DROP VIEW IF EXISTS `overall_metric_for_order`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `overall_metric_for_order` AS SELECT 
 1 AS `gk`,
 1 AS `year`,
 1 AS `gm`,
 1 AS `xl`,
 1 AS `xy`,
 1 AS `metric`,
 1 AS `rank`*/;
SET character_set_client = @saved_cs_client;

--
-- Temporary view structure for view `overall_metric_for_order_nh`
--

DROP TABLE IF EXISTS `overall_metric_for_order_nh`;
/*!50001 DROP VIEW IF EXISTS `overall_metric_for_order_nh`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `overall_metric_for_order_nh` AS SELECT 
 1 AS `gk`,
 1 AS `year`,
 1 AS `metric`,
 1 AS `rank`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `overall_metric_nh`
--

DROP TABLE IF EXISTS `overall_metric_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `overall_metric_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `year` int(11) NOT NULL,
  `gkhwttl` decimal(65,2) DEFAULT NULL,
  `gkjzxttl` decimal(65,2) DEFAULT NULL,
  `mtkbnl` decimal(65,2) DEFAULT NULL,
  `gkaxlyxl` decimal(65,2) DEFAULT NULL,
  `mtnlsyx` decimal(65,2) DEFAULT NULL,
  `gkjjgx` decimal(65,2) DEFAULT NULL,
  `lsgkdj` decimal(65,2) DEFAULT NULL,
  `gkaqscsp` decimal(65,2) DEFAULT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS (((((((`gkhwttl` * 0.4) + (`gkjzxttl` * 0.4)) + (`mtkbnl` * 0.2)) * 0.4) + (((`gkaxlyxl` * 0.3) + (`mtnlsyx` * 0.7)) * 0.3)) + ((((`gkjjgx` * 0.4) + (`lsgkdj` * 0.3)) + (`gkaqscsp` * 0.3)) * 0.3))) VIRTUAL,
  `is_gkhwttl_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkhwttl` < 5) and ((least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`))) then _utf8mb4'货物吞吐量 ' else NULL end)) VIRTUAL,
  `is_gkjzxttl_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkjzxttl` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`))) then _utf8mb4'集装箱吞吐量 ' else NULL end)) VIRTUAL,
  `is_mtkbnl_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`mtkbnl` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`))) then _utf8mb4'码头靠泊能力 ' else NULL end)) VIRTUAL,
  `is_gkaxlyxl_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkaxlyxl` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`))) then _utf8mb4'港口岸线利用率 ' else NULL end)) VIRTUAL,
  `is_mtnlsyx_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`mtnlsyx` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb4'港口通过能力适应度 ' else NULL end)) VIRTUAL,
  `is_gkjjgx_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkjjgx` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`))) then _utf8mb4'港口经济贡献 ' else NULL end)) VIRTUAL,
  `is_gkaqscsp_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkaqscsp` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`))) then _utf8mb4'港口安全生产水平 ' else NULL end)) VIRTUAL,
  `is_lsgkdj_least_or_secondleast` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`lsgkdj` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`))) then _utf8mb4'绿色港口等级 ' else NULL end)) VIRTUAL,
  `least_group` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS (concat_ws(_utf8mb4'、',`is_gkhwttl_least_or_secondleast`,`is_gkjzxttl_least_or_secondleast`,`is_mtkbnl_least_or_secondleast`,`is_gkaxlyxl_least_or_secondleast`,`is_mtnlsyx_least_or_secondleast`,`is_gkjjgx_least_or_secondleast`,`is_gkaqscsp_least_or_secondleast`,`is_lsgkdj_least_or_secondleast`)) VIRTUAL,
  `least_column` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) >= 5) then _utf8mb4'无明显弱项' else concat(_utf8mb4'弱项是',`least_group`) end)) VIRTUAL,
  `is_gkhwttl_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkhwttl` > 8) and ((greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`))) then _utf8mb4'货物吞吐量 ' else NULL end)) VIRTUAL,
  `is_gkjzxttl_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkjzxttl` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`))) then _utf8mb4'集装箱吞吐量 ' else NULL end)) VIRTUAL,
  `is_mtkbnl_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`mtkbnl` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`))) then _utf8mb4'码头靠泊能力 ' else NULL end)) VIRTUAL,
  `is_gkaxlyxl_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkaxlyxl` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`))) then _utf8mb4'港口岸线利用率 ' else NULL end)) VIRTUAL,
  `is_mtnlsyx_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`mtnlsyx` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb4'港口通过能力适应度 ' else NULL end)) VIRTUAL,
  `is_gkjjgx_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkjjgx` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`))) then _utf8mb4'港口经济贡献 ' else NULL end)) VIRTUAL,
  `is_gkaqscsp_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`gkaqscsp` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`))) then _utf8mb4'港口安全生产水平 ' else NULL end)) VIRTUAL,
  `is_lsgkdj_greatest_or_secondgreatest` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when ((`lsgkdj` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`))) then _utf8mb4'绿色港口等级 ' else NULL end)) VIRTUAL,
  `greatest_group` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS (concat_ws(_utf8mb4'、',`is_gkhwttl_greatest_or_secondgreatest`,`is_gkjzxttl_greatest_or_secondgreatest`,`is_mtkbnl_greatest_or_secondgreatest`,`is_gkaxlyxl_greatest_or_secondgreatest`,`is_mtnlsyx_greatest_or_secondgreatest`,`is_gkjjgx_greatest_or_secondgreatest`,`is_gkaqscsp_greatest_or_secondgreatest`,`is_lsgkdj_greatest_or_secondgreatest`)) VIRTUAL,
  `greatest_column` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci GENERATED ALWAYS AS ((case when (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) <= 8) then _utf8mb4'无明显强项' else concat(_utf8mb4'强项是',`greatest_group`) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`),
  KEY `mtkbnl_index` (`mtkbnl`),
  KEY `gkaqscsp_index` (`gkaqscsp`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `overall_metric_nh`
--

LOCK TABLES `overall_metric_nh` WRITE;
/*!40000 ALTER TABLE `overall_metric_nh` DISABLE KEYS */;
INSERT INTO `overall_metric_nh` (`id`, `gk`, `year`, `gkhwttl`, `gkjzxttl`, `mtkbnl`, `gkaxlyxl`, `mtnlsyx`, `gkjjgx`, `lsgkdj`, `gkaqscsp`) VALUES (1,'泸州港',2017,2.60,3.44,8.00,8.32,10.00,2.59,7.90,9.00),(2,'重庆港',2017,10.00,6.78,10.00,7.01,9.32,8.68,8.10,9.00),(3,'武汉港',2017,6.80,7.09,10.00,5.10,7.73,7.48,8.00,9.00),(4,'岳阳港',2017,8.03,2.87,10.00,7.60,10.00,3.98,9.00,8.00),(5,'九江港',2017,7.89,2.47,10.00,9.12,9.25,5.12,7.80,9.00),(6,'芜湖港',2017,8.59,4.14,10.00,10.00,10.00,5.66,7.70,9.00),(7,'湖州港',2017,7.13,2.55,6.00,10.00,6.28,3.35,7.70,9.00),(8,'贵港港',2017,4.42,1.96,9.00,10.00,8.16,2.37,7.90,9.00),(9,'佛山港',2017,5.48,10.00,10.00,9.60,7.03,10.00,7.80,9.00),(10,'徐州港',2017,5.13,1.02,9.00,8.15,8.17,3.51,9.00,9.00),(11,'杭州港',2017,7.24,1.19,8.00,10.45,8.34,2.22,8.90,9.00),(12,'哈尔滨港',2017,0.44,0.00,8.00,0.87,1.00,0.43,7.50,9.00),(13,'佳木斯港',2017,0.48,0.00,9.00,1.07,1.00,0.39,7.40,9.00),(14,'泸州港',2016,2.58,3.22,8.00,8.23,10.00,2.46,7.30,9.00),(15,'重庆港',2016,10.00,6.17,10.00,6.17,7.71,7.73,7.80,9.00),(16,'武汉港',2016,6.14,6.08,10.00,4.58,6.20,6.55,7.90,8.00),(17,'岳阳港',2016,9.41,2.29,10.00,8.97,10.00,4.14,9.00,8.00),(18,'九江港',2016,7.64,2.19,10.00,8.82,8.84,4.84,7.40,9.00),(19,'芜湖港',2016,8.78,3.68,10.00,10.00,9.83,5.50,7.30,9.00),(20,'湖州港',2016,5.93,1.89,6.00,8.54,8.40,2.62,7.60,9.00),(21,'贵港港',2016,4.06,1.71,9.00,10.00,9.29,2.11,7.60,9.00),(22,'佛山港',2016,4.61,10.00,10.00,7.96,4.11,9.56,7.80,8.00),(23,'徐州港',2016,6.18,1.63,9.00,9.95,10.00,4.16,9.00,9.00),(24,'杭州港',2016,5.04,1.03,8.00,7.10,8.18,1.58,8.80,9.00),(25,'哈尔滨港',2016,0.44,0.00,8.00,0.91,1.00,0.43,7.30,9.00),(26,'佳木斯港',2016,0.49,0.00,9.00,1.10,1.00,0.39,7.10,9.00),(27,'泸州港',2015,2.44,2.86,8.00,7.73,10.00,2.14,7.10,9.00),(28,'重庆港',2015,10.00,5.53,10.00,5.60,6.31,7.42,7.50,9.00),(29,'武汉港',2015,5.79,5.76,10.00,4.30,5.23,6.14,7.80,9.00),(30,'岳阳港',2015,8.81,2.04,10.00,8.37,10.00,3.69,9.00,9.00),(31,'九江港',2015,7.06,2.11,10.00,8.11,7.76,4.84,7.20,9.00),(32,'芜湖港',2015,8.08,3.22,10.00,10.00,10.00,5.77,6.80,9.00),(33,'湖州港',2015,5.53,1.79,6.00,7.93,9.30,2.22,7.30,9.00),(34,'贵港港',2015,3.79,1.52,9.00,9.28,10.00,1.88,7.50,9.00),(35,'佛山港',2015,4.31,10.00,10.00,7.41,2.82,9.13,7.50,9.00),(36,'徐州港',2015,6.16,0.96,9.00,9.92,10.00,3.91,8.80,9.00),(37,'杭州港',2015,6.38,1.04,8.00,9.14,10.00,2.08,8.70,9.00),(38,'哈尔滨港',2015,0.44,0.00,8.00,0.97,1.00,0.44,6.90,9.00),(39,'佳木斯港',2015,0.49,0.00,9.00,1.15,1.00,0.39,6.80,9.00),(40,'泸州港',2014,2.37,2.40,8.00,7.46,10.00,1.81,6.80,9.00),(41,'重庆港',2014,9.78,5.54,10.00,5.21,5.21,7.03,7.20,9.00),(42,'武汉港',2014,5.60,5.50,10.00,4.15,4.63,6.30,7.10,9.00),(43,'岳阳港',2014,8.08,1.95,10.00,7.66,9.02,3.85,7.50,8.00),(44,'九江港',2014,5.52,1.97,10.00,6.25,3.75,4.38,6.90,9.00),(45,'芜湖港',2014,7.33,2.78,10.00,10.00,9.18,4.98,6.40,9.00),(46,'湖州港',2014,5.81,1.50,6.00,8.36,8.64,2.07,7.10,9.00),(47,'贵港港',2014,3.73,1.51,9.00,9.12,10.00,1.75,7.20,9.00),(48,'佛山港',2014,4.15,10.00,10.00,7.12,2.07,8.89,7.30,9.00),(49,'徐州港',2014,6.27,0.98,9.00,10.00,10.00,3.62,8.20,9.00),(50,'杭州港',2014,6.84,0.99,8.00,9.84,9.08,2.32,8.50,9.00),(51,'哈尔滨港',2014,0.44,0.00,8.00,0.95,1.00,0.44,6.50,9.00),(52,'佳木斯港',2014,0.49,0.00,9.00,1.12,1.00,0.39,6.20,9.00);
/*!40000 ALTER TABLE `overall_metric_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `qwdttlswrs`
--

DROP TABLE IF EXISTS `qwdttlswrs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `qwdttlswrs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `qwdttlswrs` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `metric` int(11) GENERATED ALWAYS AS ((case when (`qwdttlswrs` <= 0) then 10 when (`qwdttlswrs` <= 1) then 9 when (`qwdttlswrs` <= 2) then 8 when (`qwdttlswrs` <= 3) then 7 when (`qwdttlswrs` <= 4) then 6 when (`qwdttlswrs` <= 5) then 5 when (`qwdttlswrs` <= 6) then 4 when (`qwdttlswrs` <= 7) then 3 when (`qwdttlswrs` <= 8) then 2 when (`qwdttlswrs` <= 9) then 9 else 1 end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `qwdttlswrs_index` (`qwdttlswrs`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=139 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `qwdttlswrs`
--

LOCK TABLES `qwdttlswrs` WRITE;
/*!40000 ALTER TABLE `qwdttlswrs` DISABLE KEYS */;
INSERT INTO `qwdttlswrs` (`id`, `gk`, `qwdttlswrs`, `year`) VALUES (1,'大连港',0,2016),(2,'营口港',0,2016),(3,'秦皇岛港',0,2016),(4,'黄骅港',0,2016),(5,'唐山港',0,2016),(6,'天津港',0,2016),(7,'烟台港',0,2016),(8,'青岛港',0,2016),(9,'日照港',0,2016),(10,'连云港港',0,2016),(11,'上海港',0,2016),(12,'宁波-舟山港',0,2016),(13,'温州港',0,2016),(14,'福州港',0,2016),(15,'厦门港',0,2016),(16,'深圳港',0,2016),(17,'广州港',0,2016),(18,'珠海港',0,2016),(19,'汕头港',0,2016),(20,'湛江港',0,2016),(21,'北部湾港',0,2016),(22,'海口港',0,2016),(23,'南通港',0,2016),(24,'苏州港',0,2016),(25,'镇江港',0,2016),(26,'南京港',0,2016),(28,'营口港',0,2014),(29,'秦皇岛港',0,2014),(30,'黄骅港',0,2014),(31,'唐山港',0,2014),(32,'天津港',0,2014),(33,'烟台港',0,2014),(34,'青岛港',0,2014),(35,'日照港',0,2014),(36,'连云港港',0,2014),(37,'上海港',0,2014),(38,'宁波-舟山港',0,2014),(39,'温州港',0,2014),(40,'福州港',0,2014),(41,'厦门港',0,2014),(42,'深圳港',0,2014),(43,'广州港',0,2014),(44,'珠海港',0,2014),(45,'汕头港',0,2014),(46,'湛江港',0,2014),(47,'北部湾港',0,2014),(48,'海口港',0,2014),(49,'南通港',0,2014),(50,'苏州港',0,2014),(51,'镇江港',0,2014),(52,'南京港',0,2014),(53,'大连港',0,2015),(54,'营口港',0,2015),(55,'秦皇岛港',0,2015),(56,'黄骅港',0,2015),(57,'唐山港',0,2015),(58,'天津港',0,2015),(59,'烟台港',0,2015),(60,'青岛港',0,2015),(61,'日照港',0,2015),(62,'连云港港',0,2015),(63,'上海港',0,2015),(64,'宁波-舟山港',0,2015),(65,'温州港',0,2015),(66,'福州港',0,2015),(67,'厦门港',0,2015),(68,'深圳港',0,2015),(69,'广州港',0,2015),(70,'珠海港',0,2015),(71,'汕头港',0,2015),(72,'湛江港',0,2015),(73,'北部湾港',0,2015),(74,'海口港',0,2015),(75,'南通港',0,2015),(76,'苏州港',0,2015),(77,'镇江港',0,2015),(78,'南京港',0,2015),(110,'大连港',0,2017),(111,'营口港',0,2017),(112,'秦皇岛港',0,2017),(113,'黄骅港',0,2017),(114,'唐山港',0,2017),(115,'天津港',0,2017),(116,'烟台港',0,2017),(117,'青岛港',0,2017),(118,'日照港',0,2017),(119,'连云港港',0,2017),(120,'上海港',0,2017),(121,'宁波-舟山港',0,2017),(122,'温州港',0,2017),(123,'福州港',0,2017),(124,'厦门港',0,2017),(125,'深圳港',0,2017),(126,'广州港',0,2017),(127,'珠海港',0,2017),(128,'汕头港',0,2017),(129,'湛江港',0,2017),(130,'北部湾港',0,2017),(131,'海口港',0,2017),(132,'南通港',0,2017),(133,'苏州港',0,2017),(134,'镇江港',0,2017),(135,'南京港',0,2017),(138,'大连港',0,2014);
/*!40000 ALTER TABLE `qwdttlswrs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `qwdttlswrs_nh`
--

DROP TABLE IF EXISTS `qwdttlswrs_nh`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `qwdttlswrs_nh` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `gkaqscsp` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `gkaqscsp_index` (`gkaqscsp`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `qwdttlswrs_nh`
--

LOCK TABLES `qwdttlswrs_nh` WRITE;
/*!40000 ALTER TABLE `qwdttlswrs_nh` DISABLE KEYS */;
INSERT INTO `qwdttlswrs_nh` VALUES (1,'泸州港',9,2014),(2,'重庆港',9,2014),(3,'武汉港',9,2014),(4,'岳阳港',8,2014),(5,'九江港',9,2014),(6,'芜湖港',9,2014),(7,'湖州港',9,2014),(8,'贵港港',9,2014),(9,'佛山港',9,2014),(10,'徐州港',9,2014),(11,'杭州港',9,2014),(12,'哈尔滨港',9,2014),(13,'佳木斯港',9,2014),(14,'泸州港',9,2015),(15,'重庆港',9,2015),(16,'武汉港',9,2015),(17,'岳阳港',9,2015),(18,'九江港',9,2015),(19,'芜湖港',9,2015),(20,'湖州港',9,2015),(21,'贵港港',9,2015),(22,'佛山港',9,2015),(23,'徐州港',9,2015),(24,'杭州港',9,2015),(25,'哈尔滨港',9,2015),(26,'佳木斯港',9,2015),(27,'泸州港',9,2016),(28,'重庆港',9,2016),(29,'武汉港',8,2016),(30,'岳阳港',8,2016),(31,'九江港',9,2016),(32,'芜湖港',9,2016),(33,'湖州港',9,2016),(34,'贵港港',9,2016),(35,'佛山港',8,2016),(36,'徐州港',9,2016),(37,'杭州港',9,2016),(38,'哈尔滨港',9,2016),(39,'佳木斯港',9,2016),(40,'泸州港',9,2017),(41,'重庆港',9,2017),(42,'武汉港',9,2017),(43,'岳阳港',8,2017),(44,'九江港',9,2017),(45,'芜湖港',9,2017),(46,'湖州港',9,2017),(47,'贵港港',9,2017),(48,'佛山港',9,2017),(49,'徐州港',9,2017),(50,'杭州港',9,2017),(51,'哈尔滨港',9,2017),(52,'佳木斯港',9,2017);
/*!40000 ALTER TABLE `qwdttlswrs_nh` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Temporary view structure for view `qwdttlswrs_stat`
--

DROP TABLE IF EXISTS `qwdttlswrs_stat`;
/*!50001 DROP VIEW IF EXISTS `qwdttlswrs_stat`*/;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8mb4;
/*!50001 CREATE VIEW `qwdttlswrs_stat` AS SELECT 
 1 AS `year`,
 1 AS `min`,
 1 AS `avg`,
 1 AS `max`*/;
SET character_set_client = @saved_cs_client;

--
-- Table structure for table `temp`
--

DROP TABLE IF EXISTS `temp`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `temp` (
  `temp_id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `jzxbwcd` int(11) NOT NULL,
  `f_jzxbwcd` int(11) NOT NULL,
  `jzxttl_xs` decimal(65,30) DEFAULT NULL,
  `jzxttl_zl` decimal(65,30) DEFAULT NULL,
  `f_jzxttl_zl` decimal(65,30) DEFAULT NULL,
  `year` int(11) NOT NULL,
  PRIMARY KEY (`temp_id`),
  KEY `jzxbwcd_index` (`jzxbwcd`),
  KEY `f_jzxbwcd__index` (`f_jzxbwcd`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `temp`
--

LOCK TABLES `temp` WRITE;
/*!40000 ALTER TABLE `temp` DISABLE KEYS */;
INSERT INTO `temp` VALUES (1,'大连港',4393,35056,1013.225100000000000000000000000000,12326.000000000000000000000000000000,30011.000000000000000000000000000000,2014),(2,'营口港',2047,15385,561.159100000000000000000000000000,12736.000000000000000000000000000000,20337.000000000000000000000000000000,2014),(3,'秦皇岛港',537,15391,41.402500000000000000000000000000,585.000000000000000000000000000000,26818.000000000000000000000000000000,2014),(4,'黄骅港',0,8761,31.398900000000000000000000000000,381.000000000000000000000000000000,17170.000000000000000000000000000000,2014),(5,'唐山港',1247,22468,110.860000000000000000000000000000,1757.000000000000000000000000000000,48318.000000000000000000000000000000,2014),(6,'天津港',7687,28267,1406.059600000000000000000000000000,15904.000000000000000000000000000000,38098.000000000000000000000000000000,2014),(7,'烟台港',3339,24812,235.632200000000000000000000000000,1918.000000000000000000000000000000,21849.000000000000000000000000000000,2014),(8,'青岛港',6945,18901,1658.424600000000000000000000000000,17832.000000000000000000000000000000,28970.000000000000000000000000000000,2014),(9,'日照港',844,13863,242.026400000000000000000000000000,3935.000000000000000000000000000000,29567.000000000000000000000000000000,2014),(10,'连云港港',2726,11973,500.540100000000000000000000000000,4977.000000000000000000000000000000,14661.000000000000000000000000000000,2014),(11,'上海港',12335,63065,3528.526200000000000000000000000000,35335.000000000000000000000000000000,31619.000000000000000000000000000000,2014),(12,'宁波-舟山港',9538,70587,1944.957300000000000000000000000000,19958.000000000000000000000000000000,67388.000000000000000000000000000000,2014),(13,'温州港',252,10674,60.083400000000000000000000000000,822.000000000000000000000000000000,7079.000000000000000000000000000000,2014),(14,'福州港',2169,20557,223.943200000000000000000000000000,3020.000000000000000000000000000000,11371.000000000000000000000000000000,2014),(15,'厦门港',7992,19224,857.241200000000000000000000000000,9791.000000000000000000000000000000,10713.000000000000000000000000000000,2014),(16,'深圳港',16943,12161,2403.732600000000000000000000000000,18069.000000000000000000000000000000,4255.000000000000000000000000000000,2014),(17,'广州港',8088,38912,1638.856200000000000000000000000000,24087.000000000000000000000000000000,24130.000000000000000000000000000000,2014),(18,'珠海港',934,16834,117.567700000000000000000000000000,1598.000000000000000000000000000000,9105.000000000000000000000000000000,2014),(19,'汕头港',460,9167,130.304500000000000000000000000000,1250.000000000000000000000000000000,3911.000000000000000000000000000000,2014),(20,'湛江港',1074,13138,58.084200000000000000000000000000,819.000000000000000000000000000000,19419.000000000000000000000000000000,2014),(21,'北部湾港',498,33005,112.001300000000000000000000000000,1960.000000000000000000000000000000,18229.000000000000000000000000000000,2014),(22,'海口港',590,6130,134.665600000000000000000000000000,2461.000000000000000000000000000000,6454.000000000000000000000000000000,2014),(23,'南通港',640,16900,71.104300000000000000000000000000,749.000000000000000000000000000000,20850.000000000000000000000000000000,2014),(24,'苏州港',3685,45215,444.994400000000000000000000000000,6284.000000000000000000000000000000,41508.000000000000000000000000000000,2014),(25,'镇江港',1279,18597,37.549600000000000000000000000000,551.000000000000000000000000000000,13510.000000000000000000000000000000,2014),(26,'南京港',2377,33468,276.457400000000000000000000000000,2517.000000000000000000000000000000,18484.000000000000000000000000000000,2014),(27,'大连港',4393,37262,944.857000000000000000000000000000,11474.000000000000000000000000000000,30008.000000000000000000000000000000,2015),(28,'营口港',2047,16185,592.247400000000000000000000000000,13446.000000000000000000000000000000,20403.000000000000000000000000000000,2015),(29,'秦皇岛港',537,15391,50.087900000000000000000000000000,619.000000000000000000000000000000,24690.000000000000000000000000000000,2015),(30,'黄骅港',0,8761,50.179700000000000000000000000000,634.000000000000000000000000000000,16024.000000000000000000000000000000,2015),(31,'唐山港',1247,24874,152.247930000000000000000000000000,2335.000000000000000000000000000000,46950.000000000000000000000000000000,2015),(32,'天津港',7687,31042,1411.131400000000000000000000000000,15492.000000000000000000000000000000,38559.000000000000000000000000000000,2015),(33,'烟台港',3339,26518,245.218300000000000000000000000000,2090.000000000000000000000000000000,23073.000000000000000000000000000000,2015),(34,'青岛港',6945,21390,1743.555100000000000000000000000000,17936.000000000000000000000000000000,30517.000000000000000000000000000000,2015),(35,'日照港',844,14762,281.142900000000000000000000000000,5585.000000000000000000000000000000,28122.000000000000000000000000000000,2015),(36,'连云港港',2726,13174,500.974600000000000000000000000000,4964.000000000000000000000000000000,14792.000000000000000000000000000000,2015),(37,'上海港',12335,62865,3653.699100000000000000000000000000,35850.000000000000000000000000000000,29056.000000000000000000000000000000,2015),(38,'宁波-舟山港',9538,73451,2062.650300000000000000000000000000,20606.000000000000000000000000000000,68323.000000000000000000000000000000,2015),(39,'温州港',252,16867,55.871400000000000000000000000000,774.000000000000000000000000000000,7716.000000000000000000000000000000,2015),(40,'福州港',2169,21518,242.820900000000000000000000000000,3463.000000000000000000000000000000,10504.000000000000000000000000000000,2015),(41,'厦门港',7992,20293,918.281500000000000000000000000000,10401.000000000000000000000000000000,10622.000000000000000000000000000000,2015),(42,'深圳港',16943,14437,2420.445000000000000000000000000000,18008.000000000000000000000000000000,3698.000000000000000000000000000000,2015),(43,'广州港',8088,38912,1739.657800000000000000000000000000,25836.000000000000000000000000000000,24217.000000000000000000000000000000,2015),(44,'珠海港',934,16332,133.767900000000000000000000000000,1877.000000000000000000000000000000,9332.000000000000000000000000000000,2015),(45,'汕头港',460,9167,117.855300000000000000000000000000,1138.000000000000000000000000000000,4043.000000000000000000000000000000,2015),(46,'湛江港',1074,15219,60.121900000000000000000000000000,863.000000000000000000000000000000,21173.000000000000000000000000000000,2015),(47,'北部湾港',498,34845,141.516300000000000000000000000000,2549.000000000000000000000000000000,17933.000000000000000000000000000000,2015),(48,'海口港',590,7423,127.128700000000000000000000000000,2374.000000000000000000000000000000,6830.000000000000000000000000000000,2015),(49,'南通港',640,16900,75.854800000000000000000000000000,776.000000000000000000000000000000,21051.000000000000000000000000000000,2015),(50,'苏州港',3685,47315,510.194500000000000000000000000000,7480.000000000000000000000000000000,46510.000000000000000000000000000000,2015),(51,'镇江港',1279,21800,40.710900000000000000000000000000,479.000000000000000000000000000000,12531.000000000000000000000000000000,2015),(52,'南京港',2377,33897,294.010600000000000000000000000000,2680.000000000000000000000000000000,18774.000000000000000000000000000000,2015),(53,'大连港',4393,37262,958.300000000000000000000000000000,11880.000000000000000000000000000000,31780.010000000000000000000000000000,2016),(54,'营口港',2047,16185,608.730000000000000000000000000000,13439.000000000000000000000000000000,21778.020000000000000000000000000000,2016),(55,'秦皇岛港',537,15391,51.550000000000000000000000000000,609.000000000000000000000000000000,18072.570000000000000000000000000000,2016),(56,'黄骅港',0,9059,60.151900000000000000000000000000,714.000000000000000000000000000000,23761.000000000000000000000000000000,2016),(57,'唐山港',1247,26942,193.570000000000000000000000000000,2879.000000000000000000000000000000,49172.350000000000000000000000000000,2016),(58,'天津港',7687,31702,1451.920000000000000000000000000000,15691.000000000000000000000000000000,39364.750000000000000000000000000000,2016),(59,'烟台港',3339,28101,260.140000000000000000000000000000,2214.000000000000000000000000000000,24322.870000000000000000000000000000,2016),(60,'青岛港',6945,21644,1805.010000000000000000000000000000,18441.000000000000000000000000000000,31595.320000000000000000000000000000,2016),(61,'日照港',844,16445,301.020000000000000000000000000000,6838.000000000000000000000000000000,28169.260000000000000000000000000000,2016),(62,'连云港港',2726,13724,470.330000000000000000000000000000,4843.000000000000000000000000000000,15239.000000000000000000000000000000,2016),(63,'上海港',12335,61765,3713.310000000000000000000000000000,36736.000000000000000000000000000000,27745.620000000000000000000000000000,2016),(64,'宁波-舟山港',9538,75951,2156.130000000000000000000000000000,21907.000000000000000000000000000000,70302.240000000000000000000000000000,2016),(65,'温州港',252,16867,55.920000000000000000000000000000,817.000000000000000000000000000000,7589.080000000000000000000000000000,2016),(66,'福州港',2169,23038,268.120000000000000000000000000000,3778.000000000000000000000000000000,10737.660000000000000000000000000000,2016),(67,'厦门港',7992,21244,961.370000000000000000000000000000,11001.000000000000000000000000000000,9909.780000000000000000000000000000,2016),(68,'深圳港',16943,15507,2397.940000000000000000000000000000,17708.000000000000000000000000000000,3701.880000000000000000000000000000,2016),(69,'广州港',8088,38912,1866.180000000000000000000000000000,27598.000000000000000000000000000000,24655.820000000000000000000000000000,2016),(70,'珠海港',934,17440,165.350000000000000000000000000000,2742.000000000000000000000000000000,9036.740000000000000000000000000000,2016),(71,'汕头港',460,9815,124.020000000000000000000000000000,1226.000000000000000000000000000000,3759.050000000000000000000000000000,2016),(72,'湛江港',1074,15719,72.360000000000000000000000000000,1030.000000000000000000000000000000,24582.500000000000000000000000000000,2016),(73,'北部湾港',498,36105,179.490000000000000000000000000000,3335.000000000000000000000000000000,17056.600000000000000000000000000000,2016),(74,'海口港',590,7423,140.180000000000000000000000000000,2678.000000000000000000000000000000,7273.850000000000000000000000000000,2016),(75,'南通港',640,17579,82.690000000000000000000000000000,899.000000000000000000000000000000,21714.840000000000000000000000000000,2016),(76,'苏州港',3685,50355,547.920000000000000000000000000000,7697.000000000000000000000000000000,50239.590000000000000000000000000000,2016),(77,'镇江港',1279,22792,37.300000000000000000000000000000,550.000000000000000000000000000000,12586.920000000000000000000000000000,2016),(78,'南京港',2377,35549,308.390000000000000000000000000000,2656.000000000000000000000000000000,19317.460000000000000000000000000000,2016),(79,'大连港',4393,37262,970.000000000000000000000000000000,12025.044349368700000000000000000000,33079.955650631300000000000000000000,2017),(80,'营口港',2047,16185,627.000000000000000000000000000000,13842.348824602000000000000000000000,22396.651175398000000000000000000000,2017),(81,'秦皇岛港',537,15391,55.900000000000000000000000000000,660.389912706111000000000000000000,23819.610087293900000000000000000000,2017),(82,'黄骅港',0,9059,65.400000000000000000000000000000,776.294680633530000000000000000000,26180.705319366500000000000000000000,2017),(83,'唐山港',1247,26942,253.000000000000000000000000000000,3762.912641421710000000000000000000,52777.087358578300000000000000000000,2017),(84,'天津港',7687,31702,1504.000000000000000000000000000000,16253.832167061500000000000000000000,34030.167832938400000000000000000000,2017),(85,'烟台港',3339,28101,270.200000000000000000000000000000,2299.618666871680000000000000000000,26260.381333128300000000000000000000,2017),(86,'青岛港',6945,21644,1830.000000000000000000000000000000,18696.311931789900000000000000000000,32102.688068210200000000000000000000,2017),(87,'日照港',844,16445,323.800000000000000000000000000000,7355.472726064710000000000000000000,28646.527273935300000000000000000000,2017),(88,'连云港港',2726,13724,472.000000000000000000000000000000,4860.196032572870000000000000000000,15878.803967427100000000000000000000,2017),(89,'上海港',12335,61765,4018.000000000000000000000000000000,39750.316563928100000000000000000000,30812.683436071900000000000000000000,2017),(90,'宁波-舟山港',9538,78451,2464.000000000000000000000000000000,25035.061893299600000000000000000000,75675.938106700400000000000000000000,2017),(91,'温州港',252,16867,60.090000000000000000000000000000,877.924356223176000000000000000000,8048.075643776820000000000000000000,2017),(92,'福州港',2169,23038,300.000000000000000000000000000000,4227.211696255410000000000000000000,10371.788303744600000000000000000000,2017),(93,'厦门港',7992,21244,1040.000000000000000000000000000000,11900.766614310800000000000000000000,9145.233385689170000000000000000000,2017),(94,'深圳港',16943,15507,2525.000000000000000000000000000000,18646.296404413800000000000000000000,5450.703595586210000000000000000000,2017),(95,'广州港',8088,38912,2010.000000000000000000000000000000,29724.881844195100000000000000000000,26894.118155804900000000000000000000,2017),(96,'珠海港',934,17440,230.000000000000000000000000000000,3814.091321439370000000000000000000,9185.908678560630000000000000000000,2017),(97,'汕头港',460,9815,129.900000000000000000000000000000,1284.126753749400000000000000000000,3605.573246250600000000000000000000,2017),(98,'湛江港',1074,15719,90.000000000000000000000000000000,1281.094527363180000000000000000000,13018.905472636800000000000000000000,2017),(99,'北部湾港',498,36105,227.870000000000000000000000000000,4233.920831244080000000000000000000,17494.079168755900000000000000000000,2017),(100,'海口港',590,7423,163.600000000000000000000000000000,3125.415893850760000000000000000000,6987.184106149240000000000000000000,2017),(101,'南通港',640,17579,100.710000000000000000000000000000,1094.912202200990000000000000000000,22474.087797799000000000000000000000,2017),(102,'苏州港',3685,50355,600.000000000000000000000000000000,8428.602715724920000000000000000000,52345.397284275100000000000000000000,2017),(103,'镇江港',1279,22792,38.000000000000000000000000000000,560.321715817694000000000000000000,13868.678284182300000000000000000000,2017),(104,'南京港',2377,35549,317.000000000000000000000000000000,2730.153377217160000000000000000000,21182.846622782800000000000000000000,2017);
/*!40000 ALTER TABLE `temp` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `encrypted_password` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `salt` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `role` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT '普通',
  `gk` varchar(240) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT '大连港',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username_UNIQUE` (`username`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'test','282d813aca03009ddcda7210278030a3a8be46e70fa86b2101c29999dce69e82602f41ddad1b6069c58091cb16058b39fb86648efe5a0a009d7c4d84792ec4f8','b3e93d7d','普通','大连港,泸州港'),(6,'admin','cdc2f4e4d4623f44a4dca0ca15210c08be4b31b77a880a5f953a3037f71456e500cc7a831b0ed9712c6e3876c469fb7b9d04624afb4591f4ed4d1722b8086117','74666967','管理员','上海港,北部湾港,南京港,南通港,厦门港,唐山港,大连港,天津港,宁波-舟山港,广州港,日照港,汕头港,海口港,深圳港,温州港,湛江港,烟台港,珠海港,福州港,秦皇岛港,苏州港,营口港,连云港港,镇江港,青岛港,黄骅港'),(7,'guest','0ead7f856d649e2f87bf1a1774683047a669cbb511c6298566006cc55afcdb27258d8a97e9a45d7eecd925f60ad4150f992b4e4b1ff2864d1071fa91b8b57c5d','8fed2c54','游客',''),(8,'user1','cedef66116042004f520ab01359a61f758e97c4f296a6549daef1dc6e17dba543ac4aa2c3ce15b4ffe111cef3e4687b3ae9b20e52805b2e8575d102f43fc7966','5610da61','普通','福州港'),(9,'user2','0157b9cae35b656ecb887171ca496f302e42d443183b42f3b967b0fc3f6cefe182932fbf5fbe35bc7e34d8fd0b3b33cb6f03c34e59fd7ac3168327fc275c4356','ff7637f9','普通','烟台港'),(10,'user3','bb28e037166c247840759de14591998fbe1a270a4fddb7ab26eeee5024dd9c2782a0ae199df6a0f894a3b38d43c350e989fd30b5230ddc14d1ad48cfef2ee7d9','05219eb3','普通','上海港'),(11,'user4','0095afd8e15b0929bb44b7987fb7f4483942dd8e6a2dc1b1dba81c51af7b2de3503457dcb4b6acc4231f101c88479083b2b13f704642141f0f506497e6270d96','46bfdadf','普通','上海港'),(12,'test2','ce1a5536c061505a4795d3695ed97c59a25461316a7470598570be5caf45c65d7726d5df40ef7be75c0a3707a806a977f86cf66389f002ca9a3989a3986b7e4f','095efe2e','普通','泸州港');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yhgkhwttl`
--

DROP TABLE IF EXISTS `yhgkhwttl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `yhgkhwttl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `year` int(11) NOT NULL,
  `gkhwttl` int(11) DEFAULT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`gkhwttl` <= 10000) then 1 when (`gkhwttl` > 70000) then 10 else (((`gkhwttl` / 20000) * 3) - 0.5) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=459 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yhgkhwttl`
--

LOCK TABLES `yhgkhwttl` WRITE;
/*!40000 ALTER TABLE `yhgkhwttl` DISABLE KEYS */;
INSERT INTO `yhgkhwttl` (`id`, `gk`, `year`, `gkhwttl`) VALUES (337,'大连港',2014,42337),(338,'营口港',2014,33073),(339,'秦皇岛港',2014,27403),(340,'黄骅港',2014,17551),(341,'唐山港',2014,50075),(342,'天津港',2014,54002),(343,'烟台港',2014,23767),(344,'青岛港',2014,46802),(345,'日照港',2014,33502),(346,'连云港港',2014,19638),(347,'上海港',2014,66954),(348,'宁波-舟山港',2014,87346),(349,'温州港',2014,7901),(350,'福州港',2014,14391),(351,'厦门港',2014,20504),(352,'深圳港',2014,22324),(353,'广州港',2014,48217),(354,'珠海港',2014,10703),(355,'汕头港',2014,5161),(356,'湛江港',2014,20238),(358,'海口港',2014,8915),(359,'南通港',2014,21599),(360,'苏州港',2014,47792),(361,'镇江港',2014,14061),(362,'南京港',2014,21001),(363,'大连港',2015,41482),(364,'营口港',2015,33849),(365,'秦皇岛港',2015,25309),(366,'黄骅港',2015,16658),(367,'唐山港',2015,49285),(368,'天津港',2015,54051),(369,'烟台港',2015,25163),(370,'青岛港',2015,48453),(371,'日照港',2015,33707),(372,'连云港港',2015,19756),(373,'上海港',2015,64906),(374,'宁波-舟山港',2015,88929),(375,'温州港',2015,8490),(376,'福州港',2015,13967),(377,'厦门港',2015,21023),(378,'深圳港',2015,21706),(379,'广州港',2015,50053),(380,'珠海港',2015,11209),(381,'汕头港',2015,5181),(382,'湛江港',2015,22036),(383,'北部湾港',2015,20482),(384,'海口港',2015,9204),(385,'南通港',2015,21827),(386,'苏州港',2015,53990),(387,'镇江港',2015,13010),(388,'南京港',2015,21454),(389,'大连港',2016,43660),(390,'营口港',2016,35217),(391,'秦皇岛港',2016,18682),(392,'黄骅港',2016,24475),(393,'唐山港',2016,52051),(394,'天津港',2016,55056),(395,'烟台港',2016,26537),(396,'青岛港',2016,50036),(397,'日照港',2016,35007),(398,'连云港港',2016,20082),(399,'上海港',2016,64482),(400,'宁波-舟山港',2016,92209),(401,'温州港',2016,8406),(402,'福州港',2016,14516),(403,'厦门港',2016,20911),(404,'深圳港',2016,21410),(405,'广州港',2016,52254),(406,'珠海港',2016,11779),(407,'汕头港',2016,4985),(408,'湛江港',2016,25613),(409,'北部湾港',2016,20392),(410,'海口港',2016,9952),(411,'南通港',2016,22614),(412,'苏州港',2016,57937),(413,'镇江港',2016,13137),(414,'南京港',2016,21973),(415,'大连港',2017,45105),(416,'营口港',2017,36239),(417,'秦皇岛港',2017,24480),(418,'黄骅港',2017,26957),(419,'唐山港',2017,56540),(420,'天津港',2017,50284),(421,'烟台港',2017,28560),(422,'青岛港',2017,50799),(423,'日照港',2017,36002),(424,'连云港港',2017,20739),(425,'上海港',2017,70563),(426,'宁波-舟山港',2017,100711),(427,'温州港',2017,8926),(428,'福州港',2017,14599),(429,'厦门港',2017,21046),(430,'深圳港',2017,24097),(431,'广州港',2017,56619),(432,'珠海港',2017,13000),(433,'汕头港',2017,4890),(434,'湛江港',2017,14300),(435,'北部湾港',2017,21728),(436,'海口港',2017,10113),(437,'南通港',2017,23569),(438,'苏州港',2017,60774),(439,'镇江港',2017,14429),(440,'南京港',2017,23913);
/*!40000 ALTER TABLE `yhgkhwttl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yhgkjxpjldt`
--

DROP TABLE IF EXISTS `yhgkjxpjldt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `yhgkjxpjldt` (
  `yhgkjxpjldt_id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `hwttl` decimal(65,30) DEFAULT NULL,
  `jjxttl` decimal(65,30) DEFAULT NULL,
  `dckbbz` decimal(65,30) DEFAULT NULL,
  `mtzzkbnl` decimal(65,30) DEFAULT NULL,
  `jzxbwbmaxttl` decimal(65,30) DEFAULT NULL,
  `bmaxttl` decimal(65,30) DEFAULT NULL,
  `fgljsbz` decimal(65,30) DEFAULT NULL,
  `ddsr` decimal(65,30) DEFAULT NULL,
  `gkzjz` decimal(65,30) DEFAULT NULL,
  `year` int(11) DEFAULT '2016',
  PRIMARY KEY (`yhgkjxpjldt_id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yhgkjxpjldt`
--

LOCK TABLES `yhgkjxpjldt` WRITE;
/*!40000 ALTER TABLE `yhgkjxpjldt` DISABLE KEYS */;
INSERT INTO `yhgkjxpjldt` VALUES (1,'大连港',0.473488448663062000000000000000,0.258071639588400000000000000000,0.065605095541401300000000000000,0.666666666666667000000000000000,0.605242435325615000000000000000,0.508552923606819000000000000000,0.106194690265487000000000000000,0.243548714954829000000000000000,0.467307316774411000000000000000,2016),(2,'营口港',0.381925065210384000000000000000,0.163931909805537000000000000000,0.046974522292993600000000000000,0.666666666666667000000000000000,0.825079787618412000000000000000,0.861096401429778000000000000000,0.201327433628319000000000000000,0.421246733067028000000000000000,0.396012277896368000000000000000,2016),(3,'秦皇岛港',0.202599761151919000000000000000,0.013882492977963100000000000000,0.010987261146496800000000000000,0.333333333333333000000000000000,0.266344338132468000000000000000,0.522860226888036000000000000000,1.000000000000000000000000000000,1.000000000000000000000000000000,0.201649725080625000000000000000,2016),(4,'唐山港',0.564491693023389000000000000000,0.052128693806873100000000000000,0.125318471337580000000000000000,0.666666666666667000000000000000,0.430685927690606000000000000000,0.888332765691914000000000000000,0.309734513274336000000000000000,0.306961613547777000000000000000,0.557732771602478000000000000000,2016),(5,'天津港',0.597074111011001000000000000000,0.391004252270885000000000000000,0.550955414012739000000000000000,0.666666666666667000000000000000,0.524052614187794000000000000000,0.678990826209701000000000000000,0.179203539823009000000000000000,0.641228729818917000000000000000,0.617160154881710000000000000000,2016),(6,'烟台港',0.287789705239952000000000000000,0.070056095505088400000000000000,0.018312101910828000000000000000,0.444444444444444000000000000000,0.216162225036425000000000000000,0.420232224919226000000000000000,0.088495575221238900000000000000,0.672117185485679000000000000000,0.271925494551436000000000000000,2016),(7,'青岛港',0.542638893889593000000000000000,0.486091923378334000000000000000,0.487898089171974000000000000000,0.888888888888889000000000000000,0.721101580467913000000000000000,0.789168703772185000000000000000,0.174778761061947000000000000000,0.750830205578154000000000000000,0.566513094246243000000000000000,2016),(8,'日照港',0.379650238956530000000000000000,0.081065141342898900000000000000,0.096656050955414000000000000000,0.666666666666667000000000000000,0.693015395472357000000000000000,1.000000000000000000000000000000,0.157079646017699000000000000000,0.534499393881806000000000000000,0.376702751231672000000000000000,2016),(9,'连云港港',0.217787284658240000000000000000,0.126660580452480000000000000000,0.107643312101911000000000000000,0.555555555555556000000000000000,0.478702741651603000000000000000,0.568732604447590000000000000000,0.219026548672566000000000000000,0.370214322860954000000000000000,0.228305824533177000000000000000,2016),(10,'上海港',0.699296729915570000000000000000,1.000000000000000000000000000000,0.430891719745223000000000000000,0.555555555555556000000000000000,0.835239718860240000000000000000,0.421142032350367000000000000000,0.621681415929204000000000000000,0.887033366988960000000000000000,0.790176712550202000000000000000,2016),(11,'宁波-舟山港',1.000000000000000000000000000000,0.580649070505829000000000000000,1.000000000000000000000000000000,1.000000000000000000000000000000,0.627200952779923000000000000000,0.570944014738620000000000000000,0.654867256637168000000000000000,0.273888145002061000000000000000,1.000000000000000000000000000000,2016),(12,'温州港',0.091163098188424500000000000000,0.015059340588316100000000000000,0.000000000000000000000000000000,0.111111111111111000000000000000,0.615680937258741000000000000000,0.342977637998838000000000000000,0.000000000000000000000000000000,0.170244143688114000000000000000,0.088010088601384400000000000000,2016),(13,'福州港',0.157420883199992000000000000000,0.072205121576167900000000000000,0.022770700636942700000000000000,0.155555555555556000000000000000,0.342972061535654000000000000000,0.398116350475933000000000000000,0.019911504424778800000000000000,0.025533190731874000000000000000,0.162681451764984000000000000000,2016),(14,'厦门港',0.226775320998199000000000000000,0.258898395232286000000000000000,0.268152866242038000000000000000,0.333333333333333000000000000000,0.333752229582081000000000000000,0.396439757225340000000000000000,0.048672566371681400000000000000,0.393056713101671000000000000000,0.250556347692549000000000000000,2016),(15,'深圳港',0.232188010659235000000000000000,0.645768869283739000000000000000,0.789968152866242000000000000000,0.377777777777778000000000000000,0.421272162471268000000000000000,0.341614941819392000000000000000,0.402654867256637000000000000000,0.878744726429120000000000000000,0.278795251897194000000000000000,2016),(16,'广州港',0.566687459955206000000000000000,0.502565096908149000000000000000,0.130414012738854000000000000000,0.222222222222222000000000000000,0.640179073150385000000000000000,0.619845132666965000000000000000,0.909292035398230000000000000000,0.437788194473766000000000000000,0.625416692553317000000000000000,2016),(17,'珠海港',0.127739259102450000000000000000,0.044529005119421800000000000000,0.005573248407643310000000000000,0.333333333333333000000000000000,0.491186484475464000000000000000,0.351488233160544000000000000000,0.778761061946902000000000000000,0.016049764805450800000000000000,0.130397596081809000000000000000,2016),(18,'汕头港',0.054062369454514500000000000000,0.033398773600911300000000000000,0.018630573248407600000000000000,0.111111111111111000000000000000,0.748036828986476000000000000000,0.274629462574335000000000000000,0.000000000000000000000000000000,0.239626730663595000000000000000,0.054904797227281900000000000000,2016),(19,'湛江港',0.277765004895388000000000000000,0.019486657456554900000000000000,0.094426751592356700000000000000,0.666666666666667000000000000000,0.186931874949228000000000000000,0.890977718510898000000000000000,0.185840707964602000000000000000,0.302206001314376000000000000000,0.258787087228250000000000000000,2016),(20,'北部湾港',0.221144865742305000000000000000,0.048336928508527400000000000000,0.057643312101910800000000000000,0.444444444444444000000000000000,1.000000000000000000000000000000,0.295893415629229000000000000000,0.243362831858407000000000000000,0.596332162271671000000000000000,0.219590717344623000000000000000,2016),(21,'海口港',0.107926819481432000000000000000,0.037750686045603500000000000000,0.000000000000000000000000000000,0.111111111111111000000000000000,0.659209001776219000000000000000,0.660188615416590000000000000000,0.108407079646018000000000000000,0.173036519427530000000000000000,0.108583282854741000000000000000,2016);
/*!40000 ALTER TABLE `yhgkjxpjldt` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yhgkjzxttl`
--

DROP TABLE IF EXISTS `yhgkjzxttl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `yhgkjzxttl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gk` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `jzxttl` int(11) DEFAULT NULL,
  `year` int(11) NOT NULL,
  `metric` decimal(65,2) GENERATED ALWAYS AS ((case when (`jzxttl` <= 100) then 1 when (`jzxttl` > 3000) then 10 else (((`jzxttl` * 9.0) / 2900) + (20 / 29.0)) end)) VIRTUAL,
  PRIMARY KEY (`id`),
  KEY `year_index` (`year`)
) ENGINE=InnoDB AUTO_INCREMENT=447 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yhgkjzxttl`
--

LOCK TABLES `yhgkjzxttl` WRITE;
/*!40000 ALTER TABLE `yhgkjzxttl` DISABLE KEYS */;
INSERT INTO `yhgkjzxttl` (`id`, `gk`, `jzxttl`, `year`) VALUES (343,'大连港',1013,2014),(344,'营口港',561,2014),(345,'秦皇岛港',41,2014),(346,'黄骅港',31,2014),(347,'唐山港',111,2014),(348,'天津港',1406,2014),(349,'烟台港',236,2014),(350,'青岛港',1658,2014),(351,'日照港',242,2014),(352,'连云港港',501,2014),(353,'上海港',3529,2014),(354,'宁波-舟山港',1945,2014),(355,'温州港',60,2014),(356,'福州港',224,2014),(357,'厦门港',857,2014),(358,'深圳港',2404,2014),(359,'广州港',1639,2014),(360,'珠海港',118,2014),(361,'汕头港',130,2014),(362,'湛江港',58,2014),(363,'北部湾港',112,2014),(364,'海口港',135,2014),(365,'南通港',71,2014),(366,'苏州港',445,2014),(367,'镇江港',38,2014),(368,'南京港',276,2014),(369,'大连港',945,2015),(370,'营口港',592,2015),(371,'秦皇岛港',50,2015),(372,'黄骅港',50,2015),(373,'唐山港',152,2015),(374,'天津港',1411,2015),(375,'烟台港',245,2015),(376,'青岛港',1744,2015),(377,'日照港',281,2015),(378,'连云港港',501,2015),(379,'上海港',3654,2015),(380,'宁波-舟山港',2063,2015),(381,'温州港',56,2015),(382,'福州港',243,2015),(383,'厦门港',918,2015),(384,'深圳港',2420,2015),(385,'广州港',1740,2015),(386,'珠海港',134,2015),(387,'汕头港',118,2015),(388,'湛江港',60,2015),(389,'北部湾港',142,2015),(390,'海口港',127,2015),(391,'南通港',76,2015),(392,'苏州港',510,2015),(393,'镇江港',41,2015),(394,'南京港',294,2015),(395,'大连港',958,2016),(396,'营口港',609,2016),(397,'秦皇岛港',52,2016),(398,'黄骅港',60,2016),(399,'唐山港',194,2016),(400,'天津港',1452,2016),(401,'烟台港',260,2016),(402,'青岛港',1805,2016),(403,'日照港',301,2016),(404,'连云港港',470,2016),(405,'上海港',3713,2016),(406,'宁波-舟山港',2156,2016),(407,'温州港',56,2016),(408,'福州港',268,2016),(409,'厦门港',961,2016),(410,'深圳港',2398,2016),(411,'广州港',1866,2016),(412,'珠海港',165,2016),(413,'汕头港',124,2016),(414,'湛江港',72,2016),(415,'北部湾港',179,2016),(416,'海口港',140,2016),(417,'南通港',83,2016),(418,'苏州港',548,2016),(419,'镇江港',37,2016),(420,'南京港',308,2016),(421,'大连港',970,2017),(422,'营口港',627,2017),(423,'秦皇岛港',56,2017),(424,'黄骅港',65,2017),(425,'唐山港',253,2017),(426,'天津港',1504,2017),(427,'烟台港',270,2017),(428,'青岛港',1830,2017),(429,'日照港',324,2017),(430,'连云港港',472,2017),(431,'上海港',4018,2017),(432,'宁波-舟山港',2464,2017),(433,'温州港',60,2017),(434,'福州港',300,2017),(435,'厦门港',1040,2017),(436,'深圳港',2525,2017),(437,'广州港',2010,2017),(438,'珠海港',230,2017),(439,'汕头港',130,2017),(440,'湛江港',90,2017),(441,'北部湾港',228,2017),(442,'海口港',164,2017),(443,'南通港',101,2017),(444,'苏州港',600,2017),(445,'镇江港',38,2017),(446,'南京港',317,2017);
/*!40000 ALTER TABLE `yhgkjzxttl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'harbour'
--
/*!50003 DROP PROCEDURE IF EXISTS `data_import` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `data_import`()
BEGIN
INSERT INTO yhgkhwttl (gk, year,gkhwttl)
SELECT gk, year, gkhwttl
FROM temp2;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_bmaxttl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_bmaxttl`(in year int(11), in gk varchar(12) CHARSET utf8, in jzxbwcd int(11), in f_jzxbwcd int(11), in jzxttl_xs decimal(65,30), in jzxttl_zl decimal(65,30), in  f_jzxttl_zl decimal(65,30))
BEGIN
	declare new_id int unsigned default 0;
    /* declare new_metric int unsigned default 0; */
    
    insert into bmaxttl(year,gk,jzxbwcd,f_jzxbwcd,jzxttl_xs,jzxttl_zl,f_jzxttl_zl) 
    values(year,gk,jzxbwcd,f_jzxbwcd,jzxttl_xs,jzxttl_zl,f_jzxttl_zl);
    set new_id = last_insert_id();
    
    /* select total_metric into new_metric
    from bmaxttl where bmaxttl.gk=gk and bmaxttl.year=year;
    
	if not exists 
    (select * from overall_metric_for_radar 
    where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year
    ) then 
		insert into overall_metric_for_radar(gk, bmaxttl, year) 
		values (gk, new_metric, year) ;
    else 
		update overall_metric_for_radar
		set overall_metric_for_radar.bmaxttl = new_metric
		where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year;
    end if; */
    
    select * from bmaxttl where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_bmaxttl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_bmaxttl_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in gkhwttl decimal(65,2), in mtaxcd decimal(65,2))
BEGIN
	declare new_id int unsigned default 0;
    /* declare new_metric int unsigned default 0; */
    
    insert into bmaxttl_nh(year,gk,gkhwttl,mtaxcd) 
    values(year,gk,gkhwttl,mtaxcd);
    set new_id = last_insert_id();
    
    /* select total_metric into new_metric
    from bmaxttl where bmaxttl.gk=gk and bmaxttl.year=year;
    
	if not exists 
    (select * from overall_metric_for_radar 
    where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year
    ) then 
		insert into overall_metric_for_radar(gk, bmaxttl, year) 
		values (gk, new_metric, year) ;
    else 
		update overall_metric_for_radar
		set overall_metric_for_radar.bmaxttl = new_metric
		where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year;
    end if; */
    
    select * from bmaxttl_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_cbzgpjts` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_cbzgpjts`(in year int(11), in gk varchar(12) CHARSET utf8, in wmc_pjqdts decimal(12,2) , in nmc_pjqdts decimal(12,2), in wm_hwttl decimal(12,2), in nm_hwttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into cbzgpjts(year,gk,wmc_pjqdts,nmc_pjqdts,wm_hwttl,nm_hwttl) values(year,gk,wmc_pjqdts,nmc_pjqdts,wm_hwttl,nm_hwttl);
    set new_id = last_insert_id();
    select * from cbzgpjts where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_dckbsl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_dckbsl`(in year int(11), in gk varchar(12) CHARSET utf8, in dckbsl int(11))
BEGIN
	declare new_id int unsigned default 0;
    insert into dckbsl(year,gk,dckbsl) values(year,gk,dckbsl);
    set new_id = last_insert_id();
    select * from dckbsl where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_ddsr` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_ddsr`(in year int(11), in gk varchar(12) CHARSET utf8, in ddsr decimal(65,30))
BEGIN
	declare new_id int unsigned default 0;
    insert into ddsr(year,gk,ddsr) values(year,gk,ddsr);
    set new_id = last_insert_id();
    select * from ddsr where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_ddsr_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_ddsr_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in gkzjz decimal(65,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into ddsr_nh(year,gk,gkzjz) values(year,gk,gkzjz);
    set new_id = last_insert_id();
    select * from ddsr_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_gkhwttl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_gkhwttl_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in gkhwttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into gkhwttl_nh(year,gk,gkhwttl) values(year,gk,gkhwttl);
    set new_id = last_insert_id();
    select * from gkhwttl_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_gkjzxttl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_gkjzxttl_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in jzxttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into gkjzxttl_nh(year,gk,jzxttl) values(year,gk,jzxttl);
    set new_id = last_insert_id();
    select * from gkjzxttl_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_gkmtkbnl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_gkmtkbnl`(in year int(11), in gk varchar(12) CHARSET utf8, in mt_bw decimal(12,2), in yy_bw decimal(12,2), in jsks_bw decimal(12,2), in jzx_bw decimal(12,2), in other_bw decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    declare var_ratio_yytrq decimal(20,18)  default 0;
    declare var_ratio_jsks decimal(20,18)  default 0;
    declare var_ratio_mt decimal(20,18)  default 0;
    declare var_ratio_jzx decimal(20,18)  default 0;
    SELECT ratio_yytrq, ratio_jsks,ratio_mt, ratio_jzx INTO var_ratio_yytrq, var_ratio_jsks, var_ratio_mt, var_ratio_jzx FROM kbnl_ratio where kbnl_ratio.gk = gk LIMIT 1;
    insert into gkmtkbnl(year,gk,mt_bw,yy_bw,jsks_bw,jzx_bw,other_bw,ratio_yytrq,ratio_jsks,ratio_mt,ratio_jzx) values(year,gk,mt_bw,yy_bw,jsks_bw,jzx_bw,other_bw,var_ratio_yytrq,var_ratio_jsks,var_ratio_mt,var_ratio_jzx);
    set new_id = last_insert_id();
    select * from gkmtkbnl where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_gkmtkbnl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_gkmtkbnl_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in mtzdkbnl decimal(12,2), in metric decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into gkmtkbnl_nh(year,gk,mtzdkbnl,metric) values(year,gk,mtzdkbnl,metric);
    set new_id = last_insert_id();
    select * from gkmtkbnl_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_lsgkdj` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_lsgkdj`(in year int(11), in gk varchar(12) CHARSET utf8, in lsgkdj int(11))
BEGIN
	declare new_id int unsigned default 0;
    insert into lsgkdj(year,gk,lsgkdj) values(year,gk,lsgkdj);
    set new_id = last_insert_id();
    select * from lsgkdj where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_lsgkdj_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_lsgkdj_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in lsgkdj decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into lsgkdj_nh(year,gk,lsgkdj) values(year,gk,lsgkdj);
    set new_id = last_insert_id();
    select * from lsgkdj_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_mtnlsyx` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_mtnlsyx`(in year int(11), in gk varchar(12) CHARSET utf8, in mttgnl int(11) , in hwttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into mtnlsyx(year,gk,mttgnl,hwttl) values(year,gk,mttgnl,hwttl);
    set new_id = last_insert_id();
    select * from mtnlsyx where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_mtnlsyx_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_mtnlsyx_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in mttgnl decimal(12,2) , in gkhwttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into mtnlsyx_nh(year,gk,mttgnl,gkhwttl) values(year,gk,mttgnl,gkhwttl);
    set new_id = last_insert_id();
    select * from mtnlsyx_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_qwdttlswrs` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_qwdttlswrs`(in year int(11), in gk varchar(12) CHARSET utf8, in qwdttlswrs int(11))
BEGIN
	declare new_id int unsigned default 0;
    insert into qwdttlswrs(year,gk,qwdttlswrs) values(year,gk,qwdttlswrs);
    set new_id = last_insert_id();
    select * from qwdttlswrs where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_qwdttlswrs_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_qwdttlswrs_nh`(in year int(11), in gk varchar(12) CHARSET utf8, in gkaqscsp int(11))
BEGIN
	declare new_id int unsigned default 0;
    insert into qwdttlswrs_nh(year,gk,gkaqscsp) values(year,gk,gkaqscsp);
    set new_id = last_insert_id();
    select * from qwdttlswrs_nh where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_yhgkhwttl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_yhgkhwttl`(in year int(11), in gk varchar(12) CHARSET utf8, in gkhwttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into yhgkhwttl(year,gk,gkhwttl) values(year,gk,gkhwttl);
    set new_id = last_insert_id();
    select * from yhgkhwttl where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `insert_yhgkjzxttl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_yhgkjzxttl`(in year int(11), in gk varchar(12) CHARSET utf8, in jzxttl decimal(12,2))
BEGIN
	declare new_id int unsigned default 0;
    insert into yhgkjzxttl(year,gk,jzxttl) values(year,gk,jzxttl);
    set new_id = last_insert_id();
    select * from yhgkjzxttl where id = new_id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `overall_metric_generator` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `overall_metric_generator`()
BEGIN

DROP TABLE IF EXISTS overall_metric;

create table overall_metric as
select yhgkhwttl.gk, yhgkhwttl.year, 
yhgkhwttl.metric as yhgkhwttl, 
yhgkjzxttl.metric as yhgkjzxttl,
dckbsl.metric as dckbsl,
gkmtkbnl.total_metric as gkmtkbnl,
bmaxttl.total_metric as bmaxttl,
mtnlsyx.metric as mtnlsyx,
cbzgpjts.metric as cbzgpjts,
ddsr.metric as ddsr,
lsgkdj.lsgkdj as lsgkdj,
qwdttlswrs.metric as qwdttlswrs
from
yhgkhwttl, yhgkjzxttl,dckbsl,gkmtkbnl,bmaxttl,mtnlsyx,cbzgpjts,ddsr,lsgkdj,qwdttlswrs
where
 yhgkhwttl.year = yhgkjzxttl.year and yhgkhwttl.gk = yhgkjzxttl.gk
 and  yhgkhwttl.year = dckbsl.year and yhgkhwttl.gk = dckbsl.gk
 and  yhgkhwttl.year = gkmtkbnl.year and yhgkhwttl.gk = gkmtkbnl.gk
 and  yhgkhwttl.year = bmaxttl.year and yhgkhwttl.gk = bmaxttl.gk
 and  yhgkhwttl.year = mtnlsyx.year and yhgkhwttl.gk = mtnlsyx.gk
 and  yhgkhwttl.year = cbzgpjts.year and yhgkhwttl.gk = cbzgpjts.gk
 and  yhgkhwttl.year = ddsr.year and yhgkhwttl.gk = ddsr.gk
 and  yhgkhwttl.year = lsgkdj.year and yhgkhwttl.gk = lsgkdj.gk
 and  yhgkhwttl.year = qwdttlswrs.year and yhgkhwttl.gk = qwdttlswrs.gk;
 
 ALTER TABLE overall_metric
 ADD COLUMN `id` INT(11) NOT NULL AUTO_INCREMENT,
 ADD PRIMARY KEY (`id`);
 
 ALTER TABLE overall_metric
 ADD COLUMN `is_yhgkhwttl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`yhgkhwttl` < 5) and ((least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkhwttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkhwttl`))) then _utf8mb3'港口货物吞吐量 ' else NULL end) 
 VIRTUAL AFTER `qwdttlswrs`,
 ADD COLUMN `is_yhgkjzxttl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`yhgkjzxttl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkjzxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkjzxttl`))) then _utf8mb3'港口集装箱吞吐量 ' else NULL end) 
 VIRTUAL AFTER `is_yhgkhwttl_least_or_secondleast`,
 ADD COLUMN `is_dckbsl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`dckbsl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `dckbsl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `dckbsl`))) then _utf8mb3'港口连通性 ' else NULL end)
 VIRTUAL AFTER `is_yhgkjzxttl_least_or_secondleast`,
 ADD COLUMN `is_gkmtkbnl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkmtkbnl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `gkmtkbnl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `gkmtkbnl`))) then _utf8mb3'码头靠泊能力 ' else NULL end)
 VIRTUAL AFTER `is_dckbsl_least_or_secondleast`,
 ADD COLUMN `is_bmaxttl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`bmaxttl` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `bmaxttl`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `bmaxttl`))) then _utf8mb3'港口岸线利用率 ' else NULL end)
 VIRTUAL AFTER `is_gkmtkbnl_least_or_secondleast`,
 ADD COLUMN `is_mtnlsyx_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`mtnlsyx` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `mtnlsyx`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb3'港口通过能力适应度 ' else NULL end)
 VIRTUAL AFTER `is_bmaxttl_least_or_secondleast`,
 ADD COLUMN `is_cbzgpjts_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`cbzgpjts` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `cbzgpjts`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `cbzgpjts`))) then _utf8mb3'船舶作业效率 ' else NULL end)
 VIRTUAL AFTER `is_mtnlsyx_least_or_secondleast`,
 ADD COLUMN `is_ddsr_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`ddsr` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `ddsr`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `ddsr`))) then _utf8mb3'港口经济贡献 ' else NULL end)
 VIRTUAL AFTER `is_cbzgpjts_least_or_secondleast`,
 ADD COLUMN `is_lsgkdj_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`lsgkdj` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `lsgkdj`))) then _utf8mb3'绿色港口等级 ' else NULL end)
 VIRTUAL AFTER `is_ddsr_least_or_secondleast`,
 ADD COLUMN `is_qwdttlswrs_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`qwdttlswrs` < 5) and ((least(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `qwdttlswrs`))) then _utf8mb3'港口安全生产水平 ' else NULL end)
 VIRTUAL AFTER `is_lsgkdj_least_or_secondleast`,
 ADD COLUMN `least_group` VARCHAR(120) GENERATED ALWAYS AS 
(concat_ws(_utf8mb3'、',`is_yhgkhwttl_least_or_secondleast`,`is_yhgkjzxttl_least_or_secondleast`,`is_dckbsl_least_or_secondleast`,`is_gkmtkbnl_least_or_secondleast`,`is_bmaxttl_least_or_secondleast`,`is_mtnlsyx_least_or_secondleast`,`is_cbzgpjts_least_or_secondleast`,`is_ddsr_least_or_secondleast`,`is_lsgkdj_least_or_secondleast`,`is_qwdttlswrs_least_or_secondleast`))
 VIRTUAL AFTER `is_qwdttlswrs_least_or_secondleast`,
 ADD COLUMN `least_column` VARCHAR(120) GENERATED ALWAYS AS 
(case when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) >= 5) then _utf8mb3'无明显弱项' else concat(_utf8mb3'弱项是',`least_group`) end)
 VIRTUAL AFTER `least_group`,
 ADD COLUMN `is_yhgkhwttl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`yhgkhwttl` > 8) and ((greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkhwttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkhwttl`))) then _utf8mb3'港口货物吞吐量 ' else NULL end)
 VIRTUAL AFTER `least_column`,
 ADD COLUMN `is_yhgkjzxttl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`yhgkjzxttl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `yhgkjzxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `yhgkjzxttl`))) then _utf8mb3'港口集装箱吞吐量 ' else NULL end)
 VIRTUAL AFTER `is_yhgkhwttl_greatest_or_secondgreatest`,
 ADD COLUMN `is_dckbsl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`dckbsl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `dckbsl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `dckbsl`))) then _utf8mb3'港口连通性 ' else NULL end)
 VIRTUAL AFTER `is_yhgkjzxttl_greatest_or_secondgreatest`,
 ADD COLUMN `is_gkmtkbnl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkmtkbnl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `gkmtkbnl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `gkmtkbnl`))) then _utf8mb3'码头靠泊能力 ' else NULL end)
 VIRTUAL AFTER `is_dckbsl_greatest_or_secondgreatest`,
 ADD COLUMN `is_bmaxttl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`bmaxttl` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `bmaxttl`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `bmaxttl`))) then _utf8mb3'港口岸线利用率 ' else NULL end)
 VIRTUAL AFTER `is_gkmtkbnl_greatest_or_secondgreatest`,
 ADD COLUMN `is_mtnlsyx_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`mtnlsyx` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `mtnlsyx`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb3'港口通过能力适应度 ' else NULL end)
 VIRTUAL AFTER `is_bmaxttl_greatest_or_secondgreatest`,
 ADD COLUMN `is_cbzgpjts_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`cbzgpjts` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `cbzgpjts`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `cbzgpjts`))) then _utf8mb3'港口作业效率 ' else NULL end)
 VIRTUAL AFTER `is_mtnlsyx_greatest_or_secondgreatest`,
 ADD COLUMN `is_ddsr_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`ddsr` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `ddsr`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `ddsr`))) then _utf8mb3'港口经济贡献 ' else NULL end)
 VIRTUAL AFTER `is_cbzgpjts_greatest_or_secondgreatest`,
 ADD COLUMN `is_lsgkdj_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`lsgkdj` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`) = `lsgkdj`))) then _utf8mb3'绿色港口等级 ' else NULL end)
 VIRTUAL AFTER `is_ddsr_greatest_or_secondgreatest`,
 ADD COLUMN `is_qwdttlswrs_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`qwdttlswrs` > 8) and ((greatest(`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) or (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`qwdttlswrs`) = `qwdttlswrs`))) then _utf8mb3'港口安全生产水平 ' else NULL end)
 VIRTUAL AFTER `is_lsgkdj_greatest_or_secondgreatest`,
 ADD COLUMN `greatest_group` VARCHAR(120) GENERATED ALWAYS AS 
(concat_ws(_utf8mb3'、',`is_yhgkhwttl_greatest_or_secondgreatest`,`is_yhgkjzxttl_greatest_or_secondgreatest`,`is_dckbsl_greatest_or_secondgreatest`,`is_gkmtkbnl_greatest_or_secondgreatest`,`is_bmaxttl_greatest_or_secondgreatest`,`is_mtnlsyx_greatest_or_secondgreatest`,`is_cbzgpjts_greatest_or_secondgreatest`,`is_ddsr_greatest_or_secondgreatest`,`is_lsgkdj_greatest_or_secondgreatest`,`is_qwdttlswrs_greatest_or_secondgreatest`))
 VIRTUAL AFTER `is_qwdttlswrs_greatest_or_secondgreatest`,
  ADD COLUMN `greatest_column` VARCHAR(120) GENERATED ALWAYS AS 
(case when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) <= 8) then _utf8mb3'无明显强项' else concat(_utf8mb3'强项是',`greatest_group`) end)
 VIRTUAL AFTER `greatest_group`,
 ADD COLUMN `metric` DECIMAL(65,2) GENERATED ALWAYS AS 
(round((((((((`yhgkhwttl` * 0.2) + (`yhgkjzxttl` * 0.5)) + (`dckbsl` * 0.2)) + (`gkmtkbnl` * 0.1)) * 0.4) + ((((`bmaxttl` * 0.5) + (`mtnlsyx` * 0.4)) + (`cbzgpjts` * 0.1)) * 0.3)) + ((((`ddsr` * 0.6) + (`lsgkdj` * 0.2)) + (`qwdttlswrs` * 0.2)) * 0.3)),2))
 VIRTUAL AFTER `greatest_column`;
 
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `overall_metric_nh_generator` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `overall_metric_nh_generator`()
BEGIN

DROP TABLE IF EXISTS overall_metric_nh;

create table overall_metric_nh as
select gkhwttl_nh.gk, gkhwttl_nh.year, 
gkhwttl_nh.metric as gkhwttl, 
gkjzxttl_nh.metric as gkjzxttl,
gkmtkbnl_nh.metric as gkmtkbnl,
bmaxttl_nh.metric as gkaxlyxl,
mtnlsyx_nh.metric as mtnlsyx,
ddsr_nh.metric as gkjjgx,
lsgkdj_nh.lsgkdj as lsgkdj,
qwdttlswrs_nh.gkaqscsp as gkaqscsp
from
gkhwttl_nh, gkjzxttl_nh,gkmtkbnl_nh,bmaxttl_nh,mtnlsyx_nh,ddsr_nh,lsgkdj_nh,qwdttlswrs_nh
where
 gkhwttl_nh.year = gkjzxttl_nh.year and gkhwttl_nh.gk = gkjzxttl_nh.gk
 and  gkhwttl_nh.year = gkmtkbnl_nh.year and gkhwttl_nh.gk = gkmtkbnl_nh.gk
 and  gkhwttl_nh.year = bmaxttl_nh.year and gkhwttl_nh.gk = bmaxttl_nh.gk
 and  gkhwttl_nh.year = mtnlsyx_nh.year and gkhwttl_nh.gk = mtnlsyx_nh.gk
 and  gkhwttl_nh.year = ddsr_nh.year and gkhwttl_nh.gk = ddsr_nh.gk
 and  gkhwttl_nh.year = lsgkdj_nh.year and gkhwttl_nh.gk = lsgkdj_nh.gk
 and  gkhwttl_nh.year = qwdttlswrs_nh.year and gkhwttl_nh.gk = qwdttlswrs_nh.gk;
 
 ALTER TABLE overall_metric_nh
 ADD COLUMN `id` INT(11) NOT NULL AUTO_INCREMENT,
 ADD PRIMARY KEY (`id`);
 
 ALTER TABLE overall_metric_nh
 ADD COLUMN `is_gkhwttl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkhwttl` < 5) and ((least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkhwttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`))) then _utf8mb4'货物吞吐量 ' else NULL end)
 VIRTUAL AFTER `gkaqscsp`,
 ADD COLUMN `is_gkjzxttl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkjzxttl` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjzxttl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`))) then _utf8mb4'集装箱吞吐量 ' else NULL end)
 VIRTUAL AFTER `is_gkhwttl_nh_least_or_secondleast`,
 ADD COLUMN `is_mtkbnl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`mtkbnl` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtkbnl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`))) then _utf8mb4'码头靠泊能力 ' else NULL end)
 VIRTUAL AFTER `is_gkjzxttl_least_or_secondleast`,
 ADD COLUMN `is_gkaxlyxl_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkaxlyxl` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaxlyxl`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`))) then _utf8mb4'港口岸线利用率 ' else NULL end)
 VIRTUAL AFTER `is_mtkbnl_least_or_secondleast`,
 ADD COLUMN `is_mtnlsyx_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`mtnlsyx` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtnlsyx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb4'港口通过能力适应度 ' else NULL end)
 VIRTUAL AFTER `is_gkaxlyxl_least_or_secondleast`,
 ADD COLUMN `is_gkjjgx_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkjjgx` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjjgx`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`))) then _utf8mb4'港口经济贡献 ' else NULL end)
 VIRTUAL AFTER `is_mtnlsyx_least_or_secondleast`,
 ADD COLUMN `is_lsgkdj_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`lsgkdj` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `lsgkdj`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`))) then _utf8mb4'绿色港口等级 ' else NULL end)
 VIRTUAL AFTER `is_gkjjgx_least_or_secondleast`,
 ADD COLUMN `is_gkaqscsp_least_or_secondleast` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkaqscsp` < 5) and ((least(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaqscsp`) or (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`))) then _utf8mb4'港口安全生产水平 ' else NULL end)
 VIRTUAL AFTER `is_lsgkdj_least_or_secondleast`,
 ADD COLUMN `least_group` VARCHAR(120) GENERATED ALWAYS AS 
(concat_ws(_utf8mb4'、',`is_gkhwttl_least_or_secondleast`,`is_gkjzxttl_least_or_secondleast`,`is_mtkbnl_least_or_secondleast`,`is_gkaxlyxl_least_or_secondleast`,`is_mtnlsyx_least_or_secondleast`,`is_gkjjgx_least_or_secondleast`,`is_gkaqscsp_least_or_secondleast`,`is_lsgkdj_least_or_secondleast`))
 VIRTUAL AFTER `is_gkaqscsp_least_or_secondleast`,
 ADD COLUMN `least_column` VARCHAR(120) GENERATED ALWAYS AS 
(case when (least(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) >= 5) then _utf8mb4'无明显弱项' else concat(_utf8mb4'弱项是',`least_group`) end)
 VIRTUAL AFTER `least_group`,
 ADD COLUMN `is_gkhwttl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkhwttl` > 8) and ((greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkhwttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkhwttl`))) then _utf8mb4'货物吞吐量 ' else NULL end)
 VIRTUAL AFTER `least_column`,
 ADD COLUMN `is_gkjzxttl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkjzxttl` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjzxttl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjzxttl`))) then _utf8mb4'集装箱吞吐量 ' else NULL end)
 VIRTUAL AFTER `is_gkhwttl_greatest_or_secondgreatest`,
 ADD COLUMN `is_mtkbnl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`mtkbnl` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtkbnl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtkbnl`))) then _utf8mb4'码头靠泊能力 ' else NULL end)
 VIRTUAL AFTER `is_gkjzxttl_greatest_or_secondgreatest`,
 ADD COLUMN `is_gkaxlyxl_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkaxlyxl` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaxlyxl`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaxlyxl`))) then _utf8mb4'港口岸线利用率 ' else NULL end)
 VIRTUAL AFTER `is_mtkbnl_greatest_or_secondgreatest`,
 ADD COLUMN `is_mtnlsyx_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`mtnlsyx` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `mtnlsyx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `mtnlsyx`))) then _utf8mb4'港口通过能力适应度 ' else NULL end)
 VIRTUAL AFTER `is_gkaxlyxl_greatest_or_secondgreatest`,
 ADD COLUMN `is_gkjjgx_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkjjgx` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkjjgx`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkjjgx`))) then _utf8mb4'港口经济贡献 ' else NULL end)
 VIRTUAL AFTER `is_mtnlsyx_greatest_or_secondgreatest`,
 ADD COLUMN `is_lsgkdj_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`lsgkdj` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`lsgkdj`) = `lsgkdj`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `lsgkdj`))) then _utf8mb4'绿色港口等级 ' else NULL end)
 VIRTUAL AFTER `is_gkjjgx_greatest_or_secondgreatest`,
 ADD COLUMN `is_gkaqscsp_greatest_or_secondgreatest` VARCHAR(45) GENERATED ALWAYS AS 
(case when ((`gkaqscsp` > 8) and ((greatest(`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`) = `gkaqscsp`) or (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) = `gkaqscsp`))) then _utf8mb4'港口安全生产水平 ' else NULL end)
 VIRTUAL AFTER `is_lsgkdj_greatest_or_secondgreatest`,
 ADD COLUMN `greatest_group` VARCHAR(120) GENERATED ALWAYS AS 
(concat_ws(_utf8mb4'、',`is_gkhwttl_greatest_or_secondgreatest`,`is_gkjzxttl_greatest_or_secondgreatest`,`is_mtkbnl_greatest_or_secondgreatest`,`is_gkaxlyxl_greatest_or_secondgreatest`,`is_mtnlsyx_greatest_or_secondgreatest`,`is_gkjjgx_greatest_or_secondgreatest`,`is_gkaqscsp_greatest_or_secondgreatest`,`is_lsgkdj_greatest_or_secondgreatest`))
 VIRTUAL AFTER `is_gkaqscsp_greatest_or_secondgreatest`,
  ADD COLUMN `greatest_column` VARCHAR(120) GENERATED ALWAYS AS 
(case when (greatest(`gkhwttl`,`gkjzxttl`,`mtkbnl`,`gkaxlyxl`,`mtnlsyx`,`gkjjgx`,`gkaqscsp`,`lsgkdj`) <= 8) then _utf8mb4'无明显强项' else concat(_utf8mb4'强项是',`greatest_group`) end)
 VIRTUAL AFTER `greatest_group`,
 ADD COLUMN `metric` DECIMAL(65,2) GENERATED ALWAYS AS 
((((((`gkhwttl` * 0.4) + (`gkjzxttl` * 0.4)) + (`mtkbnl` * 0.2)) * 0.4) + (((`gkaxlyxl` * 0.3) + (`mtnlsyx` * 0.7)) * 0.3)) + ((((`gkjjgx` * 0.4) + (`lsgkdj` * 0.3)) + (`gkaqscsp` * 0.3)) * 0.3))
 VIRTUAL AFTER `greatest_column`;
 
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `radar_generator_for_year` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `radar_generator_for_year`(in year int(11))
BEGIN

SET @k = CONCAT('DROP TABLE IF EXISTS overall_metric_', year);
PREPARE temp FROM @k; 
EXECUTE temp; 
DEALLOCATE PREPARE temp; 

SET @s = CONCAT('create table overall_metric_', year, ' as
select yhgkhwttl.gk, yhgkhwttl.year, 
yhgkhwttl.metric as yhgkhwttl, 
yhgkjzxttl.metric as yhgkjzxttl,
dckbsl.metric as dckbsl,
gkmtkbnl.total_metric as gkmtkbnl,
bmaxttl.total_metric as bmaxttl,
mtnlsyx.metric as mtnlsyx,
cbzgpjts.metric as cbzgpjts,
ddsr.metric as ddsr,
lsgkdj.lsgkdj as lsgkdj,
qwdttlswrs.metric as qwdttlswrs
from
yhgkhwttl, yhgkjzxttl,dckbsl,gkmtkbnl,bmaxttl,mtnlsyx,cbzgpjts,ddsr,lsgkdj,qwdttlswrs
where
yhgkhwttl.year = ', year,
' and yhgkjzxttl.year = ', year, ' and yhgkhwttl.gk = yhgkjzxttl.gk
and dckbsl.year = ', year, ' and yhgkhwttl.gk = dckbsl.gk
and gkmtkbnl.year = ', year, ' and yhgkhwttl.gk = gkmtkbnl.gk
and bmaxttl.year = ', year, ' and yhgkhwttl.gk = bmaxttl.gk
and mtnlsyx.year = ', year, ' and yhgkhwttl.gk = mtnlsyx.gk
and cbzgpjts.year = ',year,' and yhgkhwttl.gk = cbzgpjts.gk
and ddsr.year = ',year,' and yhgkhwttl.gk = ddsr.gk
and lsgkdj.year = ',year,' and yhgkhwttl.gk = lsgkdj.gk
and qwdttlswrs.year = ',year,' and yhgkhwttl.gk = qwdttlswrs.gk;'); 

PREPARE temp2 FROM @s; 
EXECUTE temp2; 
DEALLOCATE PREPARE temp2; 

set @t = CONCAT('ALTER TABLE overall_metric_', year, '
 ADD COLUMN `least_column` VARCHAR(45) GENERATED ALWAYS AS 
 ((case when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) then \'货物吞吐量\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) then \'集装箱吞吐量\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) then \'大船靠泊比重\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) then \'码头最大靠泊能力\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) then \'百米岸线吞吐量\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) then \'码头能力适应性\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) then \'千吨停时\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) then \'单吨收入\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) then \'绿色港口\' when (least(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) then \'千万吨吞吐量死亡人数\' end))
 VIRTUAL AFTER `qwdttlswrs`,
 ADD COLUMN `greatest_column` VARCHAR(45) GENERATED ALWAYS AS 
 ((case when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkhwttl`) then \'货物吞吐量\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `yhgkjzxttl`) then \'集装箱吞吐量\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `dckbsl`) then \'大船靠泊比重\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `gkmtkbnl`) then \'码头最大靠泊能力\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `bmaxttl`) then \'百米岸线吞吐量\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `mtnlsyx`) then \'码头能力适应性\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `cbzgpjts`) then \'千吨停时\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `ddsr`) then \'单吨收入\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `lsgkdj`) then \'绿色港口\' when (greatest(`yhgkhwttl`,`yhgkjzxttl`,`dckbsl`,`gkmtkbnl`,`bmaxttl`,`mtnlsyx`,`cbzgpjts`,`ddsr`,`lsgkdj`,`qwdttlswrs`) = `qwdttlswrs`) then \'千万吨吞吐量死亡人数\' end))
 VIRTUAL AFTER `least_column`;');
 
 PREPARE temp1 FROM @t; 
 EXECUTE temp1; 
 DEALLOCATE PREPARE temp1; 

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_bmaxttl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_bmaxttl`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in jzxbwcd int(11), in f_jzxbwcd int(11), in jzxttl_xs decimal(65,30), in jzxttl_zl decimal(65,30), in  f_jzxttl_zl decimal(65,30))
BEGIN
	/* declare target int default 0; */
    update bmaxttl 
	set bmaxttl.year = year,
	bmaxttl.gk = gk,
	bmaxttl.jzxbwcd = jzxbwcd,
	bmaxttl.f_jzxbwcd = f_jzxbwcd,
	bmaxttl.jzxttl_xs = jzxttl_xs,
	bmaxttl.jzxttl_zl = jzxttl_zl,
	bmaxttl.f_jzxttl_zl = f_jzxttl_zl
	where bmaxttl.id = id;
    /* select total_metric into target
    from tmaxttl where tmaxttl.id = id;
    
    update overall_metric_for_radar
    set overall_metric_for_radar.bmaxttl = target
    where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year; */
    select * from bmaxttl where bmaxttl.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_bmaxttl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_bmaxttl_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in gkhwttl decimal(65,2), in mtaxcd decimal(65,2))
BEGIN
	/* declare target int default 0; */
    update bmaxttl_nh 
	set bmaxttl_nh.year = year,
	bmaxttl_nh.gk = gk,
	bmaxttl_nh.gkhwttl = gkhwttl,
	bmaxttl_nh.mtaxcd = mtaxcd
	where bmaxttl_nh.id = id;
    /* select total_metric into target
    from tmaxttl where tmaxttl.id = id;
    
    update overall_metric_for_radar
    set overall_metric_for_radar.bmaxttl = target
    where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year; */
    select * from bmaxttl_nh where bmaxttl.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_cbzgpjts` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_cbzgpjts`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in wmc_pjqdts decimal(12,2)  , in nmc_pjqdts decimal(12,2),wm_hwttl decimal(12,2),nm_hwttl decimal(12,2) )
BEGIN
	declare target int default 0;
    
    update cbzgpjts 
	set cbzgpjts.year = year,
	cbzgpjts.gk = gk,
	cbzgpjts.wmc_pjqdts = wmc_pjqdts,
	cbzgpjts.nmc_pjqdts = nmc_pjqdts,
	cbzgpjts.wm_hwttl = wm_hwttl,
	cbzgpjts.nm_hwttl = nm_hwttl
	where cbzgpjts.id = id;
    
    select metric into target
    from cbzgpjts where id = id;
    
    update overall_metric_for_radar
    set overall_metric_for_radar.cbzgpjts = target
    where overall_metric_for_radar.gk = gk and overall_metric_for_radar.year = year;
    
    select * from cbzgpjts where cbzgpjts.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_dckbsl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_dckbsl`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in dckbsl int(11))
BEGIN
    update dckbsl set dckbsl.year = year,dckbsl.gk = gk,dckbsl.dckbsl = dckbsl where dckbsl.id = id;
    select * from dckbsl where dckbsl.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_ddsr` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_ddsr`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in ddsr decimal(65,30) )
BEGIN
    update ddsr 
	set ddsr.year = year,
	ddsr.gk = gk,
	ddsr.ddsr = ddsr
	where ddsr.id = id;
    select * from ddsr where ddsr.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_ddsr_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_ddsr_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in gkzjz decimal(65,2) )
BEGIN
    update ddsr_nh 
	set ddsr_nh.year = year,
	ddsr_nh.gk = gk,
	ddsr_nh.gkzjz = gkzjz
	where ddsr_nh.id = id;
    select * from ddsr_nh where ddsr_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_gkhwttl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_gkhwttl_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in gkhwttl decimal(12,2))
BEGIN
    update gkhwttl_nh set gkhwttl_nh.year = year,gkhwttl_nh.gk = gk,gkhwttl_nh.gkhwttl = gkhwttl where gkhwttl_nh.id = id;
    select * from gkhwttl_nh where gkhwttl_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_gkjzxttl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_gkjzxttl_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in jzxttl decimal(12,2))
BEGIN
    update gkjzxttl_nh set gkjzxttl_nh.year = year,gkjzxttl_nh.gk = gk,gkjzxttl_nh.jzxttl = jzxttl where gkjzxttl_nh.id = id;
    select * from gkjzxttl_nh where gkjzxttl_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_gkmtkbnl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_gkmtkbnl`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in mt_bw decimal(12,2), in yy_bw decimal(12,2), in jsks_bw decimal(12,2), in jzx_bw decimal(12,2), in other_bw decimal(12,2))
BEGIN
    update gkmtkbnl 
    set gkmtkbnl.year = year,
    gkmtkbnl.gk = gk,
    gkmtkbnl.mt_bw = mt_bw,
     gkmtkbnl.yy_bw = yy_bw,
      gkmtkbnl.jsks_bw = jsks_bw,
       gkmtkbnl.jzx_bw = jzx_bw,
        gkmtkbnl.other_bw = other_bw    
    where gkmtkbnl.id = id;
    select * from gkmtkbnl where gkmtkbnl.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_gkmtkbnl_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_gkmtkbnl_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in mtzdkbnl decimal(12,2), in metric decimal(12,2))
BEGIN
    update gkmtkbnl_nh 
    set gkmtkbnl_nh.year = year,
    gkmtkbnl_nh.gk = gk,
    gkmtkbnl_nh.mtzdkbnl = mtzdkbnl,
     gkmtkbnl_nh.metric = metric  
    where gkmtkbnl_nh.id = id;
    select * from gkmtkbnl_nh where gkmtkbnl_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_lsgkdj` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_lsgkdj`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in lsgkdj decimal(12,2))
BEGIN
    update lsgkdj 
	set lsgkdj.year = year,
	lsgkdj.gk = gk,
	lsgkdj.lsgkdj = lsgkdj
	where lsgkdj.id = id;
    select * from lsgkdj where lsgkdj.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_lsgkdj_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_lsgkdj_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in lsgkdj decimal(12,2))
BEGIN
    update lsgkdj_nh 
	set lsgkdj_nh.year = year,
	lsgkdj_nh.gk = gk,
	lsgkdj_nh.lsgkdj = lsgkdj
	where lsgkdj_nh.id = id;
    select * from lsgkdj_nh where lsgkdj_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_mtnlsyx` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_mtnlsyx`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in mttgnl int(11) , in hwttl decimal(12,2))
BEGIN
    update mtnlsyx 
	set mtnlsyx.year = year,
	mtnlsyx.gk = gk,
	mtnlsyx.mttgnl = mttgnl,
	mtnlsyx.hwttl = hwttl
	where mtnlsyx.id = id;
    select * from mtnlsyx where mtnlsyx.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_mtnlsyx_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_mtnlsyx_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in mttgnl decimal(12,2) , in gkhwttl decimal(12,2))
BEGIN
    update mtnlsyx_nh 
	set mtnlsyx_nh.year = year,
	mtnlsyx_nh.gk = gk,
	mtnlsyx_nh.mttgnl = mttgnl,
	mtnlsyx_nh.gkhwttl = gkhwttl
	where mtnlsyx_nh.id = id;
    select * from mtnlsyx_nh where mtnlsyx_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_qwdttlswrs` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_qwdttlswrs`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in qwdttlswrs int(11))
BEGIN
    update qwdttlswrs 
	set qwdttlswrs.year = year,
	qwdttlswrs.gk = gk,
	qwdttlswrs.qwdttlswrs = qwdttlswrs
	where qwdttlswrs.id = id;
    select * from qwdttlswrs where qwdttlswrs.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_qwdttlswrs_nh` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_qwdttlswrs_nh`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in gkaqscsp int(11))
BEGIN
    update qwdttlswrs_nh 
	set qwdttlswrs_nh.year = year,
	qwdttlswrs_nh.gk = gk,
	qwdttlswrs_nh.gkaqscsp = gkaqscsp
	where qwdttlswrs_nh.id = id;
    select * from qwdttlswrs_nh where qwdttlswrs_nh.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `update_yhgkhwttl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_yhgkhwttl`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in gkhwttl decimal(12,2))
BEGIN
    update yhgkhwttl set yhgkhwttl.year = year,yhgkhwttl.gk = gk,yhgkhwttl.gkhwttl = gkhwttl where yhgkhwttl.id = id;
    select * from yhgkhwttl where yhgkhwttl.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;
/*!50003 DROP PROCEDURE IF EXISTS `update_yhgkjzxttl` */;
ALTER DATABASE `harbour` CHARACTER SET latin1 COLLATE latin1_swedish_ci ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8 */ ;
/*!50003 SET character_set_results = utf8 */ ;
/*!50003 SET collation_connection  = utf8_general_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `update_yhgkjzxttl`(in id int(11),in year int(11), in gk varchar(12) CHARSET utf8, in jzxttl decimal(12,2))
BEGIN
    update yhgkjzxttl set yhgkjzxttl.year = year,yhgkjzxttl.gk = gk,yhgkjzxttl.jzxttl = jzxttl where yhgkjzxttl.id = id;
    select * from yhgkjzxttl where yhgkjzxttl.id = id ;
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
ALTER DATABASE `harbour` CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci ;

--
-- Final view structure for view `bmaxttl_stat`
--

/*!50001 DROP VIEW IF EXISTS `bmaxttl_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `bmaxttl_stat` AS select `bmaxttl`.`year` AS `year`,round(min((`bmaxttl`.`hwttl` / (`bmaxttl`.`jzxbwcd` + `bmaxttl`.`f_jzxbwcd`))),2) AS `min`,round(avg((`bmaxttl`.`hwttl` / (`bmaxttl`.`jzxbwcd` + `bmaxttl`.`f_jzxbwcd`))),2) AS `avg`,round(max((`bmaxttl`.`hwttl` / (`bmaxttl`.`jzxbwcd` + `bmaxttl`.`f_jzxbwcd`))),2) AS `max` from `bmaxttl` group by `bmaxttl`.`year` order by `bmaxttl`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `cbzgpjts_stat`
--

/*!50001 DROP VIEW IF EXISTS `cbzgpjts_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `cbzgpjts_stat` AS select `cbzgpjts`.`year` AS `year`,min(`cbzgpjts`.`jqpjqdts`) AS `min`,round(avg(`cbzgpjts`.`jqpjqdts`),2) AS `avg`,max(`cbzgpjts`.`jqpjqdts`) AS `max` from `cbzgpjts` group by `cbzgpjts`.`year` order by `cbzgpjts`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `dckbsl_stat`
--

/*!50001 DROP VIEW IF EXISTS `dckbsl_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `dckbsl_stat` AS select `dckbsl`.`year` AS `year`,min(`dckbsl`.`dckbsl`) AS `min`,round(avg(`dckbsl`.`dckbsl`),2) AS `avg`,max(`dckbsl`.`dckbsl`) AS `max` from `dckbsl` group by `dckbsl`.`year` order by `dckbsl`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `ddsr_stat`
--

/*!50001 DROP VIEW IF EXISTS `ddsr_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `ddsr_stat` AS select `ddsr`.`year` AS `year`,round(min(`ddsr`.`ddsr`),2) AS `min`,round(avg(`ddsr`.`ddsr`),2) AS `avg`,round(max(`ddsr`.`ddsr`),2) AS `max` from `ddsr` group by `ddsr`.`year` order by `ddsr`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `hwttl_stat`
--

/*!50001 DROP VIEW IF EXISTS `hwttl_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `hwttl_stat` AS select `yhgkhwttl`.`year` AS `year`,min(`yhgkhwttl`.`gkhwttl`) AS `min`,round(avg(`yhgkhwttl`.`gkhwttl`),2) AS `avg`,max(`yhgkhwttl`.`gkhwttl`) AS `max` from `yhgkhwttl` group by `yhgkhwttl`.`year` order by `yhgkhwttl`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `jzxttl_stat`
--

/*!50001 DROP VIEW IF EXISTS `jzxttl_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `jzxttl_stat` AS select `yhgkjzxttl`.`year` AS `year`,round(min(`yhgkjzxttl`.`jzxttl`),2) AS `min`,round(avg(`yhgkjzxttl`.`jzxttl`),2) AS `avg`,round(max(`yhgkjzxttl`.`jzxttl`),2) AS `max` from `yhgkjzxttl` group by `yhgkjzxttl`.`year` order by `yhgkjzxttl`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `lsgkdj_stat`
--

/*!50001 DROP VIEW IF EXISTS `lsgkdj_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `lsgkdj_stat` AS select `lsgkdj`.`year` AS `year`,min(`lsgkdj`.`lsgkdj`) AS `min`,round(avg(`lsgkdj`.`lsgkdj`),2) AS `avg`,max(`lsgkdj`.`lsgkdj`) AS `max` from `lsgkdj` group by `lsgkdj`.`year` order by `lsgkdj`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `mtkbnl_stat`
--

/*!50001 DROP VIEW IF EXISTS `mtkbnl_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `mtkbnl_stat` AS select `gkmtkbnl`.`year` AS `year`,round(max(`gkmtkbnl`.`mt_bw`),2) AS `mt_bw_max`,round(max(`gkmtkbnl`.`yy_bw`),2) AS `yy_bw_max`,round(max(`gkmtkbnl`.`jsks_bw`),2) AS `jsks_bw_max`,round(max(`gkmtkbnl`.`jzx_bw`),2) AS `jzx_bw_max` from `gkmtkbnl` group by `gkmtkbnl`.`year` order by `gkmtkbnl`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `mtnlsyx_stat`
--

/*!50001 DROP VIEW IF EXISTS `mtnlsyx_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `mtnlsyx_stat` AS select `mtnlsyx`.`year` AS `year`,min(`mtnlsyx`.`mtnlsyd`) AS `min`,round(avg(`mtnlsyx`.`mtnlsyd`),2) AS `avg`,max(`mtnlsyx`.`mtnlsyd`) AS `max` from `mtnlsyx` group by `mtnlsyx`.`year` order by `mtnlsyx`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `overall_metric_for_order`
--

/*!50001 DROP VIEW IF EXISTS `overall_metric_for_order`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8mb4 */;
/*!50001 SET character_set_results     = utf8mb4 */;
/*!50001 SET collation_connection      = utf8mb4_0900_ai_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `overall_metric_for_order` AS select `o`.`gk` AS `gk`,`o`.`year` AS `year`,((((`o`.`yhgkhwttl` * 0.2) + (`o`.`yhgkjzxttl` * 0.5)) + (`o`.`dckbsl` * 0.2)) + (`o`.`gkmtkbnl` * 0.1)) AS `gm`,(((`o`.`bmaxttl` * 0.5) + (`o`.`mtnlsyx` * 0.4)) + (`o`.`cbzgpjts` * 0.1)) AS `xl`,(((`o`.`ddsr` * 0.6) + (`o`.`lsgkdj` * 0.2)) + (`o`.`qwdttlswrs` * 0.2)) AS `xy`,round((((((((`o`.`yhgkhwttl` * 0.2) + (`o`.`yhgkjzxttl` * 0.5)) + (`o`.`dckbsl` * 0.2)) + (`o`.`gkmtkbnl` * 0.1)) * 0.4) + ((((`o`.`bmaxttl` * 0.5) + (`o`.`mtnlsyx` * 0.4)) + (`o`.`cbzgpjts` * 0.1)) * 0.3)) + ((((`o`.`ddsr` * 0.6) + (`o`.`lsgkdj` * 0.2)) + (`o`.`qwdttlswrs` * 0.2)) * 0.3)),2) AS `metric`,(select count(`overall_metric`.`metric`) from `overall_metric` where ((`overall_metric`.`metric` >= `o`.`metric`) and (`overall_metric`.`year` = `o`.`year`))) AS `rank` from `overall_metric` `o` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `overall_metric_for_order_nh`
--

/*!50001 DROP VIEW IF EXISTS `overall_metric_for_order_nh`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8mb4 */;
/*!50001 SET character_set_results     = utf8mb4 */;
/*!50001 SET collation_connection      = utf8mb4_0900_ai_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `overall_metric_for_order_nh` AS select `o`.`gk` AS `gk`,`o`.`year` AS `year`,`o`.`metric` AS `metric`,(select count(`overall_metric_nh`.`metric`) from `overall_metric_nh` where ((`overall_metric_nh`.`metric` >= `o`.`metric`) and (`overall_metric_nh`.`year` = `o`.`year`))) AS `rank` from `overall_metric_nh` `o` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;

--
-- Final view structure for view `qwdttlswrs_stat`
--

/*!50001 DROP VIEW IF EXISTS `qwdttlswrs_stat`*/;
/*!50001 SET @saved_cs_client          = @@character_set_client */;
/*!50001 SET @saved_cs_results         = @@character_set_results */;
/*!50001 SET @saved_col_connection     = @@collation_connection */;
/*!50001 SET character_set_client      = utf8 */;
/*!50001 SET character_set_results     = utf8 */;
/*!50001 SET collation_connection      = utf8_general_ci */;
/*!50001 CREATE ALGORITHM=UNDEFINED */
/*!50013 DEFINER=`root`@`localhost` SQL SECURITY DEFINER */
/*!50001 VIEW `qwdttlswrs_stat` AS select `qwdttlswrs`.`year` AS `year`,min(`qwdttlswrs`.`qwdttlswrs`) AS `min`,round(avg(`qwdttlswrs`.`qwdttlswrs`),2) AS `avg`,max(`qwdttlswrs`.`qwdttlswrs`) AS `max` from `qwdttlswrs` group by `qwdttlswrs`.`year` order by `qwdttlswrs`.`year` */;
/*!50001 SET character_set_client      = @saved_cs_client */;
/*!50001 SET character_set_results     = @saved_cs_results */;
/*!50001 SET collation_connection      = @saved_col_connection */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-10-18 18:25:13
